Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If a package is developed specially for Debian and is not distributed outside of Debian, there is just one <filename>.tar.{gz,bz2,xz}</filename> file which contains the sources of the program, it's called a “native” source package. If a package is distributed elsewhere too, the <filename>.orig.tar.{gz,bz2,xz}</filename> file stores the so-called <literal>upstream source code</literal>, that is the source code that's distributed by the <literal>upstream maintainer</literal> (often the author of the software). In this case, the <filename>.diff.gz</filename> or the <filename>debian.tar.{gz,bz2,xz}</filename> contains the changes made by the Debian maintainer.
ru: Если пакет разработан специально для Debian и не распространяется за пределами Debian, то в нём содержится только один файл <filename>.tar.{gz,bz2,xz}</filename>, содержащий исходный код программы, такой пакет называется “родным” пакетом с исходным кодом. Если пакет распространяется где-либо ещё, файл <filename>.orig.tar.{gz,bz2,xz}</filename> содержит так называемый <literal>исходный код из основной ветки разработки</literal>, то есть исходный код, распространяемый <literal>сопровождающим основной ветки</literal> (часто это автор ПО). В этом случае файл <filename>.diff.gz</filename> или <filename>debian.tar.{gz,bz2,xz}</filename> содержит изменения, сделанные сопровождающим Debian.

source: The <filename>.dsc</filename> file lists all the files in the source package together with checksums (<command>md5sums</command>) and some additional info about the package (maintainer, version, etc.).
ru: Файл <filename>.dsc</filename> содержит список всех файлов в пакете с исходным кодом, а также их контрольные суммы (<command>md5sums</command>) и некоторую дополнительную информацию о пакете (сопровождающий, версия и т. д.).

source: Distributions
ru: Выпуски

source: To summarize, the Debian archive has a root directory within an FTP server. For instance, at the mirror site, <literal>ftp.us.debian.org</literal>, the Debian archive itself is contained in <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, which is a common location (another is <filename>/pub/debian</filename>).
ru: Подводя итог, скажем, что корневой каталог архива Debian расположен на сервере FTP. Например, на зеркальном сайте, <literal>ftp.us.debian.org</literal>, сам архив Debian содержится в <ulink url="ftp://ftp.us.debian.org/debian">/debian</ulink>, что является его обычным расположением (другое расположение &mdash; <filename>/pub/debian</filename>).

source: A distribution comprises Debian source and binary packages, and the respective <filename>Sources</filename> and <filename>Packages</filename> index files, containing the header information from all those packages. The former are kept in the <filename>pool/</filename> directory, while the latter are kept in the <filename>dists/</filename> directory of the archive (for backwards compatibility).
ru: Выпуск включает в себя исходный код Debian и двоичные пакеты, а также соответствующие индексные файлы <filename>Sources</filename> и <filename>Packages</filename>, содержащие заголовочную информацию всех пакетов. Первый файл хранится в каталоге <filename>pool/</filename>, а последний &mdash; в каталоге <filename>dists/</filename> архива (для обратной совместимости).

source: Stable, testing, and unstable
ru: Стабильный, тестируемые и нестабильный выпуски

source: There are always distributions called <literal>stable</literal> (residing in <filename>dists/stable</filename>), <literal>testing</literal> (residing in <filename>dists/testing</filename>), and <literal>unstable</literal> (residing in <filename>dists/unstable</filename>). This reflects the development process of the Debian project.
ru: Всегда имеются выпуски, называемые <literal>стабильным</literal> выпуск (он расположен в <filename>dists/stable</filename>), <literal>тестируемый</literal> выпуск (он расположен в <filename>dists/testing</filename>), а также <literal>нестабильный</literal> выпуск (он расположен в <filename>dists/unstable</filename>). Эта иерархия отражает процесс разработки Проекта Debian.

source: Active development is done in the <literal>unstable</literal> distribution (that's why this distribution is sometimes called the <literal>development distribution</literal>). Every Debian developer can update their packages in this distribution at any time. Thus, the contents of this distribution change from day to day. Since no special effort is made to make sure everything in this distribution is working properly, it is sometimes literally unstable.
ru: Активная разработка выполняется в <literal>нестабильном</literal> выпуске (вот почему этот выпуск иногда называется <literal>разрабатываемым выпуском</literal>). Каждый разработчик Debian может загружать свои пакеты в этот выпуск в любое время. Таким образом, содержимое этого выпуска меняется день ото дня. Поскольку для того, чтобы убедится, что этот выпуск работает нормально, иногда он в буквальном смысле бывает нестабильным.

source: The <link linkend="testing">testing</link> distribution is generated automatically by taking packages from <literal>unstable</literal> if they satisfy certain criteria. Those criteria should ensure a good quality for packages within <literal>testing</literal>. The update to <literal>testing</literal> is launched twice each day, right after the new packages have been installed. See <xref linkend="testing"/>.
ru: <link linkend="testing">Тестируемый</link> выпуск создаётся автоматически путём принятия пакетов из <literal>нестабильного</literal> выпуска, если они удовлетворяют определённым критериям. Эти критерии должны гарантировать хорошее качестве пакетов в <literal>тестируемом</literal> выпуске. Обновление <literal>тестируемого</literal> выпуска запускается дважды в день, сразу после установки новых пакетов. См. <xref linkend="testing"/>.

source: After a period of development, once the release manager deems fit, the <literal>testing</literal> distribution is frozen, meaning that the policies which control how packages move from <literal>unstable</literal> to <literal>testing</literal> are tightened. Packages which are too buggy are removed. No changes are allowed into <literal>testing</literal> except for bug fixes. After some time has elapsed, depending on progress, the <literal>testing</literal> distribution is frozen even further. Details of the handling of the testing distribution are published by the Release Team on debian-devel-announce. After the open issues are solved to the satisfaction of the Release Team, the distribution is released. Releasing means that <literal>testing</literal> is renamed to <literal>stable</literal>, and a new copy is created for the new <literal>testing</literal>, and the previous <literal>stable</literal> is renamed to <literal>oldstable</literal> and stays there until it is finally archived. On archiving, the contents are moved to <literal>&archive-host;</literal>.
ru: После периода разработки, когда управляющий выпуском решает, что время подходящее, <literal>тестируемый</literal> выпуск замораживается, что означает, что правила, управляющие тем, как пакеты переходят из <literal>нестабильного</literal> выпуска в <literal>тестируемый</literal> ужесточаются. Удаляются пакеты с большим количеством ошибок. Запрещается изменять что-либо в <literal>тестируемом</literal> выпуске за исключением исправления ошибок. Через некоторое время, в зависимости от хода всего процесса, <literal>тестируемый</literal> выпуск переходит на вторую стадию заморозки. Подробности работы с тестируемым выпуском публикуются выпускающей командой в списке рассылки debian-devel-announce. Когда открытые проблемы будут решены так, что выпускающая команда будет удовлетворена, осуществляется выпуск дистрибутива. Это предполагает, что <literal>тестируемый</literal> выпуск переименовывается в <literal>стабильный</literal> выпуск, создаётся его копия для нового <literal>тестируемого</literal> выпуска, а предыдущий <literal>стабильный</literal> переименовывается в <literal>предыдущий стабильный</literal> выпуск и остаётся им до тех пор пока наконец не будет архивирован. Во время архивирования его содержимое перемещается на <literal>&archive-host;</literal>.

source: This development cycle is based on the assumption that the <literal>unstable</literal> distribution becomes <literal>stable</literal> after passing a period of being in <literal>testing</literal>. Even once a distribution is considered stable, a few bugs inevitably remain — that's why the stable distribution is updated every now and then. However, these updates are tested very carefully and have to be introduced into the archive individually to reduce the risk of introducing new bugs. You can find proposed additions to <literal>stable</literal> in the <filename>proposed-updates</filename> directory. Those packages in <filename>proposed-updates</filename> that pass muster are periodically moved as a batch into the stable distribution and the revision level of the stable distribution is incremented (e.g., ‘6.0’ becomes ‘6.0.1’, ‘5.0.7’ becomes ‘5.0.8’, and so forth). Please refer to <link linkend="upload-stable">uploads to the <literal>stable</literal> distribution</link> for details.
ru: Этот цикл разработки основывается на допущении, что <literal>нестабильный</literal> выпуск становится <literal>стабильным</literal> после периода <literal>тестирования</literal>. Даже если выпуск считается стабильным, в нём всё равно присутствуют ошибки — вот почему стабильный выпуск продолжает обновляться. Тем не менее, эти обновления довольно тщательно тестируются до их включения в архив и добавляются по одному для того, чтобы снизить риск добавления новых ошибок. Вы можете найти предлагаемые дополнения к <literal>стабильному</literal> выпуску в каталоге <filename>proposed-updates</filename>. Те пакеты из <filename>proposed-updates</filename>, которые прошли проверку, периодически перемещаются в составе группы других пакетов в стабильный выпуск, а номер редакции стабильного выпуска увеличивается (напр., ‘6.0’ становится ‘6.0.1’, ‘5.0.7’ становится ‘5.0.8’ и т. д.). За подробностями обратитесь к разделу <link linkend="upload-stable">загрузки в <literal>стабильный</literal> выпуск</link>.

source: More information about the testing distribution
ru: Дополнительная информация о тестируемом выпуске

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of testing in <literal>unstable</literal>.
ru: Обычно пакеты устанавливаются в <literal>тестируемый</literal> выпуск после того, как они пройдут некоторое тестирование в <literal>нестабильном</literal> выпуске.

source: For more details, please see the <link linkend="testing">information about the testing distribution</link>.
ru: Для получения дополнительных сведений обратитесь к <link linkend="testing">информации о тестируемом выпуске</link>.

source: Experimental
ru: Экспериментальный выпуск

source: The <literal>experimental</literal> distribution is a special distribution. It is not a full distribution in the same sense as <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal> are. Instead, it is meant to be a temporary staging area for highly experimental software where there's a good chance that the software could break your system, or software that's just too unstable even for the <literal>unstable</literal> distribution (but there is a reason to package it nevertheless). Users who download and install packages from <literal>experimental</literal> are expected to have been duly warned. In short, all bets are off for the <literal>experimental</literal> distribution.
ru: <literal>Экспериментальный</literal> выпуск является специальным выпуском. Это не полный выпуск в том же смысле как являются полными <literal>стабильный</literal>, <literal>тестируемый</literal> и <literal>нестабильный</literal> выпуски. Наоборот, это лишь временное место для экспериментального ПО, которое вполне может сломать ваше систему, либо для ПО, которое пока ещё недостаточно стабильно для того, чтобы помещать его в <literal>нестабильный</literal> выпуск (но всё равно имеются причины для создания такого пакета). Ожидается, что пользователи, которые скачивают и устанавливают пакеты из <literal>экспериментального</literal> выпуска, предупреждены о возможных проблемах. Короче, для <literal>экспериментального</literal> выпуска мы не даём никаких гарантий, вся ответственность исключительно на вас.

source: These are the <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> lines for <literal>experimental</literal>:
ru: Вот строки <citerefentry> <refentrytitle>sources.list</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> для <literal>экспериментального</literal> выпуска:

source: If there is a chance that the software could do grave damage to a system, it is likely to be better to put it into <literal>experimental</literal>. For instance, an experimental compressed file system should probably go into <literal>experimental</literal>.
ru: Если имеется возможность того, что ПО может нанести непоправимый вред системе, лучше всего поместить его в <literal>экспериментальный</literal> выпуск. Например, поддержка экспериментальной файловой системы с сжатием должна, вероятно, войти в <literal>экспериментальный</literal> выпуск.

source: Whenever there is a new upstream version of a package that introduces new features but breaks a lot of old ones, it should either not be uploaded, or be uploaded to <literal>experimental</literal>. A new, beta, version of some software which uses a completely different configuration can go into <literal>experimental</literal>, at the maintainer's discretion. If you are working on an incompatible or complex upgrade situation, you can also use <literal>experimental</literal> as a staging area, so that testers can get early access.
ru: Если имеется новая версия пакета из основной ветки разработки, которая добавляет новые возможности, но приводит к поломке старых возможностей, она либо не должна быть загружена, либо должна быть загружена в <literal>экспериментальный</literal> выпуск. Новая бета версия некоторого ПО, использующая совершенно другую настройку, может войти в <literal>экспериментальный</literal> выпуск решению сопровождающего. Если вы работаете над несовместимой или сложной ситуацией по обновлению пакета, вы также можете использовать <literal>экспериментальный</literal> выпуск для тестирования, так чтобы те, кто будут тестировать ваш пакет, могли раньше получить к нему доступ.

source: Some experimental software can still go into <literal>unstable</literal>, with a few warnings in the description, but that isn't recommended because packages from <literal>unstable</literal> are expected to propagate to <literal>testing</literal> and thus to <literal>stable</literal>. You should not be afraid to use <literal>experimental</literal> since it does not cause any pain to the ftpmasters, the experimental packages are periodically removed once you upload the package in <literal>unstable</literal> with a higher version number.
ru: Некоторое экспериментальное ПО может войти и в <literal>нестабильный</literal> выпуск, если в описание вы добавите предупреждение, но это не рекомендуется, поскольку пакеты предполагается, что пакеты из <literal>нестабильного</literal> выпуска будут перемещены в <literal>тестируемый</literal> выпуск, а затем в <literal>стабильный</literal>. Вам не следует бояться использовать <literal>экспериментальный</literal> выпуск, поскольку он не доставляет проблем сопровождающим ftp, экспериментальные пакеты периодически удаляются как только вы загрузите в <literal>нестабильный</literal> выпуск пакет, имеющий более высокий номер версии.

source: New software which isn't likely to damage your system can go directly into <literal>unstable</literal>.
ru: Новое ПО, которое скорее всего не повредит систему, может быть сразу добавлено в <literal>нестабильный</literal> выпуск.

source: An alternative to <literal>experimental</literal> is to use your personal web space on <literal>people.debian.org</literal>.
ru: Альтернативой <literal>экспериментальному</literal> выпуску является ваше личное пространство на <literal>people.debian.org</literal>.

source: Release code names
ru: Кодовые имена выпусков

source: Every released Debian distribution has a <literal>code name</literal>: Debian 1.1 is called <literal>buzz</literal>; Debian 1.2, <literal>rex</literal>; Debian 1.3, <literal>bo</literal>; Debian 2.0, <literal>hamm</literal>; Debian 2.1, <literal>slink</literal>; Debian 2.2, <literal>potato</literal>; Debian 3.0, <literal>woody</literal>; Debian 3.1, <literal>sarge</literal>; Debian 4.0, <literal>etch</literal>; Debian 5.0, <literal>lenny</literal>; Debian 6.0, <literal>squeeze</literal> and the next release will be called <literal>wheezy</literal>. There is also a ``pseudo-distribution'', called <literal>sid</literal>, which is the current <literal>unstable</literal> distribution; since packages are moved from <literal>unstable</literal> to <literal>testing</literal> as they approach stability, <literal>sid</literal> itself is never released. As well as the usual contents of a Debian distribution, <literal>sid</literal> contains packages for architectures which are not yet officially supported or released by Debian. These architectures are planned to be integrated into the mainstream distribution at some future date.
ru: Каждый выпущенный дистрибутив Debian имеет <literal>кодовое имя</literal>: Debian 1.1 называется <literal>buzz</literal>; Debian 1.2, <literal>rex</literal>; Debian 1.3, <literal>bo</literal>; Debian 2.0, <literal>hamm</literal>; Debian 2.1, <literal>slink</literal>; Debian 2.2, <literal>potato</literal>; Debian 3.0, <literal>woody</literal>; Debian 3.1, <literal>sarge</literal>; Debian 4.0, <literal>etch</literal>; Debian 5.0, <literal>lenny</literal>; Debian 6.0, <literal>squeeze</literal>, следующий выпуск будет назван <literal>wheezy</literal>. Также имеется ``псевдовыпуск'', называемый <literal>sid</literal>, который является текущим <literal>нестабильным</literal> выпуском; поскольку пакеты перемещаются из <literal>нестабильного</literal> выпуска в <literal>тестируемый</literal> выпуске по мере того, как они приближаются к стабильности, сам <literal>sid</literal> никогда не будет выпущен. Помимо обычного содержимого выпуска Debian, <literal>sid</literal> содержит пакеты для архитектур, которые пока официально не поддерживаются, или ещё не были выпущены Debian. Эти архитектуры планируется включить в основную ветку дистрибутива в некотором будущем.

source: Since Debian has an open development model (i.e., everyone can participate and follow the development) even the <literal>unstable</literal> and <literal> testing</literal> distributions are distributed to the Internet through the Debian FTP and HTTP server network. Thus, if we had called the directory which contains the release candidate version <literal>testing</literal>, then we would have to rename it to <literal>stable</literal> when the version is released, which would cause all FTP mirrors to re-retrieve the whole distribution (which is quite large).
ru: Поскольку Debian следует открытой модели разработки (т. е., всякий может участвовать и следить за разработкой), даже <literal>нестабильный</literal> и <literal>тестируемый</literal> выпуски распространяются в Интернет через сеть FTP и HTTP серверов Debian. Таким образом, если мы назвали каталог, содержащий версию, рассматриваемую в качестве кандидата на выпуск, <literal>testing</literal>, то мы переименуем его в <literal>stable</literal>, когда эта версия будет выпущена, что приведёт к тому, что все FTP зеркала заново загрузят весь дистрибутив (который довольно велик).

source: On the other hand, if we called the distribution directories <literal>Debian-x.y</literal> from the beginning, people would think that Debian release <literal>x.y</literal> is available. (This happened in the past, where a CD-ROM vendor built a Debian 1.0 CD-ROM based on a pre-1.0 development version. That's the reason why the first official Debian release was 1.1, and not 1.0.)
ru: С другой стороны, если мы с самого начала назовём каталоги выпусков <literal>Debian-x.y</literal>, люди будут полагать, что доступен выпуск Debian версии <literal>x.y</literal>. (Такое было в прошлом, когда производитель CD-ROM собрал CD-ROM Debian 1.0 на основе разрабатываемой версии pre-1.0. Вот почему первым официальным выпуском Debian был 1.1, а не 1.0.)

source: Thus, the names of the distribution directories in the archive are determined by their code names and not their release status (e.g., `squeeze'). These names stay the same during the development period and after the release; symbolic links, which can be changed easily, indicate the currently released stable distribution. That's why the real distribution directories use the <literal>code names</literal>, while symbolic links for <literal>stable</literal>, <literal>testing</literal>, and <literal>unstable</literal> point to the appropriate release directories.
ru: Таким образом, имена каталогов для выпусков в архиве соответствуют кодовым именам выпусков, а не статусу выпуска (напр., `squeeze'). Эти имена остаются одними и теми же в период разработки в после выпуска; символические ссылки, которые легко могут быть изменены, обозначают текущий стабильный выпуск. Вот почему фактические каталоги используют <literal>кодовые имена</literal>, а символические ссылки для <literal>стабильного</literal>, <literal>тестируемого</literal> и <literal>нестабильного</literal> выпусков указывают на соответствующие каталоги выпусков.

source: Debian mirrors
ru: Зеркала Debian

source: The various download archives and the web site have several mirrors available in order to relieve our canonical servers from heavy load. In fact, some of the canonical servers aren't public — a first tier of mirrors balances the load instead. That way, users always access the mirrors and get used to using them, which allows Debian to better spread its bandwidth requirements over several servers and networks, and basically makes users avoid hammering on one primary location. Note that the first tier of mirrors is as up-to-date as it can be since they update when triggered from the internal sites (we call this push mirroring).
ru: Разные архивы для скачивания и веб-сайт имеют несколько зеркал для того, чтобы освободить наши каноничные серверы от тяжёлой нагрузки. Фактически, некоторые каноничные серверы не доступны публично — вместо этого первый ряд зеркал занимается балансировкой нагрузки. Так, пользователи всегда получают доступ к зеркалу и привыкают использовать их, что позволяет Debian лучше разделять пропускную способность между несколькими серверами и сетями и вообще позволяет пользователям избежать обращения к основному серверу. Заметьте, что первый ряд серверов является наиболее актуальными, поскольку они обновляются по запросу с внутренних сайтов (мы называем это проталкивающим зеркалированием).

source: All the information on Debian mirrors, including a list of the available public FTP/HTTP servers, can be found at <ulink url="&url-debian-mirrors;"></ulink>. This useful page also includes information and tools which can be helpful if you are interested in setting up your own mirror, either for internal or public access.
ru: Все информация о зеркалах Debian, включая список доступных публично FTP/HTTP серверов, может быть найдена на <ulink url="&url-debian-mirrors;"></ulink>. Эта полезная страница содержит информацию и инструменты, которые могут быть вам полезны, если вы заинтересованы в настройке собственного зеркала, как для внутренних нужд, так и с публичным доступом.
