Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If choices are translatable strings, the 'Choices' field may be marked as translatable by using <literal>__Choices</literal>. The double underscore will split out each choice in a separate string.
ru: Если варианты выбора представляют собой переводимые строки, поле 'Choices' может быть отмечено как переводимое так: <literal>__Choices</literal>. Двойное подчёркивание выделит каждый вариант выбора в отдельную строку.

source: The <command>po-debconf</command> system also offers interesting possibilities to only mark <emphasis role="strong">some</emphasis> choices as translatable. Example:
ru: Также система <command>po-debconf</command> предлагает интересные возможности для отметки только <emphasis role="strong">некоторых</emphasis> вариантов выбора в качестве переводимых. Пример:

source: In that example, only the 'Other' string is translatable while others are acronyms that should not be translated. The above allows only 'Other' to be included in PO and POT files.
ru: В этом примере только строка 'Other' является переводимой, остальные же представляют собой акронимы, которые не нужно переводить. Этот пример разрешает включение в файлы PO и POT только варианта 'Other'.

source: The debconf templates flag system offers many such possibilities. The <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page lists all these possibilities.
ru: Система флагов для шаблонов debconf предлагает множество таких возможностей. В странице руководства <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> приведены все эти возможности.

source: Like the select data type, except the user can choose any number of items from the choices list (or chose none of them).
ru: Подобен типу данных select, но пользователь может выбрать любое число вариантов из списка вариантов (или не выбрать ни один из них).

source: Rather than being a question per se, this datatype indicates a note that can be displayed to the user. It should be used only for important notes that the user really should see, since debconf will go to great pains to make sure the user sees it; halting the install for them to press a key, and even mailing the note to them in some cases.
ru: Этот тип данных не является вопросом самим по себе, а представляет собой примечание, которое может быть показано пользователю. Он должен использоваться только для важных примечаний, которые пользователи действительно должны заметить, поскольку debconf приложит максимум усилий для гарантии того, что пользователь заметит это примечание; установка будет остановлена до нажатия клавиши, в некоторых случаях пользователю будет даже выслано это примечание по почте.

source: This type is now considered obsolete: don't use it.
ru: Данный тип считается устаревшим: не используйте его.

source: This type is designed to handle error messages. It is mostly similar to the note type. Frontends may present it differently (for instance, the dialog frontend of cdebconf draws a red screen instead of the usual blue one).
ru: Этот тип разработан для обработки сообщений об ошибках. Он практически схож с типом note. Различные пользовательские интерфейсы могут представлять его по-разному (например, диалоговый интерфейс cdebconf отрисовывает красный экран вместо обычного синего).

source: It is recommended to use this type for any message that needs user attention for a correction of any kind.
ru: Рекомендуется использовать этот тип для любых сообщений, не которые необходимо обратить внимание пользователя для внесения исправлений любого вида.

source: Description: short and extended description
ru: Описание: краткое и расширенное описания

source: Template descriptions have two parts: short and extended. The short description is in the Description: line of the template.
ru: Описания шаблонов имеют две части: краткую и расширенную. Краткое описание даётся в строке Description: данного шаблона.

source: The short description should be kept short (50 characters or so) so that it may be accommodated by most debconf interfaces. Keeping it short also helps translators, as usually translations tend to end up being longer than the original.
ru: Краткое описание должно быть коротким (50 символов или около того), чтобы оно могло быть обработано большинством интерфейсов debconf. Краткое описание также помогает переводчикам, поскольку переводы обычно длиннее оригиналов.

source: The short description should be able to stand on its own. Some interfaces do not show the long description by default, or only if the user explicitely asks for it or even do not show it at all. Avoid things like What do you want to do?
ru: Краткое описание должно быть самодостаточным. Некоторые интерфейсы по умолчанию не отображают длинное описание, либо отображают его только в том случае, если пользователь явно запросит об это, либо вообще никогда не отображают его. Избегайте кратких описаний на подобие What do you want to do?

source: The short description does not necessarily have to be a full sentence. This is part of the keep it short and efficient recommendation.
ru: Краткое описание не обязательно должно быть полным предложением. Это лишь часть, она должна быть краткой и эффективной рекомендацией.

source: The extended description should not repeat the short description word for word. If you can't think up a long description, then first, think some more. Post to debian-devel. Ask for help. Take a writing class! That extended description is important. If after all that you still can't come up with anything, leave it blank.
ru: Расширенное описание не должно слово в слово повторять краткое описание. Если вы не можете придумать длинное описание, то для начала подумайте ещё. Напишите в debian-devel. Попросите помощи. Прослушайте курс письма! Расширенное описание очень важно. Если в конце концов вы всё еще не можете ничего придумать, оставьте его пустым.

source: The extended description should use complete sentences. Paragraphs should be kept short for improved readability. Do not mix two ideas in the same paragraph but rather use another paragraph.
ru: Расширенное описание должно состоять из полных предложений. Параграфы должны быть короткими и удобочитаемыми. Не смешивайте две идеи в одном параграфе, лучше разделите их на два.

source: Don't be too verbose. User tend to ignore too long screens. 20 lines are by experience a border you shouldn't cross, because that means that in the classical dialog interface, people will need to scroll, and lot of people just don't do that.
ru: Не будьте слишком подробны. Пользователи обычно игнорируют слишком длинные экраны. По опыту, 20 строк &mdash; это та граница, которую вам не следует пересекать, поскольку это означает, что в классическом диалоговом интерфейсе придётся прокручивать экран, а большинство пользователей этого просто не делают.

source: The extended description should <emphasis role="strong">never</emphasis> include a question.
ru: Расширенное описание <emphasis role="strong">никогда</emphasis> не должно включать в себя вопрос.

source: For specific rules depending on templates type (string, boolean, etc.), please read below.
ru: Для ознакомления с конкретными правилами, зависящими от типа шаблона (string, boolean и т. д.), прочтите нижеследующий текст.

source: This field should be used for select and multiselect types. It contains the possible choices which will be presented to users. These choices should be separated by commas.
ru: Это поле должно использоваться для типов select и multiselect. Оно содержит возможные варианты выбора, которые будут представлены пользователям. Варианты выбора должны быть разделены запятыми.

source: This field is optional. It contains the default answer for string, select and multiselect templates. For multiselect templates, it may contain a comma-separated list of choices.
ru: Это поле опционально. Оно содержит ответ по умолчанию для шаблонов string, select и multiselect. Для шаблонов multiselect это поле может содержать список вариантов выбора, разделённых запятыми.

source: Templates fields specific style guide
ru: Руководство по стилю в зависимости от полей шаблона

source: Type field
ru: Тип поля

source: No specific indication except: use the appropriate type by referring to the previous section.
ru: Без конкретного указания за исключением следующего: используйте соответствующий тип из предыдущего раздела.

source: Description field
ru: Поле Description

source: Below are specific instructions for properly writing the Description (short and extended) depending on the template type.
ru: Ниже приведены конкретные инструкции для правильного написания Description (краткого и расширенного описаний) в зависимости от типа шаблона.

source: String/password templates
ru: Шаблоны string/password

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Avoid question style prompts (IP Address?) in favour of opened prompts (IP address:). The use of colons is recommended.
ru: Краткое описание является приглашением, а <emphasis role="strong">не</emphasis> заголовком. Избегайте приглашений в виде вопросов (IP Address?) в пользу открытых приглашений (IP address:). Рекомендуется использовать двоеточие.

source: The extended description is a complement to the short description. In the extended part, explain what is being asked, rather than ask the same question again using longer words. Use complete sentences. Terse writing style is strongly discouraged.
ru: Расширенное описание дополняет краткое описание. В расширенной части объясните пользователю, что спрашивается, а не задавайте ему тот же вопрос при помощи более длинных слов. Используйте полные предложения. Краткие стиль письма крайне не рекомендуется.

source: Boolean templates
ru: Шаблоны boolean

source: The short description should be phrased in the form of a question which should be kept short and should generally end with a question mark. Terse writing style is permitted and even encouraged if the question is rather long (remember that translations are often longer than original versions).
ru: Краткое описание должно быть сформулировано в виде вопроса, который должен быть кратким и обычно должен заканчиваться вопросительным знаком. Разрешается (и даже рекомендуется) использовать краткий стиль письма в том случае, если вопрос является длинным (помните, что переводы чаще длиннее, чем оригиналы).

source: The short description is a prompt and <emphasis role="strong">not</emphasis> a title. Do <emphasis role="strong">not</emphasis> use useless Please choose... constructions. Users are clever enough to figure out they have to choose something...:)
ru: Краткое описание является приглашением, а <emphasis role="strong">не</emphasis> заголовком. <emphasis role="strong">Не</emphasis> используйте бесполезные конструкции вида Please choose... Пользователи достаточно умны, чтобы понять, что им нужно что-то выбрать...:)

source: The extended description will complete the short description. It may refer to the available choices. It may also mention that the user may choose more than one of the available choices, if the template is a multiselect one (although the interface often makes this clear).
ru: Расширенное описание должно заканчивать краткое описание. Оно может отсылать к доступным вариантам выбора. Также оно может содержать напоминание о том, что пользователь может выбрать более одного варианта из доступных, если выбран шаблон multiselect (хотя интерфейс обычно делает это очевидными).

source: The short description should be considered to be a <emphasis role="strong">title</emphasis>.
ru: Краткое описание должно рассматриваться как <emphasis role="strong">заголовок</emphasis>.

source: The extended description is what will be displayed as a more detailed explanation of the note. Phrases, no terse writing style.
ru: Расширенное описание представляет собой то, что будет отображено в качестве более подробного объяснения данного примечания. Фразы, подробный стиль письма.

source: <emphasis role="strong">Do not abuse debconf.</emphasis> Notes are the most common way to abuse debconf. As written in debconf-devel manual page: it's best to use them only for warning about very serious problems. The <filename>NEWS.Debian</filename> or <filename>README.Debian</filename> files are the appropriate location for a lot of notes. If, by reading this, you consider converting your Note type templates to entries in <filename>NEWS.Debian</filename> or <filename>README.Debian</filename>, plus consider keeping existing translations for the future.
ru: <emphasis role="strong">Не злоупотребляйте debconf.</emphasis> Примечания представляют собой наиболее распространённый тип злоупотребления debconf. Как указано в странице руководства debconf-devel: лучше использовать их только для предупреждения об очень серьёзных проблемах. Большинство примечаний следует помещать в файл <filename>NEWS.Debian</filename> или файл <filename>README.Debian</filename>. Если, читая это, вы решили перевести ваши шаблоны типа note в записи в файле <filename>NEWS.Debian</filename> или файле <filename>README.Debian</filename>, подумайте над тем, как сохранить на будущее существующие переводы.

source: Choices field
ru: Поле Choices

source: If the Choices are likely to change often, please consider using the __Choices trick. This will split each individual choice into a single string, which will considerably help translators for doing their work.
ru: Если скорее всего поле Choices будет часто меняться, попробуйте использовать трюк __Choices. Так каждый индивидуальный выбор будет выделен в отдельную строку, что поможет переводчикам делать их работу.

source: Default field
ru: Поле Default

source: If the default value, for a select template, is likely to vary depending on the user language (for instance, if the choice is a language choice), please use the _Default trick.
ru: Если скорее всего значение по умолчанию для выбранного шаблона будет изменяться в зависимости от языка пользователя (например, если это выбор языка), используйте трюк _Default.

source: This special field allow translators to put the most appropriate choice according to their own language. It will become the default choice when their language is used while your own mentioned Default Choice will be used when using English.
ru: Это специальное поле позволяет переводчикам указывать наиболее подходящий вариант выбора в соответствии с их собственным языком. Он будет вариантом по умолчанию при использовании этого языка, в то время как ваш собственный вариант Default Choice будет использоваться в том случае, если используется английский язык.

source: Example, taken from the geneweb package templates:
ru: Пример, взятый из шаблонов пакета geneweb:

source: Note the use of brackets which allow internal comments in debconf fields. Also note the use of comments which will show up in files the translators will work with.
ru: Обратите внимание на использование скобок, которые позволяют указывать внутренние комментарии в полях debconf. Кроме того, обратите внимание на использование комментариев, которые показываются в файлах, с которыми работают переводчики.

source: The comments are needed as the _Default trick is a bit confusing: the translators may put their own choice
ru: Эти комментарии необходимы постольку, поскольку трюк _Default несколько сбивает с толку: переводчики могут указать свой собственный вариант выбора

source: Do NOT use empty default field. If you don't want to use default values, do not use Default at all.
ru: НЕ используйте пустое поле default. Если вы не хотите использовать значения по умолчанию, не используйте Default вообще.

source: If you use po-debconf (and you <emphasis role="strong">should</emphasis>, see <xref linkend="s6.5.2.2"/>), consider making this field translatable, if you think it may be translated.
ru: Если вы используете po-debconf (а вы <emphasis role="strong">должны</emphasis> это делать, см. <xref linkend="s6.5.2.2"/>), постарайтесь сделать это поле так, чтобы его можно было перевести, если вы считаете, что оно может быть переведено.

source: If the default value may vary depending on language/country (for instance the default value for a language choice), consider using the special _Default type documented in <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.
ru: Если значение по умолчанию может изменяться в зависимости от языка/страны (например, значение по умолчанию для выбора языка), используйте специальный тип _Default, описываемый в <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.

source: Internationalization
ru: Интернационализация

source: This section contains global information for developers to make translators' life easier. More information for translators and developers interested in internationalization are available in the <ulink url="&url-i18n-l10n;">Internationalisation and localisation in Debian</ulink> documentation.
ru: Этот раздел содержит глобальную информацию для разработчиком по облегчению жизни переводчиков. Дополнительная информация для переводчиком и разработчиков, заинтересованных в интернационализации, доступна в руководстве <ulink url="&url-i18n-l10n;">Интернационализация и локализация в Debian</ulink>.

source: Handling debconf translations
ru: Обработка переводов debconf

source: Like porters, translators have a difficult task. They work on many packages and must collaborate with many different maintainers. Moreover, most of the time, they are not native English speakers, so you may need to be particularly patient with them.
ru: Подобно тем, кто занимается переносами, перед переводчиками стоит сложная задача. Они работают над многими пакетами и должны сотрудничать с большим количеством разных сопровождающих. Более того, по большей части они не являются носителями английского языка, поэтому вам следует быть с ними особенно вежливыми.

source: The goal of <systemitem role="package">debconf</systemitem> was to make packages configuration easier for maintainers and for users. Originally, translation of debconf templates was handled with <command>debconf-mergetemplate</command>. However, that technique is now deprecated; the best way to accomplish <systemitem role="package">debconf</systemitem> internationalization is by using the <systemitem role="package">po-debconf</systemitem> package. This method is easier both for maintainer and translators; transition scripts are provided.
ru: Целью <systemitem role="package">debconf</systemitem> является облегчение сопровождающим и пользователям настройки пакетов. Изначально перевод шаблонов debconf осуществлялся с помощью <command>debconf-mergetemplate</command>. Тем не менее, сейчас эта техника устарела; лучшим способом выполнить <systemitem role="package">debconf</systemitem> интернационализацию состоит в использовании пакета <systemitem role="package">po-debconf</systemitem> package. Этот метод проще и для сопровождающих и для переводчиков; предоставляются сценарии перевода.

source: Using <systemitem role="package">po-debconf</systemitem>, the translation is stored in <filename>.po</filename> files (drawing from <command>gettext</command> translation techniques). Special template files contain the original messages and mark which fields are translatable. When you change the value of a translatable field, by calling <command>debconf-updatepo</command>, the translation is marked as needing attention from the translators. Then, at build time, the <command>dh_installdebconf</command> program takes care of all the needed magic to add the template along with the up-to-date translations into the binary packages. Refer to the <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page for details.
ru: При использовании <systemitem role="package">po-debconf</systemitem>, перевод сохраняется в файлах <filename>.po</filename> (формате, извлечённом из <command>gettext</command>). Специальные файлы шаблонов содержат оригинальные сообщения и пометки для тех полей, которые могут быть переведены. Когда вы изменяете значение поля, которое может быть переведено, вызывая команду <command>debconf-updatepo</command>, перевод отмечается как требующий внимания переводчиков. Тогда, во время сборки, программа <command>dh_installdebconf</command> заботится обо всей требуемой магии по добавлению шаблона вместе с обновлёнными переводами в двоичные пакеты. За подробностями обратитесь к странице руководства <citerefentry> <refentrytitle>po-debconf</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.

source: Internationalized documentation
ru: Интернационализованная документация

source: Internationalizing documentation is crucial for users, but a lot of labor. There's no way to eliminate all that work, but you can make things easier for translators.
ru: Интернационализация документации очень важна для пользователей, но требует большого труда. Не существует способа сделать так, чтобы не нужно было делать эту работу, но вы можете упростить её для переводчиков.

source: If you maintain documentation of any size, it is easier for translators if they have access to a source control system. That lets translators see the differences between two versions of the documentation, so, for instance, they can see what needs to be retranslated. It is recommended that the translated documentation maintain a note about what source control revision the translation is based on. An interesting system is provided by <ulink url="&url-i18n-doc-check;">doc-check</ulink> in the <systemitem role="package">debian-installer</systemitem> package, which shows an overview of the translation status for any given language, using structured comments for the current revision of the file to be translated and, for a translated file, the revision of the original file the translation is based on. You might wish to adapt and provide that in your VCS area.
ru: Если вы сопровождаете документацию любого размера, для переводчиков будет проще, если они будут иметь доступ к системе управления исходным кодом. Это позволяет переводчикам видеть разницу между двумя версиями документации, поэтому, например, они могут видеть, что нужно перевести заново. Рекомендуется, чтобы в переведённой документации содержалась информация о том, на базе какой системы управления изменениями исходного кода основывается разработка документации. Интересная система предоставляется <ulink url="&url-i18n-doc-check;">doc-check</ulink> из пакета <systemitem role="package">debian-installer</systemitem>, которая показывает статус перевода для любого данного языка и использует структурированные комментарии для текущей редакции файла, который должен быть переведён, для переведённого файла, редакции оригинального файла, на котором основан перевод. Вероятно, вы захотите использовать и предоставлять такую информацию в вашей системе управления версиями.

source: If you maintain XML or SGML documentation, we suggest that you isolate any language-independent information and define those as entities in a separate file which is included by all the different translations. This makes it much easier, for instance, to keep URLs up to date across multiple files.
ru: Если вы сопровождаете документацию в форматах XML или SGML, мы предлагаем вам выделить отдельно всю независящую от языка информацию и определить её в виде сущности в отдельном файле, которые бы включался всеми разными переводами. Это позволяет упростить, например, контроль за актуальностью URL в нескольких файлах.
