Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Those who prefer one-on-one help (e.g., via private email) should also post to that list and an experienced developer will volunteer to help.
ru: Те, кто предпочитает помощь в режиме "один-на-один" (напр., через частную электронную почту), также должны написать в этот список рассылки, опытные разработчики помогут вам.

source: In addition, if you have some packages ready for inclusion in Debian, but are waiting for your new maintainer application to go through, you might be able find a sponsor to upload your package for you. Sponsors are people who are official Debian Developers, and who are willing to criticize and upload your packages for you. Please read the debian-mentors FAQ at <ulink url="&url-mentors;"></ulink> first.
ru: Кроме того, если у вас имеются пакеты, готовые для добавления в Debian, но вы ожидаете прохождения процедуры получения статуса нового сопровождающего, в этом списке рассылки вы можете найти спонсора для загрузки вашего пакета. Спонсоры — это те люди, которые являются официальными разработчиками Debian, и которые желают проверить ваши пакеты и загрузить их. Пожалуйста, для начала прочтите ЧаВО списка рассылки debian-mentors по адресу <ulink url="&url-mentors;"></ulink>.

source: If you wish to be a mentor and/or sponsor, more information is available in <xref linkend="newmaint"/>.
ru: Если вы хотите выступить в качестве наставника и/или спонсора, см. дополнительную информацию в разделе <xref linkend="newmaint"/>.

source: Registering as a Debian developer
ru: Регистрация в качестве разработчика Debian

source: Before you decide to register with &debian-formal;, you will need to read all the information available at the <ulink url="&url-newmaint;">New Maintainer's Corner</ulink>. It describes in detail the preparations you have to do before you can register to become a Debian developer. For example, before you apply, you have to read the <ulink url="&url-social-contract;">Debian Social Contract</ulink>. Registering as a developer means that you agree with and pledge to uphold the Debian Social Contract; it is very important that maintainers are in accord with the essential ideas behind &debian-formal;. Reading the <ulink url="&url-gnu-manifesto;">GNU Manifesto</ulink> would also be a good idea.
ru: До того как вы решите зарегистрировать в &debian-formal;, вам необходимо прочитать всю доступную информацию в <ulink url="&url-newmaint;">Уголке нового сопровождающего</ulink>. Там описаны подробности той подготовки, которую вам следует произвести до того, как вы сможете зарегистрироваться для получения статуса разработчика Debian. Например, до подачи заявки вам необходимо прочитать <ulink url="&url-social-contract;">Общественный договор Debian</ulink>. Ваша регистрация как разработчика предполагает, что вы согласны и ручаетесь придерживаться Общественного договора Debian; очень важно, что сопровождающие согласны с ключевыми идеями, стоящими за &debian-formal;. Чтение <ulink url="&url-gnu-manifesto;">Манифеста GNU</ulink> также может быть хорошей идеей.

source: The process of registering as a developer is a process of verifying your identity and intentions, and checking your technical skills. As the number of people working on &debian-formal; has grown to over &number-of-maintainers; and our systems are used in several very important places, we have to be careful about being compromised. Therefore, we need to verify new maintainers before we can give them accounts on our servers and let them upload packages.
ru: Процесс регистрации в качестве разработчика представляет собой процесс проверки вашей личности и ваших намерений, а также проверку ваших технических навыков. Поскольку число людей, работающих над &debian-formal;, переросло &number-of-maintainers;, и поскольку наши системы используются в ряде очень важных мест, мы должны быть аккуратны. Следовательно, нам необходимо проверять новых сопровождающих до того, как мы предоставим их учётные записи на наших серверах и позволим им загружать пакеты.

source: Before you actually register you should have shown that you can do competent work and will be a good contributor. You show this by submitting patches through the Bug Tracking System and having a package sponsored by an existing Debian Developer for a while. Also, we expect that contributors are interested in the whole project and not just in maintaining their own packages. If you can help other maintainers by providing further information on a bug or even a patch, then do so!
ru: До того как вы фактически зарегистрируетесь, вам следует показать, что вы можете выполнять компетентную работу и быть хорошим участником разработки. Вы можете показать это, отправляя заплаты через систему отслеживания ошибок и работая некоторое время над пакетом, спонсируемым существующим разработчиком Debian. Кроме того, мы ожидаем, что участники заинтересованы во всём проекте целиком, а не просто в сопровождении своих собственных пакетов. Если мы можете помочь другим сопровождающим, предоставляя дополнительную информацию об ошибке или даже заплату, сделайте это!

source: Registration requires that you are familiar with Debian's philosophy and technical documentation. Furthermore, you need a GnuPG key which has been signed by an existing Debian maintainer. If your GnuPG key is not signed yet, you should try to meet a Debian Developer in person to get your key signed. There's a <ulink url="&url-gpg-coord;">GnuPG Key Signing Coordination page</ulink> which should help you find a Debian Developer close to you. (If there is no Debian Developer close to you, alternative ways to pass the ID check may be permitted as an absolute exception on a case-by-case-basis. See the <ulink url="&url-newmaint-id;">identification page</ulink> for more information.)
ru: Для регистрации необходимо, чтобы вы были знакомы с философией Debian и технической документацией. Более того, вам потребуется ключ GnuPG, которые должен бытьподписан существующими сопровождающими Debian. Если ваш ключ GnuPG не ещё подписан, вам следует попытаться встретиться с разработчиком Debian лично и подписать у него свой ключ. Имеется <ulink url="&url-gpg-coord;">страница для координации подписывания ключа GnuPG</ulink>, которая поможет вам найти разработчика Debian около вас. (Если около вас нет разработчиков Debian, может быть разрешён альтернативный путь прохождения проверки личности как некоторое абсолютное исключение в зависимости от конкретного случая. Дополнительную информацию см. на <ulink url="&url-newmaint-id;">странице установления личности</ulink>.)

source: If you do not have an OpenPGP key yet, generate one. Every developer needs an OpenPGP key in order to sign and verify package uploads. You should read the manual for the software you are using, since it has much important information which is critical to its security. Many more security failures are due to human error than to software failure or high-powered spy techniques. See <xref linkend="key-maint"/> for more information on maintaining your public key.
ru: Если у вас пока нет ключа OpenPGP, создайте его. Каждому разработчику необходим ключ OpenPGP для подписывания и проверки загрузок пакетов. Вам следует прочесть руководство для ПО, которое вы используете, поскольку оно содержит большое количество очень важной информации, которая касается безопасности. Большая часть проблем безопасности возникла из-за человеческих ошибок, а не из-за проблем с ПО или каких-то высокотехнологичных шпионских штучек. Дополнительную информацию от сопровождении вашего публичного ключа см. в <xref linkend="key-maint"/>.

source: Debian uses the <literal>GNU Privacy Guard</literal> (package <systemitem role="package">gnupg</systemitem> version 1 or better) as its baseline standard. You can use some other implementation of OpenPGP as well. Note that OpenPGP is an open standard based on <ulink url="&url-rfc2440;">RFC 2440</ulink>.
ru: Debian использует <literal>GNU Privacy Guard</literal> (пакет <systemitem role="package">gnupg</systemitem> версии 1 или новее) в качестве своего базового стандарта. Вы также можете использовать некоторые другие реализации OpenPGP. Заметьте, что OpenPGP является открытым стандартом на основе <ulink url="&url-rfc2440;">RFC 2440</ulink>.

source: Version 4 (primary) keys can either use the RSA or the DSA algorithms, so this has nothing to do with GnuPG's question about which kind of key do you want: (1) DSA and Elgamal, (2) DSA (sign only), (5) RSA (sign only). If you don't have any special requirements just pick the default.
ru: Ключ версии 4 (первичные) могут использовать либо алгоритм RSA, либо алгоритм DSA, поэтому это не касается вопроса GnuPG о том, какой вид ключей вам нужен: (1) DSA и Elgamal, (2) DSA (только для подписи), (5) RSA (только для подписи). Если у вам нет каких-либо специальных требований, выберите вариант по умолчанию.

source: The easiest way to tell whether an existing key is a v4 key or a v3 (or v2) key is to look at the fingerprint: Fingerprints of version 4 keys are the SHA-1 hash of some key material, so they are 40 hex digits, usually grouped in blocks of 4. Fingerprints of older key format versions used MD5 and are generally shown in blocks of 2 hex digits. For example if your fingerprint looks like <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal> then it's a v4 key.
ru: Наиболее простым способом определить, является ли существующий ключ ключом версии 4 или версии 3 (или версии 2), состоит в том, чтобы проверить его отпечаток: отпечатки ключей версии 4 являются SHA-1 хэшем некоторого материала ключа, поэтому они представляют собой 40 шестнадцатеричных чисел, обычно сгруппированных в блоки по 4. Отпечатки ключей более старых версий используют MD5 и обычно отображаются в виде блоков по 2 шестнадцатеричных числа. Например, если ваш отпечаток похож на <literal>5B00 C96D 5D54 AEE1 206B AF84 DE7A AF6E 94C0 9C7F</literal>, то это ключ версии 4.

source: Another possibility is to pipe the key into <command>pgpdump</command>, which will say something like Public Key Packet - Ver 4.
ru: Другой возможностью является передача ключа программе <command>pgpdump</command>, которая сообщит что-то вроде Public Key Packet - Ver 4.

source: Also note that your key must be self-signed (i.e. it has to sign all its own user IDs; this prevents user ID tampering). All modern OpenPGP software does that automatically, but if you have an older key you may have to manually add those signatures.
ru: Кроме того, заметьте, что ваш ключ должен быть подписан этим же ключом (т. е., должны быть подписаны все собственный идентификаторы пользователя; это предотвращает подделку идентификатора пользователя). Всё современное ПО OpenPGP делает это автоматически, но если у вас имеется более старый ключ, вам может потребоваться вручную добавить эти подписи.

source: You need a version 4 key for use in Debian Development. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">Your key length must be greater than 1024 bits</ulink>; there is no reason to use a smaller key, and doing so would be much less secure.<placeholder type="footnote" id="0"/>
ru: Для разработки Debian вам потребуется ключ версии 4. <ulink url="http://lists.debian.org/20090520092534.GG22906@earth.li">Длина вашего ключа должна быть больше 1024 бит</ulink>; оснований использовать меньший ключ нет, это намного менее безопасно.<placeholder type="footnote" id="0"/>

source: If your public key isn't on a public key server such as &pgp-keyserv;, please read the documentation available at <ulink url="&url-newmaint-id;">NM Step 2: Identification</ulink>. That document contains instructions on how to put your key on the public key servers. The New Maintainer Group will put your public key on the servers if it isn't already there.
ru: Если ваш публичный ключ не размещён как сервере публичных ключей, таком как &pgp-keyserv;, прочтите доступную по адресе <ulink url="&url-newmaint-id;">Шаг 2: Установление личности</ulink> информацию. Этот документ содержит инструкции о том, как поместить ваш ключ на серверы публичных ключей. Группа новых сопровождающих поместит ваш публичный ключ на серверы, если ключ ещё не был перемещён.

source: To apply as a new maintainer, you need an existing Debian Developer to support your application (an <literal>advocate</literal>). After you have contributed to Debian for a while, and you want to apply to become a registered developer, an existing developer with whom you have worked over the past months has to express their belief that you can contribute to Debian successfully.
ru: Чтобы подать заявку на получение статуса нового сопровождающего, существующий разработчик Debian должен поддержать вашу заявку (<literal>адвокат</literal>). Далее, вы должны уже участвовать в Проекте Debian в течении некоторого времени, вы хотите подать заявку на получение статуса зарегистрированного разработчика, существующий разработчик, с которым вы работали несколько последних месяцев должен выразить свою убеждённость, что вы можете успешно участвовать в развитии Проекта Debian.

source: When you have found an advocate, have your GnuPG key signed and have already contributed to Debian for a while, you're ready to apply. You can simply register on our <ulink url="&url-newmaint-apply;">application page</ulink>. After you have signed up, your advocate has to confirm your application. When your advocate has completed this step you will be assigned an Application Manager who will go with you through the necessary steps of the New Maintainer process. You can always check your status on the <ulink url="&url-newmaint-db;">applications status board</ulink>.
ru: Когда вы найдёте адвоката, ваш ключ GnuPG будет подписан, и у вас уже будет опыт участия в Проекте Debian, вы будете готовы подать заявку. Вы можете просто зарегистрироваться на нашей <ulink url="&url-newmaint-apply;">странице заявок</ulink>. После того, как вы авторизуетесь, ваш адвокат должен подтвердить вашу заявку. Когда ваш адвокат завершит этот шаг, вам будет назначен менеджер заявки, которые пройдёт вместе с вами все необходимые шаги процесса получения статуса нового сопровождающего. Вы всегда можете проверить свой статус в <ulink url="&url-newmaint-db;">таблице статусов заявок</ulink>.

source: For more details, please consult <ulink url="&url-newmaint;">New Maintainer's Corner</ulink> at the Debian web site. Make sure that you are familiar with the necessary steps of the New Maintainer process before actually applying. If you are well prepared, you can save a lot of time later on.
ru: Для получения подробных сведений, обратитесь в <ulink url="&url-newmaint;">Уголок новых членов Debian</ulink> на веб-сайте Debian. Убедитесь, что вам знакомы все необходимые шаги процесса получения статуса нового сопровождающего до того, как вы фактически подадите свою заявку. Если вы будете хорошо подготовлены, вы сможете сохранить большое количество времени.

source: Managing Packages
ru: Управление пакетами

source: This chapter contains information related to creating, uploading, maintaining, and porting packages.
ru: Данная глава содержит информацию, связанную с созданием, загрузкой, сопровождением и переносом пакетов.

source: New packages
ru: Новые пакеты

source: If you want to create a new package for the Debian distribution, you should first check the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages (WNPP)</ulink> list. Checking the WNPP list ensures that no one is already working on packaging that software, and that effort is not duplicated. Read the <ulink url="&url-wnpp;">WNPP web pages</ulink> for more information.
ru: Если вы хотите создать новый пакет для дистрибутива Debian, вам следует вначале проверить список <ulink url="&url-wnpp;">требующих доработки и будущих пакетов (WNPP)</ulink>. Проверка списка WNPP гарантирует, что в настоящий момент никто не работает над созданием пакетов для данного ПО, и что не будет проделана повторная работа. Прочтите <ulink url="&url-wnpp;">страницу WNPP</ulink> для получения дополнительной информации.

source: Assuming no one else is already working on your prospective package, you must then submit a bug report (<xref linkend="submit-bug"/>) against the pseudo-package <systemitem role="package">wnpp</systemitem> describing your plan to create a new package, including, but not limiting yourself to, a description of the package, the license of the prospective package, and the current URL where it can be downloaded from.
ru: Допустим, что более никто не работает над вашим будущим пакетом. Далее, вам следует отправить сообщение об ошибке (<xref linkend="submit-bug"/>) в псевдопакете <systemitem role="package">wnpp</systemitem> с объяснением вашего плана по созданию нового пакета, ваше сообщение должно в себя включать описание пакета, лицензию будущего пакета и текущий адрес, где можно этот пакет может быть загружен.

source: You should set the subject of the bug to <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>short description</replaceable></literal>, substituting the name of the new package for <replaceable>foo</replaceable>. The severity of the bug report must be set to <literal>wishlist</literal>. Please send a copy to &email-debian-devel; by using the X-Debbugs-CC header (don't use CC:, because that way the message's subject won't indicate the bug number). If you are packaging so many new packages (>10) that notifying the mailing list in separate messages is too disruptive, send a summary after filing the bugs to the debian-devel list instead. This will inform the other developers about upcoming packages and will allow a review of your description and package name.
ru: Тема сообщения об ошибке должна иметь вид <literal>ITP: <replaceable>foo</replaceable> -- <replaceable>краткое описание</replaceable></literal>, подставьте имя нового пакета вместо <replaceable>foo</replaceable>. Важность сообщения об ошибке должна быть установлена в значение <literal>wishlist</literal>. Отправьте копию по адресу &email-debian-devel;, используя заголовок X-Debbugs-CC (не используйте CC:, так как в этом случае в теме сообщения не будет указан номер ошибки). Если вы создаёте много новых пакетов (>10), то помните, что отправка в список рассылки большого количества отдельных сообщений будет слишком мешать другим, отправьте сообщение с обзором вашей работы в список рассылки debian-devel после заполнения всех сообщений об ошибках. Это позволит сообщить вам другим разработчикам о готовящихся пакетах и позволит вам проверить ваши описания и имена пакетов.

source: Please include a <literal>Closes: #<replaceable>nnnnn</replaceable></literal> entry in the changelog of the new package in order for the bug report to be automatically closed once the new package is installed in the archive (see <xref linkend="upload-bugfix"/>).
ru: Добавьте запись вида <literal>Closes: #<replaceable>nnnnn</replaceable></literal> в журнал изменений нового пакета для того, чтобы ваше сообщение об ошибке было автоматически закрыто сразу же как только пакет будет установлен в архиве (см. <xref linkend="upload-bugfix"/>).

source: If you think your package needs some explanations for the administrators of the NEW package queue, include them in your changelog, send to &email-ftpmaster; a reply to the email you receive as a maintainer after your upload, or reply to the rejection email in case you are already re-uploading.
ru: Если вы считаете, что по поводу вашего пакета необходимо дать дополнительные объяснения администраторам очереди новых (NEW) пакетов, добавьте их в журнал изменений, отправьте по адресу &email-ftpmaster; ваш ответ на сообщение электронной почты, которое вы получите как сопровождающий после вашей загрузки пакета, либо ответьте на сообщение об отказе, если вы осуществляете загрузку повторно.

source: When closing security bugs include CVE numbers as well as the <literal>Closes: #<replaceable>nnnnn</replaceable></literal>. This is useful for the security team to track vulnerabilities. If an upload is made to fix the bug before the advisory ID is known, it is encouraged to modify the historical changelog entry with the next upload. Even in this case, please include all available pointers to background information in the original changelog entry.
ru: Закрывая сообщения об ошибках безопасности, добавляйте номера CVE, а также <literal>Closes: #<replaceable>nnnnn</replaceable></literal>. Это помогает команде безопасности отслеживать уязвимости. Если загрузка осуществляется для того, чтобы исправить ошибку, и если идентификационный номер рекомендации по безопасности ещё не известен, советуем вам во время следующей загрузки изменить запись в журнале изменений и добавить номер рекомендации. Даже в этом случае добавляйте все доступные указатели на общую информацию из записи оригинального журнала изменений.

source: There are a number of reasons why we ask maintainers to announce their intentions:
ru: Имеется ряд причин, почему мы просим сопровождающих анонсировать их намерения, они приведены ниже:

source: It helps the (potentially new) maintainer to tap into the experience of people on the list, and lets them know if anyone else is working on it already.
ru: Это помогает (потенциальному) сопровождающему получить советы опытных людей, участвующих в списке рассылки, и позволяет этим людям узнать, работает ли уже кто-нибудь над созданием пакета для данного ПО.

source: It lets other people thinking about working on the package know that there already is a volunteer, so efforts may be shared.
ru: Это позволяет другим людям, которые думают о работе над созданием пакета, знать, что кто-то уже начал этим заниматься, и поэтому можно объединить усилия.

source: It lets the rest of the maintainers know more about the package than the one line description and the usual changelog entry ``Initial release'' that gets posted to &email-debian-devel-changes;.
ru: Это позволяет остальным сопровождающим знать о данном пакете больше, чем то, что содержится в одной строке описания и обычной записи из журнала изменений вида ``Initial release'', которые публикуются в &email-debian-devel-changes;.

source: It is helpful to the people who live off <literal>unstable</literal> (and form our first line of testers). We should encourage these people.
ru: Это помогает людям, которые постоянно пользуются <literal>нестабильным</literal> выпуском (и являются теми, кто первый широко тестирует пакеты). Нам следует поощрять этих людей.

source: The announcements give maintainers and other interested parties a better feel of what is going on, and what is new, in the project.
ru: Анонсы дают сопровождающим и другим заинтересованным сторонам лучшее понимание того, что происходит и что является новым в Проекте.

source: Please see <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink> for common rejection reasons for a new package.
ru: Наиболее частые причины для отказа в добавлении нового пакета см. по адресу <ulink url="http://&ftp-master-host;/REJECT-FAQ.html"></ulink>.

source: Recording changes in the package
ru: Запись изменений в пакете
