Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: You should also ensure that the prospective maintainer is going to be a good maintainer. Do they already have some experience with other packages? If yes, are they doing a good job with them (check out some bugs)? Are they familiar with the package and its programming language? Do they have the skills needed for this package? If not, are they able to learn them?
ru: Кроме того, вам следует убедиться, что предполагаемый сопровождающий будет хорошим сопровождающим. Имеет ли он какой-либо опыт работы с другими пакетами? Если да, то хорошо ли он с ними работал (проверьте несколько ошибок)? Знаком ли он с пакетом и языком программирования, на котором написана программа? Имеет ли он требуемые для данного пакета навыки? Если нет, то способен ли он ими овладеть?

source: It's also a good idea to know where they stand with respect to Debian: do they agree with Debian's philosophy and do they intend to join Debian? Given how easy it is to become a Debian Maintainer, you might want to only sponsor people who plan to join. That way you know from the start that you won't have to act as a sponsor indefinitely.
ru: Выяснение того, как он относится к Debian, также является хорошей идеей: согласен ли он с философией Debian и хочет ли присоединиться к Debian? Учитывая то, насколько просто стать сопровождающим Debian, вы вероятно захотите спонсировать пакеты только тех людей, которые хотят присоединиться к Проекту. В этом случае вы с самого начала будет знать, что вам не придется быть спонсором в течении какого-то неопределённого времени.

source: Sponsoring a new package
ru: Спонсирование нового пакета

source: New maintainers usually have certain difficulties creating Debian packages — this is quite understandable. They will do mistakes. That's why sponsoring a brand new package into Debian requires a thorough review of the Debian packaging. Sometimes several iterations will be needed until the package is good enough to be uploaded to Debian. Thus being a sponsor implies being a mentor.
ru: Обычно новые сопровождающие испытывают определённые трудности при создании пакетов Debian — это вполне можно понять. Они будут совершать ошибки. Вот почему спонирование нового пакета в Debian требует проведения тщательного обзора процесса создания пакетов Debian. Иногда потребуется несколько повторений для того, чтобы пакет стал достаточно хорошим для его загрузки в архив Debian. Таким образом, спонсорство предполагает менторство.

source: Don't ever sponsor a new package without reviewing it. The review of new packages done by ftpmasters mainly ensures that the software is really free. Of course, it happens that they stumble on packaging problems but they really should not. It's your task to ensure that the uploaded package complies with the Debian Free Software Guidelines and is of good quality.
ru: Никогда не спонсируйте новый пакет, если вы его не изучили. Изучение новых пакетов осуществляется сопровождающими ftp-архива, это гарантирует, что ПО действительно является свободным. Конечно, иногда они обнаруживают проблемы создания пакета, но вообще они не должны этим заниматься. Это ваша задача, вы должны гарантировать, что загружаемый пакет соответствует Критериям Debian по определению Свободного ПО, и что он создан качественно.

source: You can find more checks in the wiki where several developers share their own <ulink url="http://wiki.debian.org/SponsorChecklist">sponsorship checklists</ulink>.
ru: Дополнительные проверки вы можете найти в wiki, там некоторые разработчики размещают свои собственные <ulink url="http://wiki.debian.org/SponsorChecklist">списки требований для спонсирования пакетов</ulink>.

source: Building the package and testing the software is part of the review, but it's also not enough. The rest of this section contains a non-exhaustive list of points to check in your review. <placeholder type="footnote" id="0"/>
ru: Сборка пакета и тестирование ПО являются частью исследования пакета, но этого не достаточно. Оставшаяся часть данного раздела содержит неполный список того, на что необходимо обратить внимание. <placeholder type="footnote" id="0"/>

source: Verify that the upstream tarball provided is the same that has been distributed by the upstream author (when the sources are repackaged for Debian, generate the modified tarball yourself).
ru: Убедитесь, что включённый в пакет tarball-архив, не отличается от архива, распространяемого автором основной ветки разработки (если архив с исходным кодом для Debian был создан заново, создайте изменённый tarball-архив самостоятельно).

source: Run <command>lintian</command> (see <xref linkend="lintian"/>). It will catch many common problems. Be sure to verify that any <command>lintian</command> overrides setup by the maintainer is fully justified.
ru: Запустите <command>lintian</command> (см. <xref linkend="lintian"/>). Он обнаружил многие часто встречающиеся проблемы. Убедитесь, что все настройки по игнорированию <command>lintian</command>, выполненные сопровождающим, обоснованы.

source: Run <command>licensecheck</command> (part of <xref linkend="devscripts"/>) and verify that <filename>debian/copyright</filename> seems correct and complete. Look for license problems (like files with “All rights reserved” headers, or with a non-DFSG compliant license). <command>grep -ri</command> is your friend for this task.
ru: Запустите <command>licensecheck</command> (часть <xref linkend="devscripts"/>) и убедитесь, что файл <filename>debian/copyright</filename> корректен и полон. Проверьте проблемы с лицензиями (напр., файлы с заголовками “All rights reserved”, либо распространяемые под несовместимой с Критериями Debian лицензией). Команда <command>grep -ri</command> поможет вам в решении этой задачи.

source: Proofread <filename>debian/rules</filename>: does it follow the best practices (see <xref linkend="bpp-debian-rules"/>)? Do you see some possible improvements?
ru: Проверьте <filename>debian/rules</filename>: подготовлен ли он в соответствии с лучшими практиками (см. <xref linkend="bpp-debian-rules"/>)? Можно ли что-либо улучшить?

source: Proofread the maintainer scripts (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>): will the <filename>preinst</filename>/<filename>postrm</filename> work when the dependencies are not installed? Are all the scripts idempotent (i.e. can you run them multiple times without consequences)?
ru: Проверьте сценарии сопровождающего (<filename>preinst</filename>, <filename>postinst</filename>, <filename>prerm</filename>, <filename>postrm</filename>, <filename>config</filename>): будет ли <filename>preinst</filename>/<filename>postrm</filename> работать в том случае, если зависимости не установлены? Все ли сценарии идемпотентны (т. е., можете ли вы запустить их несколько раз без каких-либо последствий)?

source: Review any change to upstream files (either in <filename>.diff.gz</filename>, or in <filename>debian/patches/</filename> or directly embedded in the <filename>debian</filename> tarball for binary files). Are they justified? Are they properly documented (with <ulink url="&url-dep3;">DEP-3</ulink> for patches)?
ru: Проверьте изменения в файлах из основной ветки разработки (либо в <filename>.diff.gz</filename>, либо в <filename>debian/patches/</filename>, либо в самом встроенном tarball-архиве <filename>debian</filename> для двоичных файлов). Обоснованы ли эти изменения? Правильно ли они документированы (с <ulink url="&url-dep3;">DEP-3</ulink> для заплат)?

source: For every file, ask yourself why the file is there and whether it's the right way to achieve the desired result. Is the maintainer following the best packaging practices (see <xref linkend="best-pkging-practices"/>)?
ru: Относительно каждого файла задайте себе вопрос о том, почему этот файл находится здесь, правильно достигнут желаемый результат. Следует ли сопровождающий лучшим практикам (см. <xref linkend="best-pkging-practices"/>)?

source: Build the packages, install them and try the software. Ensure you can remove and purge the packages. Maybe test them with <command>piuparts</command>.
ru: Соберите пакеты, установите их и попробуйте по-работать с эти ПО. Убедитесь, что вы можете удалить и очистить пакеты. Можно протестировать пакеты с помощью <command>piuparts</command>.

source: If the audit did not reveal any problem, you can build the package and upload it to Debian. Remember that even if you're not the maintainer, as a sponsor you are still responsible for what you upload to Debian. That's why you're encouraged to keep up with the package through the <xref linkend="pkg-tracking-system"/>.
ru: Если аудит не выявил каких-либо проблем, вы можете собрать пакет и загрузить его в Debian. Помните, что даже если вы не являетесь сопровождающим, как спонсор вы всё равно ответственны за то, что вы загружаете в Debian. Вот почему вам нужно отслеживать пакет при помощи <xref linkend="pkg-tracking-system"/>.

source: Note that you should not need to modify the source package to put your name in the <filename>changelog</filename> or in the <filename>control</filename> file. The <literal>Maintainer</literal> field of the <filename>control</filename> file and the <filename>changelog</filename> should list the person who did the packaging, i.e. the sponsoree. That way they will get all the BTS mail.
ru: Заметьте, что вам не нужно изменять пакет с исходным кодом для указания своего имени в файле <filename>changelog</filename> или в файле <filename>control</filename>. Поле <literal>Maintainer</literal> файла <filename>control</filename> и файла <filename>changelog</filename> должно сдержать имя того, кто создал пакет, т. е., того, кого вы спонсируете. Так этот человек будет получить всю почту от системы отслеживания ошибок.

source: Instead you should instruct <command>dpkg-buildpackage</command> to use your key for the signature. You do that with the <literal>-k</literal> option:
ru: Вместо этого вам следует явным образом настроить <command>dpkg-buildpackage</command> на использование вашего ключа для подписи пакета. Вы можете сделать это при помощи опции <literal>-k</literal>:

source: dpkg-buildpackage -k<replaceable>KEY-ID</replaceable>
ru: dpkg-buildpackage -k<replaceable>ИДЕНТИФИКАТОР-КЛЮЧА</replaceable>

source: If you use <command>debuild</command> and <command>debsign</command>, you can even configure it permanently in <filename>~/.devscripts</filename>:
ru: Если вы используете <command>debuild</command> и <command>debsign</command>, вы даже можете создать постоянную настройку в файле <filename>~/.devscripts</filename>:

source: DEBSIGN_KEYID=<replaceable>KEY-ID</replaceable>
ru: DEBSIGN_KEYID=<replaceable>ИДЕНТИФИКАТОР-КЛЮЧА</replaceable>

source: Sponsoring an update of an existing package
ru: Спонсирование обновления существующего пакета

source: You will usually assume that the package has already gone through a full review. So instead of doing it again, you will carefully analyze the difference between the current version and the new version prepared by the maintainer. If you have not done the initial review yourself, you might still want to have a more deeper look just in case the initial reviewer was sloppy.
ru: Обычно предполагают, что пакет уже прошёл полную проверку. Поэтому вместо того, чтобы производить её ещё раз, внимание обращают на проверку различий между текущей версией и новой версией, которая была подготовлена сопровождающим. Если вы самостоятельно не произвели изначальную проверку, вам, вероятно, будет нужно более детально ознакомиться с пакетом как будто тот, кто производил изначальную проверку, был недостаточно внимателен.

source: To be able to analyze the difference you need both versions. Download the current version of the source package (with <command>apt-get source</command>) and rebuild it (or download the current binary packages with <command>aptitude download</command>). Download the source package to sponsor (usually with <command>dget</command>).
ru: Чтобы проверить различия вам нужны обе версии пакета. Загрузите текущую версию пакета с исходным кодом (при помощи команды <command>apt-get source</command>) и соберите его заново (либо загрузите текущий двоичный пакет при помощи команды <command>aptitude download</command>). Загрузите спонсируемый пакет с исходным кодом sponsor (обычно при помощи команды <command>dget</command>).

source: Read the new changelog entry, it should tell you what to expect during the review. The main tool you will use is <command>debdiff</command> (provide by the <systemitem role="package">devscripts</systemitem> package), you can run it with two source packages (<filename>.dsc</filename> files), or two binary packages, or two <filename>.changes</filename> files (it will then compare all the binary packages listed in the <filename>.changes</filename>).
ru: Прочтите новую запись в журнале изменений, она должна сообщить вам, что следует ожидать во время проверки. Основным инструментом, который вы будете использовать, является <command>debdiff</command> (предоставляется пакетом <systemitem role="package">devscripts</systemitem>), вы можете запустить её, указав два пакета с исходным кодом (файлы <filename>.dsc</filename>), либо двумя двоичными пакетами, либо двумя файлами <filename>.changes</filename> (затем эта утилита сравнит все двоичные пакеты из списка <filename>.changes</filename>).

source: If you compare the source packages (excluding upstream files in the case of a new upstream version, for example by filtering the output of <command>debdiff</command> with <command>filterdiff -i '*/debian/*'</command>), you must understand all the changes you see and they should be properly documented in the Debian changelog.
ru: Если вы сравниваете пакеты с исходным кодом (исключая файлы из основной ветки разработки в случае новой версии из основной ветки разработки, например, фильтруя вывод команды <command>debdiff</command> с помощью <command>filterdiff -i '*/debian/*'</command>), вам следует понять все изменения, которые вы видите, и они должны быть соответствующим образом документированы в журнале изменений Debian.

source: If everything is fine, build the package and compare the binary packages to verify that the changes on the source package have no unexpected consequences (like some files dropped by mistake, missing dependencies, etc.).
ru: Если всё хорошо, соберите пакет и сравните двоичные пакеты для того, чтобы проверить, что изменения пакета с исходным кодом не создаёт каких-либо неожиданных последствий (как например, некоторые файлы по ошибке оказываются потерянными, отсутствуют зависимости и т. д.).

source: You might want to check out the Package Tracking System (see <xref linkend="pkg-tracking-system"/>) to verify if the maintainer has not missed something important. Maybe there are translations updates sitting in the BTS that could have been integrated. Maybe the package has been NMUed and the maintainer forgot to integrate the changes from the NMU into their package. Maybe there's a release critical bug that they have left unhandled and that's blocking migration to <literal>testing</literal>. If you find something that they could have done (better), it's time to tell them so that they can improve for next time, and so that they have a better understanding of their responsibilities.
ru: Возможно, вам захочется обратиться к системе отслеживания пакетов (см. <xref linkend="pkg-tracking-system"/>), чтобы убедиться в том, что сопровождающий не пропустил ничего важного. Возможно, в системе отслеживания ошибок имеются обновления перевода, которое может быть добавлено в пакет. Возможно, пакет был загружен тем, кто сопровождающим не является, и сопровождающий забыл добавить изменения, добавленные в этой загрузке, в свой пакет. Возможно, имеется критичная для выпуска ошибка, на которую не обратили внимания и которая блокирует миграцию пакета в <literal>тестируемый выпуск</literal>. Если обнаружите что-то, что может быть сделано (лучше), нужно сообщить сопровождающему, что он может улучшить в следующий раз, так он будет лучше понимать свою ответственность.

source: If you have found no major problem, upload the new version. Otherwise ask the maintainer to provide you a fixed version.
ru: Если вы не нашли серьёзных проблем, загрузите новую версию. В противном случае попросите сопровождающего предоставить вам исправленную версию.

source: Advocating new developers
ru: Поддержка новых разработчиков

source: See the page about <ulink url="&url-newmaint-advocate;">advocating a prospective developer</ulink> at the Debian web site.
ru: Смотрите страницу о <ulink url="&url-newmaint-advocate;">поддержке будущих разработчиков</ulink> на веб-сайте Debian.

source: Handling new maintainer applications
ru: Обработка заявок новых сопровождающих

source: Please see <ulink url="&url-newmaint-amchecklist;">Checklist for Application Managers</ulink> at the Debian web site.
ru: Пожалуйста, посмотрите <ulink url="&url-newmaint-amchecklist;">Перечень для менеджеров заявок</ulink> на веб-сайте Debian.

source: Debian Developer's Duties
ru: Обязанности разработчика Debian

source: Package Maintainer's Duties
ru: Обязанности сопровождающего пакетов

source: As a package maintainer, you're supposed to provide high-quality packages that are well integrated in the system and that adhere to the Debian Policy.
ru: Как сопровождающий пакета вы должны предоставлять пакеты высокого качества, которые хорошо интегрируются в систему и соответствуют Политике Debian.

source: Work towards the next <literal>stable</literal> release
ru: Работа по подготовке следующего <literal>стабильного</literal> выпуска

source: Providing high-quality packages in <literal>unstable</literal> is not enough, most users will only benefit from your packages when they are released as part of the next <literal>stable</literal> release. You are thus expected to collaborate with the release team to ensure your packages get included.
ru: Предоставление пакетов высокого качества в <literal>нестабильный выпуск</literal> не достаточно, большинство пользователей извлекут пользу из ваших пакетов в том случае, если они будут выпущены в составе следующего <literal>стабильного</literal> выпуска. Поэтому вам следует взаимодействовать с командой, курирующей выпуск, чтобы подстраховаться, что ваши пакеты будут добавлены в выпуск.

source: More concretely, you should monitor whether your packages are migrating to <literal>testing</literal> (see <xref linkend="testing"/>). When the migration doesn't happen after the test period, you should analyze why and work towards fixing this. It might mean fixing your package (in the case of release-critical bugs or failures to build on some architecture) but it can also mean updating (or fixing, or removing from <literal>testing</literal>) other packages to help complete a transition in which your package is entangled due to its dependencies. The release team might provide you some input on the current blockers of a given transition if you are not able to identify them.
ru: Более конкретно, вам необходимо отслеживать, мигрировали ли ваши пакеты в <literal>тестируемый</literal> выпуск (см. <xref linkend="testing"/>). Если миграция не произошла после периода тестирования, вам следует выяснить, почему так получилось, и по-работать над исправлением проблемы. Это может предполагать исправление пакета (в случае критичных для выпуска ошибок или проблем сборки на некоторых архитектурах), но также это может предполагать обновление (или исправление или удаление из <literal>тестируемого</literal> выпуска) других пакетов, чтобы помочь в завершении перехода пакетов, в котором ваш пакет застрял из-за своих зависимостей. Команда по выпуску может предоставить вам некоторую информацию о факторах, блокирующих некоторый данный переход пакетов, в случае, если вы сами не можете их определить.

source: Maintain packages in <literal>stable</literal>
ru: Сопровождение пакетов в <literal>стабильном</literal> выпуске

source: Most of the package maintainer's work goes into providing updated versions of packages in <literal>unstable</literal>, but their job also entails taking care of the packages in the current <literal>stable</literal> release.
ru: Большая часть работы сопровождающего пакетов сводится к загрузке обновлённых версий пакетов в <literal>нестабильный</literal> выпуск, но их работа также предполагает отслеживание пакетов в текущем <literal>стабильном</literal> выпуске.

source: While changes in <literal>stable</literal> are discouraged, they are possible. Whenever a security problem is reported, you should collaborate with the security team to provide a fixed version (see <xref linkend="bug-security"/>). When bugs of severity important (or more) are reported against the <literal>stable</literal> version of your packages, you should consider providing a targeted fix. You can ask the <literal>stable</literal> release team whether they would accept such an update and then prepare a <literal>stable</literal> upload (see <xref linkend="upload-stable"/>).
ru: Хотя вносить изменения в <literal>стабильный</literal> выпуск не рекомендуется, они возможны. Когда сообщается о проблеме безопасности, вам следует совместно с командой безопасности предоставить исправленную версию (см. <xref linkend="bug-security"/>). Если сообщается об ошибках с важностью important (или больше) в <literal>стабильной</literal> версии вашего пакета, вам следует подумать над предоставлением целевого исправления. Вы можете спросить команду выпуск <literal>стабильного</literal> выпуска о том, примут они такое обновление или нет, и затем уже подготовить загрузку в <literal>стабильный</literal> выпуск (см. <xref linkend="upload-stable"/>).

source: Manage release-critical bugs
ru: Работа с критичными для выпуска ошибками

source: Generally you should deal with bug reports on your packages as described in <xref linkend="bug-handling"/>. However, there's a special category of bugs that you need to take care of — the so-called release-critical bugs (RC bugs). All bug reports that have severity <literal>critical</literal>, <literal>grave</literal> or <literal>serious</literal> make the package unsuitable for inclusion in the next <literal>stable</literal> release. They can thus delay the Debian release (when they affect a package in <literal>testing</literal>) or block migrations to <literal>testing</literal> (when they only affect the package in <literal>unstable</literal>). In the worst scenario, they will lead to the package's removal. That's why these bugs need to be corrected as quickly as possible.
ru: Обычно вам следует работать с сообщениями об ошибках в ваших пакетах так, как это описано в разделе <xref linkend="bug-handling"/>. Тем не менее, имеется специальная категория ошибок, на которые следует обратить внимание — это так называемые критичные для выпуска ошибки (RC ошибки). Все такие сообщения об ошибках, имеющие важность <literal>critical</literal>, <literal>grave</literal> или <literal>serious</literal>, делают пакет неподходящим для включения в следующий <literal>стабильный</literal> выпуск. Таким образом, они могут задержать выпуск Debian (когда они затрагивают пакет из <literal>тестируемого</literal> выпуска), либо блокировать миграцию пакетов в <literal>тестируемый</literal> выпуск (когда они лишь затрагивают пакет из <literal>нестабильного</literal> выпуска). В худшем сценарии такие ошибки приведут к удалению пакета. Вот почему эти ошибки следует исправить как можно скорее.
