Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: The <systemitem role="package">docbook-xsl</systemitem> package provides the XSL files for building and styling the source to various output formats. You will need an XSLT processor, such as <systemitem role="package">xsltproc</systemitem>, to use the XSL stylesheets. Documentation for the stylesheets can be found in the various <systemitem role="package">docbook-xsl-doc-*</systemitem> packages.
ru: Пакет <systemitem role="package">docbook-xsl</systemitem> предоставляет файлы XSL для сборки и форматирования стиля исходных файлов в различные форматы вывода. Для того, чтобы использовать стили XSL, вам потребуется процессор XSLT, такой как <systemitem role="package">xsltproc</systemitem>. Документация для стилей может быть найдена в пакетах <systemitem role="package">docbook-xsl-doc-*</systemitem>.

source: To produce PDF from FO, you need an FO processor, such as <systemitem role="package">xmlroff</systemitem> or <systemitem role="package">fop</systemitem>. Another tool to generate PDF from DocBook XML is <systemitem role="package">dblatex</systemitem>.
ru: Чтобы создать PDF из FO, вам потребуется процессор FO, такой как <systemitem role="package">xmlroff</systemitem> или <systemitem role="package">fop</systemitem>. Другим инструментом для создания PDF из DocBook XML является <systemitem role="package">dblatex</systemitem>.

source: <systemitem role="package">debiandoc-sgml</systemitem> provides the DebianDoc SGML DTD, which is commonly used for Debian documentation, but is now deprecated (<systemitem role="package">docbook-xml</systemitem> should be used instead). It also provides scripts for building and styling the source to various output formats.
ru: <systemitem role="package">debiandoc-sgml</systemitem> предоставляет DebianDoc SGML DTD, который широко используется для подготовки документации по Debian, но в настоящее время устарел (следует использовать пакет <systemitem role="package">docbook-xml </systemitem>). Кроме того, он предоставляет сценарии для сборки и изменения стиля оформления исходного файла в других форматах вывода.

source: Documentation for the DTD can be found in the <systemitem role="package">debiandoc-sgml-doc</systemitem> package.
ru: Документация для DTD может быть найдена в пакете <systemitem role="package">debiandoc-sgml-doc</systemitem>.

source: Contains the public GPG and PGP keys of Debian developers. See <xref linkend="key-maint"/> and the package documentation for more information.
ru: Содержит публичные ключи GPG и ключи PGP разработчиков Debian. Дополнительную информацию см. в разделе <xref linkend="key-maint"/> и документации по пакету.

source: Contains the public GPG keys of Debian Maintainers. See <ulink url="&url-wiki-dm;"></ulink> for more information.
ru: Содержит публичные ключи GPG сопровождающих Debian. Более подробную информацию см. в разделе <ulink url="&url-wiki-dm;"></ulink>.

source: <systemitem role="package">debview</systemitem> provides an Emacs mode for viewing Debian binary packages. This lets you examine a package without unpacking it.
ru: <systemitem role="package">debview</systemitem> предоставляет режим Emacs для просмотра двоичных пакетов Debian. Утилита позволяет вам исследовать пакет без его распаковки.
