Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If you use a publicly accessible VCS repository for maintaining your Debian package, you may want to forward the commit notification to the PTS so that the subscribers (and possible co-maintainers) can closely follow the package's evolution.
ru: Если вы используете публично доступный репозиторий системы управления версиями для сопровождения вашего пакета Debian, вы возможно захотите пересылать оповещения о коммитах в систему отслеживания пакетов, так чтобы подписчики (и возможные помощники) могли более внимательно следить за эволюцией пакета.

source: Once you set up the VCS repository to generate commit notifications, you just have to make sure it sends a copy of those mails to <literal><replaceable>sourcepackage</replaceable>_cvs@&pts-host;</literal>. Only the people who accept the <literal>cvs</literal> keyword will receive these notifications. Note that the mail needs to be sent from a <literal>debian.org</literal> machine, otherwise you'll have to add the <literal>X-PTS-Approved: 1</literal> header.
ru: Когда вы настроите репозиторий системы управления версиями на порождение оповещений о коммитах, вам нужно лишь убедиться, что он отправляет копию этих сообщений на адрес <literal><replaceable>пакет-с-исходным-кодом</replaceable>_cvs@&pts-host;</literal>. Только те люди, которые принимают ключевое слово <literal>cvs</literal>, будут получать эти оповещения. Заметим, что сообщения должны отправляться с машины <literal>debian.org</literal>, в противном случае вам следует добавить заголовок <literal>X-PTS-Approved: 1</literal>.

source: For Subversion repositories, the usage of svnmailer is recommended. See <ulink url="&url-alioth-pkg;" /> for an example on how to do it.
ru: При использовании репозиториев Subversion рекомендуется использовать svnmailer. Пример того, как это делать, см. в <ulink url="&url-alioth-pkg;" />.

source: The PTS web interface
ru: Веб-интерфейс системы отслеживания пакетов

source: The PTS has a web interface at <ulink url="http://&pts-host;/"></ulink> that puts together a lot of information about each source package. It features many useful links (BTS, QA stats, contact information, DDTP translation status, buildd logs) and gathers much more information from various places (30 latest changelog entries, testing status, etc.). It's a very useful tool if you want to know what's going on with a specific source package. Furthermore there's a form that allows easy subscription to the PTS via email.
ru: Система отслеживания пакетов имеет веб-интерфейс по адресу <ulink url="http://&pts-host;/"></ulink>, в нём собирается множество информации о каждом пакете с исходным кодом. Там имеется множество полезных ссылок (система отслеживания ошибок, статистика QA, контактная информация, статус перевода DDTP, журналы сборки) и собирается большое количество информации из разные мест (30 последних записей из журнала изменений, статус в тестируемом выпуске и т. д.). Это очень полезный инструмент, если вы хотите знать, что происходит с конкретным пакетом в исходным кодом. Более того, там имеется форма, которая значительно облегчает подписку на сообщения системы отслеживания пакетов.

source: You can jump directly to the web page concerning a specific source package with a URL like <literal>http://&pts-host;/<replaceable>sourcepackage</replaceable></literal>.
ru: Вы можете напрямую перейти на веб-страницу конкретного пакета с исходным кодом при помощи URL вида <literal>http://&pts-host;/<replaceable>sourcepackage</replaceable></literal>.

source: This web interface has been designed like a portal for the development of packages: you can add custom content on your packages' pages. You can add static information (news items that are meant to stay available indefinitely) and news items in the latest news section.
ru: Данный веб-интерфейс был разработан как портал для разработки пакетов: вы можете добавлять любое содержание на страницы ваших пакетов. Вы можете добавлять статичную информацию (новости, доступные в течении неопределённого времени) и новости раздела последних новостей.

source: Static news items can be used to indicate:
ru: Статичные новости могут использоваться для сообщения о

source: the availability of a project hosted on <link linkend="alioth">Alioth</link> for co-maintaining the package
ru: доступности проекта, размещённого на <link linkend="alioth">Alioth</link>, для совместного сопровождения пакета

source: a link to the upstream web site
ru: ссылки на веб-сайт основной ветки разработки

source: a link to the upstream bug tracker
ru: ссылки на систему отслеживания ошибок основной ветки разработки

source: the existence of an IRC channel dedicated to the software
ru: существование IRC-канала, предназначенного для обсуждения данного ПО

source: any other available resource that could be useful in the maintenance of the package
ru: любых других доступных ресурсах, которые могут оказаться полезными при сопровождении пакета

source: Usual news items may be used to announce that:
ru: Обычные новости могут использовать для сообщения о том, что

source: beta packages are available for testing
ru: доступны бета-версии пакетов для тестирования

source: final packages are expected for next week
ru: окончательные пакеты ожидаются на следующей неделе

source: the packaging is about to be redone from scratch
ru: пакет будет создан заново с нуля

source: backports are available
ru: доступны обратные переносы

source: the maintainer is on vacation (if they wish to publish this information)
ru: сопровождающий находится в отпуске (если он, конечно, хочет сообщить об этом)

source: a NMU is being worked on
ru: ведётся работа над загрузкой пакета не-сопровождающим

source: something important will affect the package
ru: что-то важное может повлиять на пакет

source: Both kinds of news are generated in a similar manner: you just have to send an email either to <email>pts-static-news@qa.debian.org</email> or to <email>pts-news@qa.debian.org</email>. The mail should indicate which package is concerned by having the name of the source package in a <literal>X-PTS-Package</literal> mail header or in a <literal>Package</literal> pseudo-header (like the BTS reports). If a URL is available in the <literal>X-PTS-Url</literal> mail header or in the <literal>Url</literal> pseudo-header, then the result is a link to that URL instead of a complete news item.
ru: Оба вида новостей создаются сходным образом: вам нужно лишь отправить сообщение по электронной почте либо на <email>pts-static-news@qa.debian.org</email>, либо на <email>pts-news@qa.debian.org</email>. Сообщение должно содержать указание на то, какому пакету оно предназначается, для этого следует добавить имя пакета с исходным кодом в заголовок <literal>X-PTS-Package</literal>, либо в псевдозаголовок <literal>Package</literal> (как в сообщениях системы отслеживания ошибок). Если в заголовке <literal>X-PTS-Url</literal> или в псевдозаголовке <literal>Url</literal> доступен URL, то в результате вы получите ссылку на этот URL вместо полной новости.

source: Here are a few examples of valid mails used to generate news items in the PTS. The first one adds a link to the viewsvn interface of debian-cd in the Static information section:
ru: Ниже приведены несколько примеров корректных сообщений, используемых для создания новостей в системе отслеживания пакетов. Первый добавляет ссылку на интерфейс viewsvn для debian-cd в разделе статичной информации:

source: The second one is an announcement sent to a mailing list which is also sent to the PTS so that it is published on the PTS web page of the package. Note the use of the BCC field to avoid answers sent to the PTS by mistake.
ru: Второй пример представляет собой анонс, отправляемый в список рассылки, который также отправляется в систему отслеживания пакетов, то есть он публикуется на веб-странице пакета в системе отслеживания пакетов. Обратите внимание на использование поля BCC для того, чтобы ответы на сообщение не отправлялись по ошибке в систему отслеживания пакетов.

source: Think twice before adding a news item to the PTS because you won't be able to remove it later and you won't be able to edit it either. The only thing that you can do is send a second news item that will deprecate the information contained in the previous one.
ru: Дважды подумайте перед тем как добавлять новость в систему отслеживания пакетов, так как вы не сможете потом её удалить или отредактировать. Единственное, что вы можете сделать &mdash; отправить вторую новость, которая в некотором смысле будет предполагать, что информация в предыдущей новости устарела.

source: Developer's packages overview
ru: Обзор пакетов разработчика

source: A QA (quality assurance) web portal is available at <ulink url="&url-ddpo;"></ulink> which displays a table listing all the packages of a single developer (including those where the party is listed as a co-maintainer). The table gives a good summary about the developer's packages: number of bugs by severity, list of available versions in each distribution, testing status and much more including links to any other useful information.
ru: Веб-портал QA (гарантия качества) доступен по адресу <ulink url="&url-ddpo;"></ulink>, на нём отображается таблица с пакетами одного разработчика (включая те пакеты, у которых в качестве помощников указана группа). Таблица даёт обзор пакетов конкретного разработчика: число ошибок по их важности, список доступных версий в каждом выпуске, статус в тестируемом выпуске и множество ссылок на другую полезную информацию.

source: It is a good idea to look up your own data regularly so that you don't forget any open bugs, and so that you don't forget which packages are your responsibility.
ru: Рекомендуется регулярно просматривать эти данные для своих пакетов, так вы не забудете об открытых сообщениях об ошибках и не забудете то, за какие пакеты вы ответственны.

source: Debian's FusionForge installation: Alioth
ru: Установка Debian FusionForge: Alioth

source: Alioth is a Debian service based on a slightly modified version of the FusionForge software (which evolved from SourceForge and GForge). This software offers developers access to easy-to-use tools such as bug trackers, patch manager, project/task managers, file hosting services, mailing lists, VCS repositories etc. All these tools are managed via a web interface.
ru: Alioth является службой Debian, основанной на слегка изменённой версии ПО FusionForge (которое эволюционировало из SourceForge и GForge). Это ПО предлагает разработчикам доступ к простым в использовании инструментам, таким как системы отслеживания ошибок, ПО для управления заплатами, ПО для управления проектами/задачами, службы хостинга файлов, списки рассылки, репозитории систем управления версиями и т. д. Управление всеми этими инструментами осуществляется через веб-интерфейс.

source: It is intended to provide facilities to free software projects backed or led by Debian, facilitate contributions from external developers to projects started by Debian, and help projects whose goals are the promotion of Debian or its derivatives. It's heavily used by many Debian teams and provides hosting for all sorts of VCS repositories.
ru: Это ПО предназначено для того, чтобы предоставить свободным проектам, которые поддерживаются или ведутся Debian, облегчения участия внешних разработчиков в проектах, начатых Debian, а также для помощи проектам, чьими целями являются продвижение Debian или производных от него дистрибутивов. Оно активно используется многими командами Debian и предоставляет хостинг для всех видов репозиториев систем управления версиями.

source: All Debian developers automatically have an account on Alioth. They can activate it by using the recover password facility. External developers can request guest accounts on Alioth.
ru: Все разработчики Debian автоматически получают учётную запись на Alioth. Они могут активировать ее, используя инструмент восстановления пароля. Внешние разработчики могут запросить гостевые учётные записи на Alioth.

source: For more information please visit the following links:
ru: Для получения дополнительной информации перейдите по следующим ссылкам:

source: Goodies for Developers
ru: Вкусности для разработчиков

source: LWN Subscriptions
ru: Подписка на LWN

source: Since October of 2002, HP has sponsored a subscription to LWN for all interested Debian developers. Details on how to get access to this benefit are in <ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink>.
ru: С октября 2002 года HP спонсирует подписку на LWN для всех заинтересованных разработчиков Debian. Подробности о том, как получить доступ к этой подписке, см. в <ulink url="http://&lists-host;/debian-devel-announce/2002/10/msg00018.html"></ulink>.

source: Gandi.net Hosting Discount
ru: Скидки на хостинг Gandi.net

source: As of November 2008, Gandi.net offers a discount rate on their VPS hosting for Debian Developers. See <ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>.
ru: С ноября 2008 года Gandi.net предлагает скидки на услуги VPS хостинга для разработчиков Debian. См. <ulink url="http://&lists-host;/debian-devel-announce/2008/11/msg00004.html"></ulink>.

source: Scope of This Document
ru: Границы данного документа

source: The purpose of this document is to provide an overview of the recommended procedures and the available resources for Debian developers.
ru: Целью данного документа является предоставление обзора рекомендованных процедур и доступных разработчикам Debian ресурсов.

source: The procedures discussed within include how to become a maintainer (<xref linkend="new-maintainer"/>); how to create new packages (<xref linkend="newpackage"/>) and how to upload packages (<xref linkend="upload"/>); how to handle bug reports (<xref linkend="bug-handling"/>); how to move, remove, or orphan packages (<xref linkend="archive-manip"/>); how to port packages (<xref linkend="porting"/>); and how and when to do interim releases of other maintainers' packages (<xref linkend="nmu"/>).
ru: Обсуждаемые здесь процедуры включают в себя то, как статьи сопровождающим (<xref linkend="new-maintainer"/>); как создавать новые пакеты (<xref linkend="newpackage"/>) и как загружать пакеты (<xref linkend="upload"/>); как работать с сообщениями об ошибках (<xref linkend="bug-handling"/>); как перемещать, удалять или придавать пакетам статус осиротевших пакетов (<xref linkend="archive-manip"/>); как переносить пакеты на другие архитектуры (<xref linkend="porting"/>); и то, как и когда выполнять временные выпуски пакетов других сопровождающих (<xref linkend="nmu"/>).

source: The resources discussed in this reference include the mailing lists (<xref linkend="mailing-lists"/>) and servers (<xref linkend="server-machines"/>); a discussion of the structure of the Debian archive (<xref linkend="archive"/>); explanation of the different servers which accept package uploads (<xref linkend="upload-ftp-master"/>); and a discussion of resources which can help maintainers with the quality of their packages (<xref linkend="tools"/>).
ru: Обсуждаемые ресурсы в данном руководстве включают в себя списки рассылки (<xref linkend="mailing-lists"/>) и серверы (<xref linkend="server-machines"/>); обсуждается структура архива Debian (<xref linkend="archive"/>); объясняются разные серверы, которые принимают загрузки пакетов (<xref linkend="upload-ftp-master"/>); также обсуждаются ресурсы, которые могут помочь сопровождающим контролировать качество своих пакетов (<xref linkend="tools"/>).

source: It should be clear that this reference does not discuss the technical details of Debian packages nor how to generate them. Nor does this reference detail the standards to which Debian software must comply. All of such information can be found in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>.
ru: Должно быть ясно, что данное руководство не содержит обсуждения технических деталей пактов Debian и технических деталей их создания. Данное руководство не содержит подробных сведений о стандартах, которым должно отвечать ПО в Debian. Вся эта информация может быть найдена в <ulink url="&url-debian-policy;">Руководстве по политике Debian</ulink>.

source: Furthermore, this document is <emphasis>not an expression of formal policy</emphasis>. It contains documentation for the Debian system and generally agreed-upon best practices. Thus, it is not what is called a ``normative'' document.
ru: Более того, данный документ <emphasis>не выражает формальной политики</emphasis>. Он содержит документацию по системе Debian и лучшие практики, принимаемые большинством. Таким образом, это не ``нормативные'' документ.

source: Overview of Debian Maintainer Tools
ru: Обзор инструментов Debian для сопровождающего

source: This section contains a rough overview of the tools available to maintainers. The following is by no means complete or definitive, but just a guide to some of the more popular tools.
ru: Данный раздел содержит краткий обзор доступных сопровождающим инструментов. Приведённая ниже информация ни в коем мере не является полной или окончательной, она представляет собой лишь руководство по некоторым более популярным утилитам.

source: Debian maintainer tools are meant to aid developers and free their time for critical tasks. As Larry Wall says, there's more than one way to do it.
ru: Инструменты сопровождающего Debian предназначены для облегчения работы разработчиком и освобождения их времени для решения критических задач. Как говорит Ларри Уолл, существует более одного способа сделать это.

source: Most of the descriptions of these packages come from the actual package descriptions themselves. Further information can be found in the package documentation itself. You can also see more info with the command <command>apt-cache show <replaceable>package-name</replaceable></command>.
ru: Большинство описаний этих пакетов берётся из самих фактических описаний пакетов. Дополнительная информация может быть найдена в самой документации по пакету. Также вы можете получить дополнительную информацию при помощи команды <command>apt-cache show <replaceable>имя-пакета</replaceable></command>.

source: Core tools
ru: Базовые инструменты

source: The following tools are pretty much required for any maintainer.
ru: Следующие инструменты весьма нужны любому сопровождающими.

source: <systemitem role="package">dpkg-dev</systemitem> contains the tools (including <command>dpkg-source</command>) required to unpack, build, and upload Debian source packages. These utilities contain the fundamental, low-level functionality required to create and manipulate packages; as such, they are essential for any Debian maintainer.
ru: <systemitem role="package">dpkg-dev</systemitem> содержит инструменты (включая <command>dpkg-source</command>), необходимые для распаковки, сборки и загрузки пакетов Debian с исходным кодом. Эти утилиты предоставляют базовую, низкоуровневую функциональность, необходимую для создания пакетов и для манипуляции ими; как таковые, эти утилиты являются необходимыми любому сопровождающему Debian.

source: <systemitem role="package">debconf</systemitem> provides a consistent interface to configuring packages interactively. It is user interface independent, allowing end-users to configure packages with a text-only interface, an HTML interface, or a dialog interface. New interfaces can be added as modules.
ru: <systemitem role="package">debconf</systemitem> предоставляет единообразный интерфейс для интерактивной настройки пакетов. Его пользовательских интерфейс независим, что позволяет конечным пользователям настраивать пакеты при помощи текстового интерфейса, интерфейса HTML, либо диалогового интерфейса. Новые варианты интерфейса могут быть добавлены в виде модулей.

source: You can find documentation for this package in the <systemitem role="package">debconf-doc</systemitem> package.
ru: Документацию для этого пакета вы можете найти в пакете <systemitem role="package">debconf-doc</systemitem>.

source: Many feel that this system should be used for all packages which require interactive configuration; see <xref linkend="bpp-config-mgmt"/>. <systemitem role="package">debconf</systemitem> is not currently required by Debian Policy, but that may change in the future.
ru: Многие считают, что эта система должна использоваться для всех пакетов, которым требуется интерактивная настройка; см. <xref linkend="bpp-config-mgmt"/>. В настоящее время Политика Debian не требует использовать <systemitem role="package">debconf</systemitem>, но это может быть изменено в будущем.

source: <systemitem role="package">fakeroot</systemitem> simulates root privileges. This enables you to build packages without being root (packages usually want to install files with root ownership). If you have <systemitem role="package">fakeroot</systemitem> installed, you can build packages as a regular user: <literal>dpkg-buildpackage -rfakeroot</literal>.
ru: <systemitem role="package">fakeroot</systemitem> имитирует привилегии суперпользователя. Это позволяет вам собирать пакеты, не имя привилегий суперпользователя (обычно пакеты хотят установить файлы, владельцем которых является суперпользователь). Если у вас установлен <systemitem role="package">fakeroot</systemitem>, вы можете собирать пакеты от лица обычного пользователя: <literal>dpkg-buildpackage -rfakeroot</literal>.

source: Package lint tools
ru: Инструменты для проверки пакетов на предмет ошибок и соответствия стандартам

source: According to the Free On-line Dictionary of Computing (FOLDOC), `lint' is a Unix C language processor which carries out more thorough checks on the code than is usual with C compilers. Package lint tools help package maintainers by automatically finding common problems and policy violations in their packages.
ru: Согласно свободному онлайн словарю вычислительной техники (FOLDOC), `lint' является обработчиком языка Unix C, который выполняет больше проверок кода, чем обычные компиляторы C. Инструменты для проверки пакетов помогают сопровождающим, автоматически находя распространённые ошибки и нарушения Политики в пакетах.

source: <systemitem role="package">lintian</systemitem> dissects Debian packages and emits information about bugs and policy violations. It contains automated checks for many aspects of Debian policy as well as some checks for common errors.
ru: <systemitem role="package">lintian</systemitem> анализирует пакеты Debian и выдаёт информацию об ошибках и нарушениях Политики. Он содержит автоматические проверки множества аспектов Политики Debian, а также некоторые проверки на наличие распространённых ошибок.

source: You should periodically get the newest <systemitem role="package">lintian</systemitem> from <literal>unstable</literal> and check over all your packages. Notice that the <literal>-i</literal> option provides detailed explanations of what each error or warning means, what its basis in Policy is, and commonly how you can fix the problem.
ru: Периодически вам следует получить наиболее свежую версию <systemitem role="package">lintian</systemitem> из <literal>нестабильного</literal> выпуска и проверять все ваши пакеты. Заметьте, что опция <literal>-i</literal> предоставляет подробное объяснение того, что означает каждая ошибка или предупреждение, на каком пункте Политики они основываются, а иногда и то, как вы можете исправить проблему.

source: Refer to <xref linkend="sanitycheck"/> for more information on how and when to use Lintian.
ru: Для получения дополнительной информации о том, как и когда использовать Lintian, обратитесь к <xref linkend="sanitycheck"/>.
