Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: You can also see a summary of all problems reported by Lintian on your packages at <ulink url="&url-lintian;"></ulink>. These reports contain the latest <command>lintian</command> output for the whole development distribution (<literal>unstable</literal>).
ru: Также вы можете посмотреть обзор всех проблем, о которых было сообщено Lintian для ваших пакетов, по адресу <ulink url="&url-lintian;"></ulink>. Эти отчёты содержат наиболее свежий вывод <command>lintian</command> для всего разрабатываемого выпуска (<literal>нестабильного</literal> выпуска).

source: <command>debdiff</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) compares file lists and control files of two packages. It is a simple regression test, as it will help you notice if the number of binary packages has changed since the last upload, or if something has changed in the control file. Of course, some of the changes it reports will be all right, but it can help you prevent various accidents.
ru: <command>debdiff</command> (из пакета <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) сравнивает списки файлов и управляющие файлы двух пакетов. Это простая проверка на наличие регрессий, поскольку она позволяет вам заметить, что число двоичных пакетов изменилось с момента последней загрузки, либо если что-то было изменено в управляющем файле. Конечно, некоторые изменения, о которых сообщает эта утилита, не являются чем-то плохим, но она может помочь вам предотвратить различные случайные проблемы.

source: You can run it over a pair of binary packages:
ru: Вы можете запустить её, указав два двоичных пакета:

source: Or even a pair of changes files:
ru: Или даже два файла changes:

source: For more information please see <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ru: Дополнительную информацию см. в <citerefentry> <refentrytitle>debdiff</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.

source: Helpers for <filename>debian/rules</filename>
ru: Помощники для <filename>debian/rules</filename>

source: Package building tools make the process of writing <filename>debian/rules</filename> files easier. See <xref linkend="helper-scripts"/> for more information about why these might or might not be desired.
ru: Инструменты сборки пакетов делают написание файла <filename>debian/rules</filename> значительно проще. Дополнительную информацию о том, почему желательно или не желательно использовать их, см. в <xref linkend="helper-scripts"/>.

source: <systemitem role="package">debhelper</systemitem> is a collection of programs which can be used in <filename>debian/rules</filename> to automate common tasks related to building binary Debian packages. <systemitem role="package">debhelper</systemitem> includes programs to install various files into your package, compress files, fix file permissions, and integrate your package with the Debian menu system.
ru: <systemitem role="package">debhelper</systemitem> представляет собой набор программ, которые могут использовать в <filename>debian/rules</filename> для автоматизации распространённых задач, связанных со сборкой двоичных пакетов Debian. <systemitem role="package">debhelper</systemitem> включает в себя программы для установки различных файлов в ваши пакеты, сжатия файлов, исправления прав доступа к файлам, а также интеграции вашего пакета в систему меню Debian.

source: Unlike some approaches, <systemitem role="package">debhelper</systemitem> is broken into several small, simple commands which act in a consistent manner. As such, it allows more fine-grained control than some of the other debian/rules tools.
ru: В отличии от других подходов, <systemitem role="package">debhelper</systemitem> разбит на несколько небольших и простых команд, которые работают заодно. Как таковой, этот подход позволяет осуществлять более тщательное управление, чем то предоставляет другими инструментами для debian/rules.

source: There are a number of little <systemitem role="package">debhelper</systemitem> add-on packages, too transient to document. You can see the list of most of them by doing <literal>apt-cache search ^dh-</literal>.
ru: Имеется ряд небольших дополнительных пакетов <systemitem role="package">debhelper</systemitem>, которые слишком мелки, чтобы описывать их здесь. Вы можете посмотреть список этих программ, выполнив <literal>apt-cache search ^dh-</literal>.

source: The <systemitem role="package">dh-make</systemitem> package contains <command>dh_make</command>, a program that creates a skeleton of files necessary to build a Debian package out of a source tree. As the name suggests, <command>dh_make</command> is a rewrite of <systemitem role="package">debmake</systemitem> and its template files use <command>dh_*</command> programs from <systemitem role="package">debhelper</systemitem>.
ru: Пакет <systemitem role="package">dh-make</systemitem> содержит <command>dh_make</command>, программу, которая создаёт основу файлов, которые необходимы для сборки пакета Debian из дерева исходного кода. Как то предполагается в названии этой программы, <command>dh_make</command> является новой версией <systemitem role="package">debmake</systemitem>, её файлы-шаблоны используют программы <command>dh_*</command> из <systemitem role="package">debhelper</systemitem>.

source: While the rules files generated by <command>dh_make</command> are in general a sufficient basis for a working package, they are still just the groundwork: the burden still lies on the maintainer to finely tune the generated files and make the package entirely functional and Policy-compliant.
ru: Хотя файлы rules, порождаемые <command>dh_make</command>, вообще-то являются достаточной основой для создания рабочего пакета, они всё равно представляют собой лишь основу: на сопровождающем всё ещё лежит груз задачи по тонкой настройке порождённых файлов и сборке пакета, целиком соответствующего Политике и работающего.

source: <systemitem role="package">equivs</systemitem> is another package for making packages. It is often suggested for local use if you need to make a package simply to fulfill dependencies. It is also sometimes used when making ``meta-packages'', which are packages whose only purpose is to depend on other packages.
ru: <systemitem role="package">equivs</systemitem> представляет собой ещё один пакет для создания пакетов. Часто он предлагается для локального использования, если вам нужно сделать пакет просто для удовлетворения зависимостей. Также он иногда используется при создании ``метапакетов'', это пакеты, чья цель состоит лишь в том, чтобы зависеть от других пакетов.

source: Package builders
ru: Сборщики пакетов

source: <systemitem role="package">cvs-buildpackage</systemitem> provides the capability to inject or import Debian source packages into a CVS repository, build a Debian package from the CVS repository, and helps in integrating upstream changes into the repository.
ru: <systemitem role="package">cvs-buildpackage</systemitem> предоставляет возможность введения или импорта пакетов Debian с исходным кодом в репозиторий CVS, сборки пакета Debian из репозитория CVS, а также помогает в интеграции изменений из основной ветки разработке в репозиторий.

source: These utilities provide an infrastructure to facilitate the use of CVS by Debian maintainers. This allows one to keep separate CVS branches of a package for <literal>stable</literal>, <literal>unstable</literal> and possibly <literal>experimental</literal> distributions, along with the other benefits of a version control system.
ru: Эти утилиты предоставляют инфраструктуру для облегчения использования CVS сопровождающими Debian. Это позволяет хранить отдельные ветки CVS пакета для <literal>стабильного</literal>, <literal>нестабильного</literal> и возможно <literal>экспериментального</literal> выпусков, а также иметь все другие преимущества системы контроля версий.

source: The <systemitem role="package">debootstrap</systemitem> package and script allows you to bootstrap a Debian base system into any part of your filesystem. By base system, we mean the bare minimum of packages required to operate and install the rest of the system.
ru: Пакет <systemitem role="package">debootstrap</systemitem> и соответствующий сценарий позволяют вам произвести начальную установку базовой системы Debian в любую часть файловой системы. Под базовой системой мы подразумеваем минимальное число пакетов, необходимых для работы и установки остальной системы.

source: Having a system like this can be useful in many ways. For instance, you can <command>chroot</command> into it if you want to test your build dependencies. Or you can test how your package behaves when installed into a bare base system. Chroot builders use this package; see below.
ru: Иметь подобную систему весьма полезно. Например, вы можете сделать <command>chroot</command> в эту систему и проверить ваши сборочные зависимости. Либо вы можете проверить то, как ведут себя ваши пакеты при установке на базовую систему. Сборщики chroot используют этот пакет; см. об этом ниже.

source: <systemitem role="package">pbuilder</systemitem> constructs a chrooted system, and builds a package inside the chroot. It is very useful to check that a package's build-dependencies are correct, and to be sure that unnecessary and wrong build dependencies will not exist in the resulting package.
ru: <systemitem role="package">pbuilder</systemitem> создаёт систему в chroot и собирает пакет внутри chroot. Это полезно для проверки того, то сборочные зависимости пакета указаны верно, а также для того, чтобы убедиться, что ненужных и неправильных сборочных зависимостей в получившемся пакете нет.

source: A related package is <systemitem role="package">pbuilder-uml</systemitem>, which goes even further by doing the build within a User Mode Linux environment.
ru: С ним связан пакет <systemitem role="package">pbuilder-uml</systemitem>, он в некотором смысле идёт ещё дальше, осуществляя сборку в окружении User Mode Linux.

source: <systemitem role="package">sbuild</systemitem> is another automated builder. It can use chrooted environments as well. It can be used stand-alone, or as part of a networked, distributed build environment. As the latter, it is part of the system used by porters to build binary packages for all the available architectures. See <xref linkend="wanna-build"/> for more information, and <ulink url="&url-buildd;"></ulink> to see the system in action.
ru: <systemitem role="package">sbuild</systemitem> представляет собой другой автоматизированный сборщик. Он также может использовать окружения chroot. Он может использоваться как отдельно, так и как часть сетевого, распределённого окружения. В последнем случае он является частью системы, используемой теми, кто занимается переносом, для сборки двоичных пакетов для всех доступных архитектур. Дополнительную информацию см. в <xref linkend="wanna-build"/>, систему в действии можно посмотреть по адресу <ulink url="&url-buildd;"></ulink>.

source: Package uploaders
ru: ПО для загрузки пакетов

source: The following packages help automate or simplify the process of uploading packages into the official archive.
ru: Следующие пакеты помогут автоматизировать или упростить процесс загрузки пакетов в официальный архив.

source: <systemitem role="package">dupload</systemitem> is a package and a script to automatically upload Debian packages to the Debian archive, to log the upload, and to send mail about the upload of a package. You can configure it for new upload locations or methods.
ru: <systemitem role="package">dupload</systemitem> представляет собой пакет и сценарий для автоматической загрузки пакетов Debian в архив Debian, для записи журнала загрузки, а также отправки сообщений электронной почты о загрузке пакета. Вы можете настроить его на использование новых мест или методов загрузки.

source: The <systemitem role="package">dput</systemitem> package and script does much the same thing as <systemitem role="package">dupload</systemitem>, but in a different way. It has some features over <systemitem role="package">dupload</systemitem>, such as the ability to check the GnuPG signature and checksums before uploading, and the possibility of running <command>dinstall</command> in dry-run mode after the upload.
ru: Пакет и сценарий <systemitem role="package">dput</systemitem> выполняет по большей части то же, что и <systemitem role="package">dupload</systemitem>, но по-другому. Он имеет некоторые дополнительные возможности по сравнению с <systemitem role="package">dupload</systemitem>, такие как способность проверять подпись GnuPG и контрольные суммы до загрузки, а также возможность запуска <command>dinstall</command> в холостом режиме после загрузки.

source: The <command>dcut</command> script (part of the package <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) helps in removing files from the ftp upload directory.
ru: Сценарий <command>dcut</command> (часть пакета <systemitem role="package">dput</systemitem>, <xref linkend="dput"/>) помогает удалять файлы из каталога загрузки на ftp.

source: Maintenance automation
ru: Автоматизация сопровождения пакетов

source: The following tools help automate different maintenance tasks, from adding changelog entries or signature lines and looking up bugs in Emacs to making use of the newest and official <filename>config.sub</filename>.
ru: Следующие инструменты помогают автоматизировать различные задачи по сопровождению пакетов от добавления записей в журнал изменений или строк подписи и поиска ошибок в Emacs до использования наиболее свежего и исключительно официального файла <filename>config.sub</filename>.

source: <systemitem role="package">devscripts</systemitem> is a package containing wrappers and tools which are very helpful for maintaining your Debian packages. Example scripts include <command>debchange</command> and <command>dch</command>, which manipulate your <filename>debian/changelog</filename> file from the command-line, and <command>debuild</command>, which is a wrapper around <command>dpkg-buildpackage</command>. The <command>bts</command> utility is also very helpful to update the state of bug reports on the command line. <command>uscan</command> can be used to watch for new upstream versions of your packages. <command>debrsign</command> can be used to remotely sign a package prior to upload, which is nice when the machine you build the package on is different from where your GPG keys are.
ru: <systemitem role="package">devscripts</systemitem> представляет собой пакет, содержащий обёртки и инструменты, которые весьма полезны для сопровождения ваших пакетов Debian. К примеру, в нём имеются сценарии <command>debchange</command> и <command>dch</command>, которые управляют вашим файлом <filename>debian/changelog</filename> из командной строки, <command>debuild</command>, который представляет собой обёртку вокруг <command>dpkg-buildpackage</command>. Утилита <command>bts</command> также очень полезна для обновления статуса сообщений об ошибках из командной строки. <command>uscan</command> может использоваться для отслеживания новых версий основной ветки разработки для ваших пакетов. <command>debrsign</command> может использоваться для выполнения удалённого подписывания вашего пакета до его загрузки, что очень удобно если машина, на которой вы собрали ваш пакет, отличается от той, где находятся ваши ключи GPG.

source: See the <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> manual page for a complete list of available scripts.
ru: Полный список доступных сценариев см. в руководстве <citerefentry> <refentrytitle>devscripts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.

source: <systemitem role="package">autotools-dev</systemitem> contains best practices for people who maintain packages which use <command>autoconf</command> and/or <command>automake</command>. Also contains canonical <filename>config.sub</filename> and <filename>config.guess</filename> files which are known to work on all Debian ports.
ru: <systemitem role="package">autotools-dev</systemitem> включает в себя лучшие практики для тех, кто сопровождает пакеты, использующие <command>autoconf</command> и/или <command>automake</command>. Также в этом пакете содержаться канонические файлы <filename>config.sub</filename> и <filename>config.guess</filename>, которые, как это известно, работают на всех переносах Debian.

source: <command>dpkg-repack</command> creates Debian package file out of a package that has already been installed. If any changes have been made to the package while it was unpacked (e.g., files in <filename>/etc</filename> were modified), the new package will inherit the changes.
ru: <command>dpkg-repack</command> создаёт пакет Debian из пакета, который уже был установлен. Если в пакете были произведены какие-либо изменения в то время когда он был распакован (напр., были изменены файлы в <filename>/etc</filename>), новый пакет наследует все изменения.

source: This utility can make it easy to copy packages from one computer to another, or to recreate packages which are installed on your system but no longer available elsewhere, or to save the current state of a package before you upgrade it.
ru: Эта утилита позволяет легко копировать пакеты с одного компьютера на другой, либо заново создавать пакеты, которые были установлены в вашей системе, но более нигде не доступны, либо для сохранения текущего состояния пакета до того, как вы его обновите.

source: <command>alien</command> converts binary packages between various packaging formats, including Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris, and Slackware packages.
ru: <command>alien</command> преобразует пакеты между различными форматами пакетов, включая пакеты Debian, RPM (RedHat), LSB (Linux Standard Base), Solaris, и Slackware.

source: <command>debsums</command> checks installed packages against their MD5 sums. Note that not all packages have MD5 sums, since they aren't required by Policy.
ru: <command>debsums</command> проверяет установленные пакеты, сравнивая их с контрольной суммой MD5. Заметьте, что не все пакеты имеют контрольную сумму MD5, поскольку это не требуется Политикой.

source: <systemitem role="package">dpkg-dev-el</systemitem> is an Emacs lisp package which provides assistance when editing some of the files in the <filename>debian</filename> directory of your package. For instance, there are handy functions for listing a package's current bugs, and for finalizing the latest entry in a <filename>debian/changelog</filename> file.
ru: <systemitem role="package">dpkg-dev-el</systemitem> является пакетом Emacs lisp, который предоставляет помощь в редактировании некоторых файлов в каталоге <filename>debian</filename> вашего пакета. Например, в этом пакете имеются полезные функции для вывода списка текущих ошибок пакета, а также для завершения последней записи в файле <filename>debian/changelog</filename>.

source: <command>dpkg-depcheck</command> (from the <systemitem role="package">devscripts</systemitem> package, <xref linkend="devscripts"/>) runs a command under <command>strace</command> to determine all the packages that were used by the said command.
ru: <command>dpkg-depcheck</command> (из пакета <systemitem role="package">devscripts</systemitem>, <xref linkend="devscripts"/>) запускает команду в окружении <command>strace</command> для определения всех пакетов, которые используются вызванной командой.

source: For Debian packages, this is useful when you have to compose a <literal>Build-Depends</literal> line for your new package: running the build process through <command>dpkg-depcheck</command> will provide you with a good first approximation of the build-dependencies. For example:
ru: Для пакетов Debian это весьма полезно, если вам необходимо сформировать строку <literal>Build-Depends</literal> для вашего нового пакета: запуск процесса сборки через <command>dpkg-depcheck</command> предоставит вам приблизительный список сборочных зависимостей. Например:

source: <command>dpkg-depcheck</command> can also be used to check for run-time dependencies, especially if your package uses <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> to run other programs.
ru: <command>dpkg-depcheck</command> также может использоваться для проверки зависимостей времени исполнения, особенно в том случае, если ваш пакет использует <citerefentry> <refentrytitle>exec</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> для запуска других программ.

source: For more information please see <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.
ru: Дополнительную информацию см. в <citerefentry> <refentrytitle>dpkg-depcheck</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>.

source: Porting tools
ru: Инструменты для переноса

source: The following tools are helpful for porters and for cross-compilation.
ru: Следующие инструменты полезны для занимающихся переносом и кросс-компиляцией.

source: <systemitem role="package">quinn-diff</systemitem> is used to locate the differences from one architecture to another. For instance, it could tell you which packages need to be ported for architecture <replaceable>Y</replaceable>, based on architecture <replaceable>X</replaceable>.
ru: <systemitem role="package">quinn-diff</systemitem> используется для обнаружения отличий одной архитектуры от другой. Например, эта утилита может сообщить вам, какие пакеты следует перенести на архитектуру <replaceable>Y</replaceable> на основе архитектуры <replaceable>X</replaceable>.

source: <systemitem role="package">dpkg-cross</systemitem> is a tool for installing libraries and headers for cross-compiling in a way similar to <systemitem role="package">dpkg</systemitem>. Furthermore, the functionality of <command>dpkg-buildpackage</command> and <command>dpkg-shlibdeps</command> is enhanced to support cross-compiling.
ru: <systemitem role="package">dpkg-cross</systemitem> является инструментом для установки библиотек и заголовочных файлов для перекрёстной компиляции схожим с <systemitem role="package">dpkg</systemitem> способом. Более того, функциональность <command>dpkg-buildpackage</command> и <command>dpkg-shlibdeps</command> была улучшена в плане поддержки перекрёстной компиляции.

source: Documentation and information
ru: Документация и информацию

source: The following packages provide information for maintainers or help with building documentation.
ru: Следующие пакеты предоставляют информацию для сопровождающих, либо помогают им в сборке документации.

source: <systemitem role="package">docbook-xml</systemitem> provides the DocBook XML DTDs, which are commonly used for Debian documentation (as is the older debiandoc SGML DTD). This manual, for instance, is written in DocBook XML.
ru: <systemitem role="package">docbook-xml</systemitem> предоставляет DocBook XML DTD, который обычно используется для подготовки документации по Debian (как более старая документация debiandoc SGML DTD). Например, данное руководство написано в DocBook XML.
