Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: According to <ulink url="&url-i18n-intro;">Introduction to i18n</ulink> from Tomohiro KUBOTA, I18N (internationalization) means modification of a software or related technologies so that a software can potentially handle multiple languages, customs, and so on in the world, while L10N (localization) means implementation of a specific language for an already internationalized software.
ru: Согласно <ulink url="&url-i18n-intro;">Введению в интернационализацию</ulink>, написанному Томохиро Кубота, I18N (интернационализация) предполагает изменение ПО или связанных технологий таким образом, чтобы это ПО потенциально могло работать на нескольких языках, поддерживало несколько обычаев и т. д., L10N (локализация) же означает реализацию конкретного языка для уже интернационализированного ПО.

source: l10n and i18n are interconnected, but the difficulties related to each of them are very different. It's not really difficult to allow a program to change the language in which texts are displayed based on user settings, but it is very time consuming to actually translate these messages. On the other hand, setting the character encoding is trivial, but adapting the code to use several character encodings is a really hard problem.
ru: l10n и i18n взаимосвязаны, но трудности, касающиеся каждого из этих процессов, весьма различны. Вообще-то не сложно сделать так, чтобы программа изменяла язык, на котором отображается текст, на основе пользовательских настроек, но перевести все эти сообщения весьма затратно по времени. С другой стороны, установить кодировку символов весьма легко, но изменить код так, чтобы можно было использовать несколько кодировок, довольно трудно.

source: Setting aside the i18n problems, where no general guideline can be given, there is actually no central infrastructure for l10n within Debian which could be compared to the buildd mechanism for porting. So most of the work has to be done manually.
ru: Если оставить проблемы i18n, по поводу которых нет общего руководства, в стороне, можно видеть, что для l10n в Debian нет какой-либо центральной инфраструктуре, которая бы была сравнима с механизмом buildd для переноса на другие архитектуры. Поэтому большая часть работы выполняется вручную.

source: How translations are handled within Debian
ru: Как переводы обрабатываются в Debian

source: Handling translation of the texts contained in a package is still a manual task, and the process depends on the kind of text you want to see translated.
ru: Обработка переводов текстов, содержащихся в пакете, всё ещё является задачей, которую приходится решать вручную, сам же этот процесс зависит от того, к какому виду относится текст, который вы желаете перевести.

source: For program messages, the gettext infrastructure is used most of the time. Most of the time, the translation is handled upstream within projects like the <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, the <ulink url="&url-l10n-gnome;">Gnome translation Project</ulink> or the <ulink url="&url-l10n-kde;">KDE one</ulink>. The only centralized resource within Debian is the <ulink url="&url-l10n;">Central Debian translation statistics</ulink>, where you can find some statistics about the translation files found in the actual packages, but no real infrastructure to ease the translation process.
ru: Для перевода сообщений программ почти всегда используется инфраструктура gettext. В большинстве случаев перевод осуществляется в основной ветке разработки в таких проектах как the <ulink url="&url-l10n-tp;">Free Translation Project</ulink>, <ulink url="&url-l10n-gnome;">проект по переводу Gnome</ulink> или <ulink url="&url-l10n-kde;">проект по переводу KDE</ulink>. Единственным централизованным ресурсом в Debian является <ulink url="&url-l10n;">Центральная статистика переводов Debian</ulink>, где вы можете найти некоторую статистику относительно файлов переводов, входящих в текущие пакеты, но для облегчения процесса перевода нет никакой инфраструктуры.

source: An effort to translate the package descriptions started long ago, even if very little support is offered by the tools to actually use them (i.e., only APT can use them, when configured correctly). Maintainers don't need to do anything special to support translated package descriptions; translators should use the <ulink url="&url-ddtp;">Debian Description Translation Project (DDTP)</ulink>.
ru: Попытка перевести описания пакетов предпринимается уже давно, инструменты, использующие описания пакетов предоставляют довольно небольшую поддержку переводов (напр., только APT может использовать эти переводы при условии правильной настройки). Сопровождающим не нужно предпринимать каких-либо специальных действия для поддержки переведённых описаний пакетов; переводчикам же следует пользоваться <ulink url="&url-ddtp;">проектом по переводу описаний пакетов Debian (DDTP)</ulink>.

source: For <systemitem role="package">debconf</systemitem> templates, maintainers should use the <systemitem role="package">po-debconf</systemitem> package to ease the work of translators, who could use the DDTP to do their work (but the French and Brazilian teams don't). Some statistics can be found both on the <ulink url="&url-ddtp;">DDTP site</ulink> (about what is actually translated), and on the <ulink url="&url-l10n;">Central Debian translation statistics</ulink> site (about what is integrated in the packages).
ru: Для шаблонов <systemitem role="package">debconf</systemitem>, сопровождающим следует использовать пакет <systemitem role="package">po-debconf</systemitem> для облегчения работы переводчиков, которые могут использовать DDTP для выполнения своей работы (но французская и бразильская команды не используют DDTP). Некоторая статистика может быть найдена и на <ulink url="&url-ddtp;">сайте DDTP</ulink> (о том, что фактически переведено), и на сайте <ulink url="&url-l10n;">центральной статистики переводов Debian</ulink> (о том, что интегрировано в пакеты).

source: For web pages, each l10n team has access to the relevant VCS, and the statistics are available from the Central Debian translation statistics site.
ru: Для веб-страницы у каждой команды l10n имеется доступ к релевантной системе управления версиями, статистика доступна на сайте центральной статистики переводов Debian.

source: For general documentation about Debian, the process is more or less the same as for the web pages (the translators have access to the VCS), but there are no statistics pages.
ru: Для общей документации относительно Debian процесс перевода более или менее совпадает с процессом перевода веб-страниц (переводчики имеют доступ к системе управления версиями), но страницы со статистикой отсутствуют.

source: For package-specific documentation (man pages, info documents, other formats), almost everything remains to be done.
ru: Для документации по пакетам (страницы man, документы info, другие форматы), необходимо сделать почти всё.

source: Most notably, the KDE project handles translation of its documentation in the same way as its program messages.
ru: Перевод документации в проект KDE осуществляется по тому же принципу, как перевод сообщений программ.

source: There is an effort to handle Debian-specific man pages within a <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">specific VCS repository</ulink>.
ru: В <ulink url="&url-cvsweb;manpages/?cvsroot=debian-doc">специальном репозитории системы управления версиями</ulink> предпринята попытка перевода страниц man, непосредственно связанных с Проектом Debian.

source: I18N &amp; L10N FAQ for maintainers
ru: ЧаВО по I18N и L10N для сопровождающих

source: This is a list of problems that maintainers may face concerning i18n and l10n. While reading this, keep in mind that there is no real consensus on these points within Debian, and that this is only advice. If you have a better idea for a given problem, or if you disagree on some points, feel free to provide your feedback, so that this document can be enhanced.
ru: Это список проблем i18n и l10n, с которыми могут столкнуться сопровождающие. Читая данный документ, помните, что в настоящее время никакого действительного согласия по этим вопросам в Debian нет, и что в документе содержатся только советы. Если у вас имеются более подходящие идеи для некоторой данной проблемы, либо если вы не согласны с чем-то, не стесняйтесь сообщить об этом, это поспособствует улучшению данного документа.

source: How to get a given text translated
ru: Как перевести некоторый данный текст

source: To translate package descriptions or <systemitem role="package">debconf</systemitem> templates, you have nothing to do; the DDTP infrastructure will dispatch the material to translate to volunteers with no need for interaction from your part.
ru: Чтобы перевести описания пакетов или шаблоны <systemitem role="package">debconf</systemitem>, вам не нужно ничего делать; инфраструктура DDTP перешлёт материал для перевода добровольцам, это совершенно не требует вашего вмешательства.

source: For all other material (gettext files, man pages, or other documentation), the best solution is to put your text somewhere on the Internet, and ask on debian-i18n for a translation in different languages. Some translation team members are subscribed to this list, and they will take care of the translation and of the reviewing process. Once they are done, you will get your translated document from them in your mailbox.
ru: Касательно всех остальных материалов (файлы gettext, страницы руководства man и другая документация) лучшим решением будет поместить ваш текст где-нибудь в сети Интернет и попросить в списке рассылки debian-i18n перевести его на различные языки. Некоторые члены команд переводчиков подписаны на этот список рассылки, они позаботятся о переводе и проверке. Когда они закончат с этим, в вашем почтовом ящике вы найдёте ваш переведённый документ.

source: How to get a given translation reviewed
ru: Как проверить перевод

source: From time to time, individuals translate some texts in your package and will ask you for inclusion of the translation in the package. This can become problematic if you are not fluent in the given language. It is a good idea to send the document to the corresponding l10n mailing list, asking for a review. Once it has been done, you should feel more confident in the quality of the translation, and feel safe to include it in your package.
ru: Время от времени кто-то переводит различные тексты из ваших пакетов, эти люди будут просить вас включить их перевод в пакет. Это может быть проблемой, если вы не владеете данным языком. Лучше всего выслать данный документ в соответствующий список рассылки l10n и попросить о проверке. Когда это будет сделано, вы будете более уверены в качестве перевода, тогда уже можете спокойно добавлять его в ваш пакет.

source: How to get a given translation updated
ru: Как обновить перевод

source: If you have some translations of a given text lying around, each time you update the original, you should ask the previous translator to update the translation with your new changes. Keep in mind that this task takes time; at least one week to get the update reviewed and all.
ru: Если у вас имеются переводы какого-то текста, то всякий раз, когда вы обновляете оригинал, вам следует попросить предыдущего переводчика обновить его перевод для включения новых изменений. Помните, что эта задача требует некоторого времени; по меньшей мере, нужна одна неделя, чтобы обновить и проверить весь перевод.

source: If the translator is unresponsive, you may ask for help on the corresponding l10n mailing list. If everything fails, don't forget to put a warning in the translated document, stating that the translation is somehow outdated, and that the reader should refer to the original document if possible.
ru: Если переводчик не отвечает, вы можете попросить о помощи в соответствующем списке рассылки l10n. Если ничего не получилось, не забудьте добавить предупреждение в переведённый документ о том, что данный перевод устарел, и что читателю по возможности следует обратиться к оригинальному документу.

source: Avoid removing a translation completely because it is outdated. Old documentation is often better than no documentation at all for non-English speakers.
ru: Избегайте полного удаления перевода даже в случае, если он сильно устарел. Для тех, что не говорит на английском устаревшая документация зачастую лучше, чем её полное отсутствие.

source: How to handle a bug report concerning a translation
ru: Как работать с отчётом об ошибке, касающемся перевода

source: The best solution may be to mark the bug as forwarded to upstream, and forward it to both the previous translator and their team (using the corresponding debian-l10n-XXX mailing list).
ru: Лучшим решением может состоять в следующем: отметьте сообщение об ошибке как пересланное в основную ветку разработки, затем перешлите её предыдущему переводчику и соответствующей команде локализации (используя соответствующий список рассылки debian-l10n-XXX).

source: I18N &amp; L10N FAQ for translators
ru: ЧаВО по I18N и L10N для переводчиков

source: While reading this, please keep in mind that there is no general procedure within Debian concerning these points, and that in any case, you should collaborate with your team and the package maintainer.
ru: Читая данный документ, помните, что в Debian отсутствует какая-либо общая процедура, определяющая работу над переводами, в любом случае вам следует взаимодействовать с вашей командой и сопровождающим пакета.

source: How to help the translation effort
ru: Как помочь с переводом

source: Choose what you want to translate, make sure that nobody is already working on it (using your debian-l10n-XXX mailing list), translate it, get it reviewed by other native speakers on your l10n mailing list, and provide it to the maintainer of the package (see next point).
ru: Выберите, что бы вы хотели перевести, убедитесь, что никто не работает над переводом этого документа (используя ваш список рассылки debian-l10n-XXX), переведите, получите отзывы от других носителей языка в вашем списке рассылки l10n, предоставьте перевод сопровождающему пакета (см. следующий пункт).

source: How to provide a translation for inclusion in a package
ru: Как предоставить перевод для добавления его в пакет

source: Make sure your translation is correct (asking for review on your l10n mailing list) before providing it for inclusion. It will save time for everyone, and avoid the chaos resulting in having several versions of the same document in bug reports.
ru: Убедитесь, что перевод верен (попросив проверить его в вашем списке рассылки l10n) до отправки его для включения в пакет. Это сохранит всем время и позволит избежать хаоса, когда в сообщениях об ошибках имеются несколько версий одного и того же документа.

source: The best solution is to file a regular bug containing the translation against the package. Make sure to use the 'PATCH' tag, and to not use a severity higher than 'wishlist', since the lack of translation never prevented a program from running.
ru: Лучшим решением будет отправить обычное сообщение об ошибке в данном пакете, содержащее перевод. Убедитесь, что вы используете метку 'PATCH', а важность ошибки не выше, чем 'wishlist', так как отсутствие перевода не мешает программе работать.

source: Best current practice concerning l10n
ru: Лучшие текущие практики, касающиеся локализации

source: As a maintainer, never edit the translations in any way (even to reformat the layout) without asking on the corresponding l10n mailing list. You risk for example breaking the encoding of the file by doing so. Moreover, what you consider an error can be right (or even needed) in the given language.
ru: Как сопровождающему вам никогда не следует редактировать переводы (даже для изменения форматирования), не спросив об этом в соответствующем списке рассылки l10n. Вы рискуете, например, испортить кодировку файлов. Более того, то, что вы считаете ошибкой, может оказаться правильным (или даже необходимым) для данного языка.

source: As a translator, if you find an error in the original text, make sure to report it. Translators are often the most attentive readers of a given text, and if they don't report the errors they find, nobody will.
ru: Как переводчику, если вы находите ошибку в оригинальном тексте, вам следует сообщить об этом. Переводчики часто являются более внимательными читателями некоторого данного текста, и если они не сообщают о найденных ошибках, то о них не сообщит никто.

source: In any case, remember that the major issue with l10n is that it requires several people to cooperate, and that it is very easy to start a flamewar about small problems because of misunderstandings. So if you have problems with your interlocutor, ask for help on the corresponding l10n mailing list, on debian-i18n, or even on debian-devel (but beware, l10n discussions very often become flamewars on that list :)
ru: В любом случае помните, что главная проблема l10n состоит в том, что для локализации требуется взаимодействие нескольких людей, и что из-за непонимания очень и очень легко начать войну по поводу небольших проблем. Поэтому если у вас возникли проблемы с вашим собеседником, попросите о помощи в соответствующем списке рассылки l10n, в списке рассылки debian-i18n или даже в debian-devel (но остерегайтесь, обсуждения l10n в этом списке рассылки часто переходят в настоящие войны :)

source: In any case, cooperation can only be achieved with <emphasis role="strong">mutual respect</emphasis>.
ru: В любом случае взаимодействие может быть достигнут только благодаря <emphasis role="strong">взаимному уважению</emphasis>.

source: Applying to Become a Maintainer
ru: Подача заявки на получение статуса сопровождающего

source: Getting started
ru: Приступаем к работе

source: So, you've read all the documentation, you've gone through the <ulink url="&url-newmaint-guide;">Debian New Maintainers' Guide</ulink>, understand what everything in the <systemitem role="package">hello</systemitem> example package is for, and you're about to Debianize your favorite piece of software. How do you actually become a Debian developer so that your work can be incorporated into the Project?
ru: Итак, вы прочли всю документацию, вы прочли <ulink url="&url-newmaint-guide;">Руководство начинающего разработчика Debian</ulink>, поняли, зачем нужно всё то, что содержится в пакете <systemitem role="package">hello</systemitem>, вы собираетесь сделать своё любимое ПО частью Debian. Как же вам стать разработчиком Debian, как сделать так, чтобы ваша работа была включена в Проект?

source: Firstly, subscribe to &email-debian-devel; if you haven't already. Send the word <literal>subscribe</literal> in the <literal>Subject</literal> of an email to &email-debian-devel-req;. In case of problems, contact the list administrator at &email-listmaster;. More information on available mailing lists can be found in <xref linkend="mailing-lists"/>. &email-debian-devel-announce; is another list which is mandatory for anyone who wishes to follow Debian's development.
ru: По-первых, подпишитесь на &email-debian-devel; если вы ещё не оформили подписку. Отправьте слово <literal>subscribe</literal> в поле <literal>Тема</literal> вашего сообщения электронной почты на адрес &email-debian-devel-req;. В случае возникновения проблем свяжитесь с администратором списка по адресу &email-listmaster;. Дополнительная информация о доступных списках рассылки может быть найдена в разделе <xref linkend="mailing-lists"/>. &email-debian-devel-announce; — ещё один обязательный список для тех, кто хочет следить за разработкой и развитием Debian.

source: You should subscribe and lurk (that is, read without posting) for a bit before doing any coding, and you should post about your intentions to work on something to avoid duplicated effort.
ru: Вам следует подписаться и ненадолго скрыться (то есть, читать сообщения и не отправлять ничего в список) до начала какой-либо работы над кодом, вам следует писать о ваших намерениях по реализации чего-либо для того, чтобы избежать повторов в работе.

source: Another good list to subscribe to is &email-debian-mentors;. See <xref linkend="mentors"/> for details. The IRC channel <literal>#debian</literal> can also be helpful; see <xref linkend="irc-channels"/>.
ru: Ещё одним хорошим списком рассылки, на который стоит подписаться, является &email-debian-mentors;. Подробность см. в <xref linkend="mentors"/>. IRC-канал <literal>#debian</literal> также может быть полезен; см. <xref linkend="irc-channels"/>.

source: When you know how you want to contribute to &debian-formal;, you should get in contact with existing Debian maintainers who are working on similar tasks. That way, you can learn from experienced developers. For example, if you are interested in packaging existing software for Debian, you should try to get a sponsor. A sponsor will work together with you on your package and upload it to the Debian archive once they are happy with the packaging work you have done. You can find a sponsor by mailing the &email-debian-mentors; mailing list, describing your package and yourself and asking for a sponsor (see <xref linkend="sponsoring"/> and <ulink url="&url-mentors;"></ulink> for more information on sponsoring). On the other hand, if you are interested in porting Debian to alternative architectures or kernels you can subscribe to port specific mailing lists and ask there how to get started. Finally, if you are interested in documentation or Quality Assurance (QA) work you can join maintainers already working on these tasks and submit patches and improvements.
ru: Когда вы решите, как вы хотите участвовать в &debian-formal;, вам следует связаться с существующими сопровождающими Debian, которые работают над схожими задачами. Это позволит вам научиться у опытных разработчиков. Например, если вы заинтересованы в создании пакетов Debian для существующего ПО, вам следует попытаться найти спонсора. Спонсор будет работать с вами над вашим пакетом и загрузит его в архив Debian, когда он будет доволен проделанной вами работой по созданию пакета. Вы можете найти спонсора, отправив сообщение в список рассылки &email-debian-mentors; с описанием вашего пакета и себя самого и с просьбой о спонсорстве (дополнительную информацию о спонсорстве см. в разделах <xref linkend="sponsoring"/> и <ulink url="&url-mentors;"></ulink>). С другой стороны, если вы заинтересованы в переносе Debian на альтернативные архитектуры или ядра, вы можете подписаться на конкретные списки рассылки и спросить там о том, как начать работу. Наконец, если вы заинтересованы в работе над документацией или в контроле качества (QA), вы можете присоединиться к сопровождающим, которые уже работают над этими задачами и отправляют заплаты и улучшения.

source: One pitfall could be a too-generic local part in your mailadress: Terms like mail, admin, root, master should be avoided, please see <ulink url="&url-debian-lists;"></ulink> for details.
ru: Одной из проблем может быть то, что локальная часть вашего адреса электронной почты имеет слишком общий характер: следует избегать таких терминов как mail, admin, root, master, подробности см. в <ulink url="&url-debian-lists;"></ulink>.

source: Debian mentors and sponsors
ru: Наставники и спонсоры Debian

source: The mailing list &email-debian-mentors; has been set up for novice maintainers who seek help with initial packaging and other developer-related issues. Every new developer is invited to subscribe to that list (see <xref linkend="mailing-lists"/> for details).
ru: Список рассылки &email-debian-mentors; создан для начинающих сопровождающих, которые ищут помощи в работе над созданием пакетов или в решении связанных с разработкой проблем. Каждому новому разработчику рекомендуется подписаться на этот список рассылки (подробности см. в <xref linkend="mailing-lists"/>).
