Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Note that mirrors are generally run by third-parties who are interested in helping Debian. As such, developers generally do not have accounts on these machines.
ru: Заметьте, что зеркала обычно обслуживаются третьими лицами, которые заинтересованы в оказании помощи Debian. Как таковые, разработчики обычно не имеют учётных записей на этих машинах.

source: The Incoming system
ru: Система входящих пакетов

source: The Incoming system is responsible for collecting updated packages and installing them in the Debian archive. It consists of a set of directories and scripts that are installed on <literal>&ftp-master-host;</literal>.
ru: Система входящих пакетов ответственна за сбор обновлённых пакетов и их установку в архив Debian. Она состоит из набора каталогов и сценариев, которые установлены на <literal>&ftp-master-host;</literal>.

source: Packages are uploaded by all the maintainers into a directory called <filename>UploadQueue</filename>. This directory is scanned every few minutes by a daemon called <command>queued</command>, <filename>*.command</filename>-files are executed, and remaining and correctly signed <filename>*.changes</filename>-files are moved together with their corresponding files to the <filename>unchecked</filename> directory. This directory is not visible for most Developers, as ftp-master is restricted; it is scanned every 15 minutes by the <command>dak process-upload</command> script, which verifies the integrity of the uploaded packages and their cryptographic signatures. If the package is considered ready to be installed, it is moved into the <filename>done</filename> directory. If this is the first upload of the package (or it has new binary packages), it is moved to the <filename>new</filename> directory, where it waits for approval by the ftpmasters. If the package contains files to be installed by hand it is moved to the <filename>byhand</filename> directory, where it waits for manual installation by the ftpmasters. Otherwise, if any error has been detected, the package is refused and is moved to the <filename>reject</filename> directory.
ru: Пакеты загружаются сопровождающими в каталог с названием <filename>UploadQueue</filename>. Этот каталог сканируется каждые несколько минут службой, названой <command>queued</command>, выполняются файлы <filename>*.command</filename>, а оставшиеся и корректно подписанные файлы <filename>*.changes</filename> перемещаются вместе с соответствующими их файлами в каталог <filename>unchecked</filename>. Этот каталог невидим для большинства разработчиков, поскольку доступ у главному ftp ограничен; он сканируется каждые 15 минут сценарием <command>dak process-upload</command>, который проверяет целостность загруженных пакетов и их криптографические подписи. Если пакет считается готовым к установке, он перемещается в каталог <filename>done</filename>. Если это первая загрузка данного пакета (либо в ней содержаться новые двоичные пакеты), пакет перемещается в каталог <filename>new</filename>, где он должен ожидать подтверждения от сопровождающих ftp. Если пакет содержит файлы, которые должны быть установлены вручную, он перемещается в каталог <filename>byhand</filename>, где он ожидает ручной установки, выполняемой сопровождающими ftp. В противном случае, если была обнаружена какая-либо ошибка, пакет получает отказ и перемещается в каталог <filename>reject</filename>.

source: Once the package is accepted, the system sends a confirmation mail to the maintainer and closes all the bugs marked as fixed by the upload, and the auto-builders may start recompiling it. The package is now publicly accessible at <ulink url="&url-incoming;"></ulink> until it is really installed in the Debian archive. This happens four times a day (and is also called the `dinstall run' for historical reasons); the package is then removed from incoming and installed in the pool along with all the other packages. Once all the other updates (generating new <filename>Packages</filename> and <filename>Sources</filename> index files for example) have been made, a special script is called to ask all the primary mirrors to update themselves.
ru: Когда пакет будет принят, система отправляет сообщение с подтверждением этого сопровождающему и закрывает все ошибки, которые были отмечены как исправленные в данной загрузке, тогда ПО для автоматической сборки может начать их повторную компиляцию. Теперь пакет доступен публично в <ulink url="&url-incoming;"></ulink>, она остаётся там до фактической установки в архив Debian. Это происходит четыре раза в день (и также по историческим причинам называется `dinstall run'); затем пакет удаляется из входящих и устанавливается в пул вместе со всеми другими пакетами. Когда все другие обновления (создающие, например, индексные файлы <filename>Packages</filename> и <filename>Sources</filename>) будут произведены, вызывается специальный сценарий, которые просит все первичные зеркала запустить обновление.

source: The archive maintenance software will also send the OpenPGP/GnuPG signed <filename>.changes</filename> file that you uploaded to the appropriate mailing lists. If a package is released with the <literal>Distribution</literal> set to <literal>stable</literal>, the announcement is sent to &email-debian-changes;. If a package is released with <literal>Distribution</literal> set to <literal>unstable</literal> or <literal>experimental</literal>, the announcement will be posted to &email-debian-devel-changes; instead.
ru: ПО для сопровождения архива также отправит подписанный с помощью OpenPGP/GnuPG файл <filename>.changes</filename>, который вы загрузили, в соответствующий список рассылки. Если у пакета поле <literal>Distribution</literal> имеет значение <literal>stable</literal>, то анонс отправляется в &email-debian-changes;. Если у пакета поле <literal>Distribution</literal> имеет значение <literal>unstable</literal> или <literal>experimental</literal>, то анонс будет отправлен в &email-debian-devel-changes;.

source: Though ftp-master is restricted, a copy of the installation is available to all developers on <literal>&ftp-master-mirror;</literal>.
ru: Хотя доступ к главному ftp ограничен, копия установки доступна всем разработчикам по адресу <literal>&ftp-master-mirror;</literal>.

source: Package information
ru: Информация о пакете

source: On the web
ru: В веб

source: Each package has several dedicated web pages. <literal>http://&packages-host;/<replaceable>package-name</replaceable></literal> displays each version of the package available in the various distributions. Each version links to a page which provides information, including the package description, the dependencies, and package download links.
ru: Каждый пакет имеет несколько выделенных для него веб-страниц. <literal>http://&packages-host;/<replaceable>имя-пакета</replaceable></literal> отображает каждую версию пакета, доступную в различных выпусках. Каждая версия представляет собой ссылку на страницу, предоставляющую информацию, включая описание пакета, зависимости и ссылки для скачивания пакета.

source: The bug tracking system tracks bugs for each package. You can view the bugs of a given package at the URL <literal>http://&bugs-host;/<replaceable>package-name</replaceable></literal>.
ru: Система отслеживания ошибок отслеживает ошибки каждого пакета. Вы можете просмотреть ошибки любого данного пакета по адресу <literal>http://&bugs-host;/<replaceable>имя-пакета</replaceable></literal>.

source: The <command>dak ls</command> utility
ru: Утилита <command>dak ls</command>

source: <command>dak ls</command> is part of the dak suite of tools, listing available package versions for all known distributions and architectures. The <command>dak</command> tool is available on <literal>&ftp-master-host;</literal>, and on the mirror on <literal>&ftp-master-mirror;</literal>. It uses a single argument corresponding to a package name. An example will explain it better:
ru: <command>dak ls</command> является частью набора инструментов dak, она выводит список доступных версий пакета для всех известных выпусков и архитектур. Инструмент <command>dak</command> доступен на <literal>&ftp-master-host;</literal>, а также на зеркале <literal>&ftp-master-mirror;</literal>. Он используется единственный аргумент, соответствующий имени пакета. Пример объяснит это лучше:

source: In this example, you can see that the version in <literal>unstable</literal> differs from the version in <literal>testing</literal> and that there has been a binary-only NMU of the package for all architectures. Each version of the package has been recompiled on all architectures.
ru: В этом примере вы можете видеть, что версия в <literal>нестабильном</literal> выпуске отличается от версии в <literal>тестируемом</literal> выпуске, и что была сделана binNMU этого пакета для всех архитектур. Каждая версия пакета была заново скомпилирована на всех архитектурах.

source: The Package Tracking System
ru: Система отслеживания пакета

source: The Package Tracking System (PTS) is an email-based tool to track the activity of a source package. This really means that you can get the same emails that the package maintainer gets, simply by subscribing to the package in the PTS.
ru: Система отслеживания пакетов (PTS) представляет собой построенный на базе электронной почты инструмент для отслеживания активности пакета с исходным кодом. В действительности, это означает, что вы можете получать ту же электронную почту, которую получает сопровождающий, просто подписавшись на пакет в системе отслеживания пакетов.

source: Each email sent through the PTS is classified under one of the keywords listed below. This will let you select the mails that you want to receive.
ru: Каждое сообщение электронной почты, отправляемое через систему отслеживания пакетов классифицируется о одному из ключевых слов, приведённых ниже. Это позволит вам выбирать сообщения, которые вы хотите получить.

source: By default you will get:
ru: По умолчанию вы будете получить следующие сообщения:

source: All the bug reports and following discussions.
ru: Все сообщения об ошибках и последующие их обсуждения.

source: The email notifications from <email>control@&bugs-host;</email> about bug report status changes.
ru: Сообщения от <email>control@&bugs-host;</email> об изменении статуса сообщения об ошибке.

source: The email notification from <command>dak</command> when an uploaded source package is accepted.
ru: Сообщения от <command>dak</command> о том, что загруженный пакет с исходным кодом был принят.

source: Build failures notifications sent by the network of build daemons, they contain a pointer to the build logs for analysis.
ru: Сообщения об ошибках сборки, отправляемые сетью сборочных служб, они содержат указатели на журналы сборки, которые следует изучить.

source: Any non-automatic email sent to the PTS by people who wanted to contact the subscribers of the package. This can be done by sending mail to <literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal>. In order to prevent spam, all messages sent to these addresses must contain the <literal>X-PTS-Approved</literal> header with a non-empty value.
ru: Любая неавтоматическая электронная почта, отправляемая в систему отслеживания пакетов теми людьми, которые желают связаться с подписчиками данного пакета. Это может быть сделано путём отправки почты по адресу <literal><replaceable>пакет с исходным кодом</replaceable>@&pts-host;</literal>. Для того, чтобы предотвратить отправку спама, все сообщения, отправляющиеся по этим адресам, должны содержать заголовок <literal>X-PTS-Approved</literal> с непустым значением.

source: Mails sent to the maintainer through the *@packages.debian.org email aliases.
ru: Почта, отправляемая сопровождающему через псевдонимы *@packages.debian.org.

source: Regular summary emails about the package's status, including progression into <literal>testing</literal>, <ulink url="&url-dehs;">DEHS</ulink> notifications of new upstream versions, and a notification if the package is removed or orphaned.
ru: Регулярные обобщенные сообщения о состоянии пакета, включая переход в <literal>тестируемый</literal> выпуск, сообщения <ulink url="&url-dehs;">DEHS</ulink> о новых версиях основной ветки разработки, а также сообщения об удалении или получения статуса осиротевшего пакета.

source: You can also decide to receive additional information:
ru: Также вы можете получить дополнительную информацию:

source: The email notification from <command>katie</command> when an uploaded binary package is accepted. In other words, whenever a build daemon or a porter uploads your package for another architecture, you can get an email to track how your package gets recompiled for all architectures.
ru: Сообщения от <command>katie</command>, отправляемые в случае принятия загруженного двоичного пакета. Другими словами, когда служба сборки или тот, кто занимается переносом, загружает ваш пакет для другой архитектуры, вы можете получить сообщений для отслеживания того, как ваш пакет компилируется для всех архитектур.

source: VCS commit notifications, if the package has a VCS repository and the maintainer has set up forwarding of commit notifications to the PTS. The "cvs" name is historic, in most cases commit notifications will come from some other VCS like subversion or git.
ru: Сообщения о коммитах в системе управления версиями, если пакет имеет репозиторий системы управления версиями и сопровождающий настроил пересылку сообщений о коммитах в систему отслеживания пакетов. Имя "cvs" является историческим, в большинстве случаев сообщения о коммитах будут приходить от других систем управления версиями, таких как subversion или git.

source: Translations of descriptions or debconf templates submitted to the Debian Description Translation Project.
ru: Переводы описаний или шаблонов debconf, отправленные в Проект по переводу описаний Debian.

source: Information about changes made to the package in derivative distributions (for example Ubuntu).
ru: Информацию об изменения, внесённых в пакет, в производных дистрибутивах (например, Ubuntu).

source: Bugs reports and comments from derivative distributions (for example Ubuntu).
ru: Сообщения об ошибках и комментарии из производных дистрибутивов (например, Ubuntu).

source: The PTS email interface
ru: Интерфейс электронной почты системы отслеживания пакетов

source: You can control your subscription(s) to the PTS by sending various commands to <email>pts@qa.debian.org</email>.
ru: Вы можете управлять своими подписками на систему отслеживания пакетов, отправляя различные команды по адресу <email>pts@qa.debian.org</email>.

source: <literal>subscribe &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
ru: <literal>subscribe &lt;пакет-с-исходным-кодом&gt; [&lt;адрес-электронной-почты&gt;]</literal>

source: Subscribes <replaceable>email</replaceable> to communications related to the source package <replaceable>sourcepackage</replaceable>. Sender address is used if the second argument is not present. If <replaceable>sourcepackage</replaceable> is not a valid source package, you'll get a warning. However if it's a valid binary package, the PTS will subscribe you to the corresponding source package.
ru: Подписывает <replaceable>адрес-электронной-почты</replaceable> на сообщения. связанные с пакетом с исходным кодом <replaceable>пакет-с-исходным-кодом</replaceable>. Адрес отправителя используется в том случае, если второй аргумент отсутствует. Если <replaceable>пакет-с-исходным-кодом</replaceable> не является корректным пакетом с исходным кодом, вы получите предупреждение. Тем не менее, если это корректный двоичный пакет, систем отслеживания пакетов подпишет вас на соответствующий пакет с исходным кодом.

source: <literal>unsubscribe &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
ru: <literal>unsubscribe &lt;пакет-с-исходным-кодом&gt; [&lt;адрес-электронной-почты&gt;]</literal>

source: Removes a previous subscription to the source package <replaceable>sourcepackage</replaceable> using the specified email address or the sender address if the second argument is left out.
ru: Удаляет предыдущую подписку на пакет с исходным кодом <replaceable>пакет-с-исходным-кодом</replaceable>, используя указанный адрес электронной почты, либо адрес отправителя в случае, если второй аргумент опущен.

source: <literal>unsubscribeall [&lt;email&gt;]</literal>
ru: <literal>unsubscribeall [&lt;адрес-электронной-почты&gt;]</literal>

source: Removes all subscriptions of the specified email address or the sender address if the second argument is left out.
ru: Удаляет все подписки указанного адреса электронной почты, либо адреса отравителя, в случае если второй аргумент опущен.

source: <literal>which [&lt;email&gt;]</literal>
ru: <literal>which [&lt;адрес-электронной-почты&gt;]</literal>

source: Lists all subscriptions for the sender or the email address optionally specified.
ru: Выводит список всех подписок отправителя, либо указанного адреса электронной почты.

source: <literal>keyword [&lt;email&gt;]</literal>
ru: <literal>keyword [&lt;адрес-электронной-почты&gt;]</literal>

source: Tells you the keywords that you are accepting. For an explanation of keywords, <link linkend="pkg-tracking-system">see above</link>. Here's a quick summary:
ru: Сообщает вам то, какие ключевые слова вы принимаете. Объяснение ключевых слов <link linkend="pkg-tracking-system">см. выше</link>. Вот краткое резюме:

source: <literal>bts</literal>: mails coming from the Debian Bug Tracking System
ru: <literal>bts</literal>: почта от системы отслеживания ошибок Debian

source: <literal>bts-control</literal>: reply to mails sent to &email-bts-control;
ru: <literal>bts-control</literal>: ответы на эту почту отправляются на адрес &email-bts-control;

source: <literal>summary</literal>: automatic summary mails about the state of a package
ru: <literal>summary</literal>: автоматическая почта с обобщающей информацией о состоянии пакета

source: <literal>contact</literal>: mails sent to the maintainer through the *@packages.debian.org aliases
ru: <literal>contact</literal>: почта, отправляемая сопровождающему через псевдонимы *@packages.debian.org

source: <literal>cvs</literal>: notification of VCS commits
ru: <literal>cvs</literal>: сообщения о коммитах системы управления версиями

source: <literal>ddtp</literal>: translations of descriptions and debconf templates
ru: <literal>ddtp</literal>: перевод описаний и шаблонов debconf

source: <literal>derivatives</literal>: changes made on the package by derivative distributions
ru: <literal>derivatives</literal>: изменения, внесённые в пакет производными дистрибутивами

source: <literal>derivatives-bugs</literal>: bugs reports and comments from derivative distributions
ru: <literal>derivatives-bugs</literal>: сообщения об ошибках и комментарии из производных дистрибутивов

source: <literal>upload-source</literal>: announce of a new source upload that has been accepted
ru: <literal>upload-source</literal>: анонсирование загрузки нового исходного пакета, который был принят

source: <literal>upload-binary</literal>: announce of a new binary-only upload (porting)
ru: <literal>upload-binary</literal>: анонсирование новой загрузки двоичного пакета (перенос)

source: <literal>buildd</literal>: build failures notifications from build daemons
ru: <literal>buildd</literal>: сообщения об ошибках сборки от служб сборки

source: <literal>default</literal>: all the other mails (those which aren't automatic)
ru: <literal>default</literal>: все остальные сообщения (те, которые не являются автоматическими)

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;]</literal>
ru: <literal>keyword &lt;пакет-с-исходным-кодом&gt; [&lt;адрес-электронной-почты&gt;]</literal>

source: Same as the previous item but for the given source package, since you may select a different set of keywords for each source package.
ru: То же, что и предыдущий пункт, но для данного пакета с исходным кодом, поскольку вы можете выбрать другой набор ключевых слов для каждого пакета с исходным кодом.

source: <literal>keyword [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
ru: <literal>keyword [&lt;адрес-электронной-почты&gt;] {+|-|=} &lt;список-ключевых-слов&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the default set of keywords accepted by a user.
ru: Принимает (+) или отклоняет (-) сообщения, классифицируемые по данным ключевым словам. Определяет список (=) принимаемых ключевых слов. Изменяет набор ключевых слов, по умолчанию принимаемых пользователем.

source: <literal>keywordall [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
ru: <literal>keywordall [&lt;адрес-электронной-почты&gt;] {+|-|=} &lt;список-ключевых-слов&gt;</literal>

source: Accept (+) or refuse (-) mails classified under the given keyword(s). Define the list (=) of accepted keywords. This changes the set of accepted keywords of all the currently active subscriptions of a user.
ru: Принимает (+) или отклоняет (-) сообщения, классифицируемые по данным ключевым словам. Определяет список (=) принимаемых ключевых слов. Изменяет набор принимаемых ключевых слов всех активных в настоящий момент подписок пользователя.

source: <literal>keyword &lt;sourcepackage&gt; [&lt;email&gt;] {+|-|=} &lt;list of keywords&gt;</literal>
ru: <literal>keyword &lt;пакет-с-исходным-кодом&gt; [&lt;адрес-электронной-почты&gt;] {+|-|=} &lt;список-ключевых-слов&gt;</literal>

source: Same as previous item but overrides the keywords list for the indicated source package.
ru: То же, что и предыдущий пункт, но отменяет список ключевых слов для обозначенного пакета с исходным кодом.

source: Stops processing commands. All following lines are ignored by the bot.
ru: Останавливает обработку команд. Все последующие строки будут игнорироваться роботом.

source: The <command>pts-subscribe</command> command-line utility (from the <systemitem role="package">devscripts</systemitem> package) can be handy to temporarily subscribe to some packages, for example after having made an non-maintainer upload.
ru: Утилита командной строки <command>pts-subscribe</command> (из пакета <systemitem role="package">devscripts</systemitem>) может быть полезна для оформления временной подписки на какие-то пакеты, например, после осуществления NMU.

source: Filtering PTS mails
ru: Фильтрация почты системы отслеживания пакетов

source: Once you are subscribed to a package, you will get the mails sent to <literal><replaceable>sourcepackage</replaceable>@&pts-host;</literal>. Those mails have special headers appended to let you filter them in a special mailbox (e.g. with <command>procmail</command>). The added headers are <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> and <literal>X-Unsubscribe</literal>.
ru: После оформления подписки на пакет вы будете получить сообщения, отправляемые на адрес <literal><replaceable>пакет-с-исходным-кодом</replaceable>@&pts-host;</literal>. Эти сообщения имеют специальные заголовки для того, чтобы вы могли отфильтровать их в специальный почтовый ящик (напр. , с помощью <command>procmail</command>). Добавлены следующие заголовки: <literal>X-Loop</literal>, <literal>X-PTS-Package</literal>, <literal>X-PTS-Keyword</literal> и <literal>X-Unsubscribe</literal>.

source: Here is an example of added headers for a source upload notification on the <systemitem role="package">dpkg</systemitem> package:
ru: Ниже приведён пример добавленных заголовков для оповещения о загрузке исходного кода для пакета <systemitem role="package">dpkg</systemitem>:

source: Forwarding VCS commits in the PTS
ru: Пересылка коммитов системы управления версиями в систему отслеживания пакетов
