Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If, for any reason, you aren't able fix an RC bug in a package of yours within 2 weeks (for example due to time constraints, or because it's difficult to fix), you should mention it clearly in the bug report and you should tag the bug <literal>help</literal> to invite other volunteers to chime in. Be aware that RC bugs are frequently the targets of Non-Maintainer Uploads (see <xref linkend="nmu"/>) because they can block the <literal>testing</literal> migration of many packages.
ru: Если по какой-либо причине вы не можете исправить критичную для выпуска ошибку в вашем пакете в течении 2 недель (например, из-за нехватки времени, либо потому, что её очень сложно исправить), вам следует явно указать это в сообщении об ошибке, также вам следует отметить ошибку тегом <literal>help</literal>, который используется для привлечения добровольцев. Учтите, что критичные для выпуска ошибки часто исправляются путём обновления и загрузки пакета теми, кто не является сопровождающим (см. <xref linkend="nmu"/>), поскольку они блокируют переход многих пакетов в <literal>тестируемый</literal> выпуск.

source: Lack of attention to RC bugs is often interpreted by the QA team as a sign that the maintainer has disappeared without properly orphaning their package. The MIA team might also get involved, which could result in your packages being orphaned (see <xref linkend="mia-qa" />).
ru: Отсутствие внимания к критичным для выпуска ошибкам обычно интерпретируется командой контроля качества как знак того, что сопровождающий прекратил свою работу без корректного придания своему пакету статуса осиротевшего пакета. Команда по поиску пропавших (MIA) может подключиться к работе, что может привести к тому, что ваши пакеты получат статус осиротевших пакетов (см. <xref linkend="mia-qa" />).

source: Coordination with upstream developers
ru: Координация с разработчиками основной ветки

source: A big part of your job as Debian maintainer will be to stay in contact with the upstream developers. Debian users will sometimes report bugs that are not specific to Debian to our bug tracking system. You have to forward these bug reports to the upstream developers so that they can be fixed in a future upstream release.
ru: Большая часть вашей работы в качестве сопровождающего Debian будет состоять во взаимодействии с разработчиками основной ветки разработки. Пользователи Debian иногда будут сообщать об ошибках, которые не касаются непосредственно Debian. Вам следует пересылать эти сообщения об ошибках разработчикам основной ветки разработки, чтоб они могли исправить эти ошибки в последующем выпуске основной ветки разработки.

source: While it's not your job to fix non-Debian specific bugs, you may freely do so if you're able. When you make such fixes, be sure to pass them on to the upstream maintainers as well. Debian users and developers will sometimes submit patches to fix upstream bugs — you should evaluate and forward these patches upstream.
ru: Хотя вашей задачей не является исправление ошибок, которые не касаются непосредственно Debian, вы вполне можете делать это, если имеете необходимые знания и навыки. Когда вы вносите такие исправления, обязательно передайте их и сопровождающим основной ветки разработки. Пользователи и разработчики Debian иногда присылают заплаты, исправляющие ошибки основной ветки разработки — вам следует оценить их и переслать в основную ветку разработки.

source: If you need to modify the upstream sources in order to build a policy compliant package, then you should propose a nice fix to the upstream developers which can be included there, so that you won't have to modify the sources of the next upstream version. Whatever changes you need, always try not to fork from the upstream sources.
ru: Если вам необходимо изменить исходный код из основной ветки разработки для того, чтобы собрать пакет, соответствующий правилам, то вам следует предложить своё исправление разработчикам основной ветки, которые может быть включено ими в основную ветку разработки, чтобы вам не пришлось изменять исходный код последующих выпусков основной ветки. Какие бы изменения вы не производили, попытайтесь не создавать ответвлений от основной ветки.

source: If you find that the upstream developers are or become hostile towards Debian or the free software community, you may want to re-consider the need to include the software in Debian. Sometimes the social cost to the Debian community is not worth the benefits the software may bring.
ru: Если вы обнаружите, что разработчики основной ветки враждебны по отношению к Debian или сообществу Свободного ПО, ещё раз подумайте о том, так ли необходимо включать данное ПО в Debian. Иногда социальная стоимость, которую платит сообщество Debian, не покрывается прибылью, которую может принести какое-либо данное ПО.

source: Administrative Duties
ru: Административные обязанности

source: A project of the size of Debian relies on some administrative infrastructure to keep track of everything. As a project member, you have some duties to ensure everything keeps running smoothly.
ru: Проект, имеющий размеры, сопоставимые с Debian, полагается на некоторую административную инфраструктуру для того, чтобы всё можно было отследить. Как у члена проекта у вас будут некоторые обязанности, исполнение которых гарантирует, что всё идёт гладко.

source: Maintaining your Debian information
ru: Сопровождение вашей связанной с Debian информации

source: There's a LDAP database containing information about Debian developers at <ulink url="&url-debian-db;"></ulink>. You should enter your information there and update it as it changes. Most notably, make sure that the address where your debian.org email gets forwarded to is always up to date, as well as the address where you get your debian-private subscription if you choose to subscribe there.
ru: База данных LDAP, содержащая информацию о разработчиках Debian, расположена по адресу <ulink url="&url-debian-db;"></ulink>. Вам следует ввести информацию о себе в эту базу данных и обновлять её по мере изменения. В первую очередь, убедитесь, что адрес электронной почты, на который пересылается ваша почта с ящика на debian.org, актуален, также проверьте ваш адрес, на который оформлена подписка на рассылку debian-private, если вы подписаны на неё.

source: For more information about the database, please see <xref linkend="devel-db"/>.
ru: Дополнительную информацию о базе данных см. <xref linkend="devel-db"/>.

source: Maintaining your public key
ru: Сопровождение вашего публичного ключа

source: Be very careful with your private keys. Do not place them on any public servers or multiuser machines, such as the Debian servers (see <xref linkend="server-machines"/>). Back your keys up; keep a copy offline. Read the documentation that comes with your software; read the <ulink url="&url-pgp-faq;">PGP FAQ</ulink>.
ru: Будьте аккуратны с вашими частными ключами. Не размещайте их на публичных серверах или многопользовательских машинах, таких как серверы Debian (см. <xref linkend="server-machines"/>). Сделайте резервную копию ваших ключей; храните копию автономно. Прочтите документацию, поставляемую с вашим ПО; прочтите <ulink url="&url-pgp-faq;">ЧаВО по PGP</ulink>.

source: You need to ensure not only that your key is secure against being stolen, but also that it is secure against being lost. Generate and make a copy (best also in paper form) of your revocation certificate; this is needed if your key is lost.
ru: Вам следует убедиться в том, что ваш ключ не только защищён от кражи, но также и в том, что он не может быть потерян. Создайте и сделайте копию (лучше всего сделать так же и бумажную копию) вашего сертификата отзыва ключа; он понадобится в случае потери ключа.

source: If you add signatures to your public key, or add user identities, you can update the Debian key ring by sending your key to the key server at <literal>&keyserver-host;</literal>.
ru: Если вы добавили подписи к вашему публичному ключу, либо добавили информацию о пользователе, вы можете обновить брелок Debian, отправив ваш ключ на сервер ключей по адресу <literal>&keyserver-host;</literal>.

source: If you need to add a completely new key or remove an old key, you need to get the new key signed by another developer. If the old key is compromised or invalid, you also have to add the revocation certificate. If there is no real reason for a new key, the Keyring Maintainers might reject the new key. Details can be found at <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.
ru: Если вам необходимо добавить абсолютно новый ключ или удалить старый, вам следует получить подпись на новом ключе от другого разработчика. Если старый ключ скомпрометирован, либо недействителен, вы также следует добавить сертификат отзыва ключа. Если реальных причин для создания нового ключа нет, сопровождающие брелока могут отклонить новый ключ. Подробности могут найдены по адресу <ulink url="http://&keyserver-host;/replacing_keys.html"></ulink>.

source: The same key extraction routines discussed in <xref linkend="registering"/> apply.
ru: Применимы описанные процедуры разворачивания ключа, обсуждаемые в <xref linkend="registering"/>.

source: You can find a more in-depth discussion of Debian key maintenance in the documentation of the <systemitem role="package">debian-keyring</systemitem> package.
ru: Подробную информацию о сопровождении ключей Debian вы можете найти в документации из пакета <systemitem role="package">debian-keyring</systemitem>.

source: Voting
ru: Голосование

source: Even though Debian isn't really a democracy, we use a democratic process to elect our leaders and to approve general resolutions. These procedures are defined by the <ulink url="&url-constitution;">Debian Constitution</ulink>.
ru: Даже несмотря на то, что Проект Debian в действительности не представляет собой демократию, мы используем демократический процесс для выбора лидеров Проекта и утверждения общих решений. Эти процедуры определяются <ulink url="&url-constitution;">Конституцией Проекта Debian</ulink>.

source: Other than the yearly leader election, votes are not routinely held, and they are not undertaken lightly. Each proposal is first discussed on the &email-debian-vote; mailing list and it requires several endorsements before the project secretary starts the voting procedure.
ru: Помимо ежегодных выборов лидера Проекта, голосования не проводятся регулярно, и к ним не относятся легкомысленно. Каждое предложение сначала обсуждается в списке рассылки &email-debian-vote;, требуется некоторое одобрение любого предложения до того, как секретарь Проекта инициирует процедуру голосования.

source: The list of all proposals (past and current) is available on the <ulink url="&url-vote;">Debian Voting Information</ulink> page, along with information on how to make, second and vote on proposals.
ru: Список всех предложений (прошлых и текущих) доступен на странице <ulink url="&url-vote;">Информации о голосованиях Debian</ulink>, там же доступна информация о том, как выдвинуть, поддержать и проголосовать по поводу предложения.

source: Going on vacation gracefully
ru: Вежливый уход на отдых

source: It is common for developers to have periods of absence, whether those are planned vacations or simply being buried in other work. The important thing to notice is that other developers need to know that you're on vacation so that they can do whatever is needed if a problem occurs with your packages or other duties in the project.
ru: Разработчики могут отсутствовать, это нормально, это может быть запланированный отпуск, либо они могут быть загружены другой работой. Важно, чтобы остальные разработчики значил о том, что вы находитесь в отпуске, чтобы они могли сделать то, что нужно, если возникнут проблемы в ваших пакетах, либо от вас требуется выполнение каких-либо других обязанностей в Проекте.

source: Usually this means that other developers are allowed to NMU (see <xref linkend="nmu"/>) your package if a big problem (release critical bug, security update, etc.) occurs while you're on vacation. Sometimes it's nothing as critical as that, but it's still appropriate to let others know that you're unavailable.
ru: Обычно это означает, что другие разработчики могут осуществлять загрузки, не будучи сопровождающими (см. <xref linkend="nmu"/>), в случае если во время вашего отсутствия возникнет какая-либо большая проблема (критичная для выпуска ошибка, обновление безопасности и т. д.). Иногда ничего критичного не происходит, но всё равно лучше предупредить остальных о том, что вы будете недоступны.

source: This is so that the message can be easily filtered by people who don't want to read vacation notices.
ru: Это нужно для того, чтобы те, кто не хочет читать сообщения об отпусках, могли отфильтровать такие сообщения.

source: In order to inform the other developers, there are two things that you should do. First send a mail to <email>debian-private@&lists-host;</email> with [VAC] prepended to the subject of your message<placeholder type="footnote" id="0"/> and state the period of time when you will be on vacation. You can also give some special instructions on what to do if a problem occurs.
ru: Для того, чтобы проинформировать других разработчиков, вам следует сделать две вещи. Во-первых, отправьте сообщение по адресу <email>debian-private@&lists-host;</email> с [VAC] в начале темы сообщения<placeholder type="footnote" id="0"/>, в сообщении укажите промежуток времени, когда вы будете находиться в отпуске. Вы также можете указать какие-либо специальные инструкции по поводу того, что нужно предпринять в случае, если возникнет проблема.

source: The other thing to do is to mark yourself as on vacation in the <link linkend="devel-db">Debian developers' LDAP database</link> (this information is only accessible to Debian developers). Don't forget to remove the on vacation flag when you come back!
ru: Далее, следует отметить себя как находящегося в отпуске в <link linkend="devel-db">базе данных LDAP разработчиков Debian</link> (эта информация доступна только разработчикам Debian). Не забудьте удалить флаг статуса по своему возвращению!

source: Ideally, you should sign up at the <ulink url="&url-gpg-coord;">GPG coordination pages</ulink> when booking a holiday and check if anyone there is looking for signing. This is especially important when people go to exotic places where we don't have any developers yet but where there are people who are interested in applying.
ru: В идеале вам следует зайти на <ulink url="&url-gpg-coord;">координационные страницы GPG</ulink> во время планирования своего отпуска и выяснить, хочет ли кто-либо подписать свой ключ. Это особенно важно, когда люди едут в экзотические места, где у нас пока нет разработчиков, но где есть заинтересованные в участии в Проекте люди.

source: Retiring
ru: Уход на пенсию

source: If you choose to leave the Debian project, you should make sure you do the following steps:
ru: Если вы решили покинуть Проект Debian, вам следует убедиться, что вы выполнили следующие шаги:

source: Orphan all your packages, as described in <xref linkend="orphaning"/>.
ru: Придайте всем ваши пакетам статус осиротевших пакетов как это описано в <xref linkend="orphaning"/>.

source: Send an gpg-signed email about why you are leaving the project to <email>debian-private@&lists-host;</email>.
ru: Вышлите подписанное с помощью gpg электронное письмо о том, почему вы хотите покинуть Проект, по адресу <email>debian-private@&lists-host;</email>.

source: Notify the Debian key ring maintainers that you are leaving by opening a ticket in Debian RT by sending a mail to &email-keyring; with the words 'Debian RT' somewhere in the subject line (case doesn't matter).
ru: Сообщите сопровождающим брелока Debian, чтобы вы выходите из Проекта, открыв запрос в Debian RT путём отправления сообщения на адрес &email-keyring; со словами 'Debian RT' в теме сообщения (регистр не имеет значения).

source: It is important that the above process is followed, because finding inactive developers and orphaning their packages takes significant time and effort.
ru: Важно, чтобы весь приведённый ваше процесс был соблюдён, поскольку поиск неактивных разработчиком и пометка их пакетов как осиротевших занимает значительное количество времени и требует усилий.

source: Returning after retirement
ru: Возвращение после ухода

source: A retired developer's account is marked as "emeritus" when the process in <xref linkend="s3.7"/> is followed, and "disabled" otherwise. Retired developers with an "emeritus" account can get their account re-activated as follows:
ru: Учётная запись вышедшего на пенсию разработчика получает отметку "emeritus", если уход на пенсию выполнен в в соответствии с <xref linkend="s3.7"/>, и "disabled" в противном случае. Вышедшие на пенсию разработчики, имеющие учётную запись с отметкой "emeritus", могут заново активировать свою учётную запись следующим образом:

source: Contact &email-debian-account-manager;.
ru: Свяжитесь с &email-debian-account-manager;.

source: Prove that they still control the GPG key associated with the account, or provide proof of identify on a new GPG key, with at least two signatures from other developers.
ru: Докажите, что вы всё ещё контролируете ключ GPG, ассоциированный с учётной записью, либо предоставьте доказательство того, что новый ключ GPG принадлежит именно вам, вам необходимо как минимум две подписи других разработчиков.

source: Retired developers with a "disabled" account need to go through NM again.
ru: Прошлые разработчики, учётные записи которых были "отключены", должны заново проходить через процесс NM.

source: en
ru: ru

source: Debian Developer's Reference
ru: Справочник разработчика Debian

source: <author> <othername>Developer's Reference Team</othername> &email-devel-ref; </author> <author> <firstname>Andreas</firstname> <surname>Barth</surname> </author> <author> <firstname>Adam</firstname> <surname>Di Carlo</surname> </author> <author> <firstname>Raphaël</firstname> <surname>Hertzog</surname> </author> <author> <firstname>Lucas</firstname> <surname>Nussbaum</surname> </author> <author> <firstname>Christian</firstname> <surname>Schwarz</surname> </author> <author> <firstname>Ian</firstname> <surname>Jackson</surname> </author>
ru: <author> <othername>Команда Справочника разработчика</othername> &email-devel-ref; </author> <author> <firstname>Андреас</firstname> <surname>Барт</surname> </author> <author> <firstname>Адам</firstname> <surname>Ди Карло</surname> </author> <author> <firstname>Рафаэль</firstname> <surname>Герцог</surname> </author> <author> <firstname>Лукас</firstname> <surname>Нуссбаум</surname> </author> <author> <firstname>Кристиан</firstname> <surname>Шварц</surname> </author> <author> <firstname>Иен</firstname> <surname>Джексон</surname> </author>

source: ver. &version;
ru: версия &version;

source: <pubdate>&pubdate;</pubdate> <copyright> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <holder>Andreas Barth</holder> </copyright> <copyright> <year>1998</year> <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <holder>Adam Di Carlo</holder> </copyright> <copyright> <year>2002</year> <year>2003</year> <year>2008</year> <year>2009</year> <holder>Raphaël Hertzog</holder> </copyright> <copyright> <year>2008</year> <year>2009</year> <holder>Lucas Nussbaum</holder> </copyright> <copyright> <year>1997</year> <year>1998</year> <holder>Christian Schwarz</holder> </copyright>
ru: <pubdate>&pubdate;</pubdate> <copyright> <year>2004</year> <year>2005</year> <year>2006</year> <year>2007</year> <holder>Андреас Барт</holder> </copyright> <copyright> <year>1998</year> <year>1999</year> <year>2000</year> <year>2001</year> <year>2002</year> <year>2003</year> <holder>Адам Ди Карло</holder> </copyright> <copyright> <year>2002</year> <year>2003</year> <year>2008</year> <year>2009</year> <holder>Рафаэль Герцог</holder> </copyright> <copyright> <year>2008</year> <year>2009</year> <holder>Лукас Нуссбаум</holder> </copyright> <copyright> <year>1997</year> <year>1998</year> <holder>Кристиан Шварц</holder> </copyright>

source: This manual is free software; you may redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2, or (at your option) any later version.
ru: Данное руководство является Свободным ПО; вы можете распространять его и/или изменять в соответствии с условиями Стандартной общественной лицензии GNU, опубликованной Free Software Foundation; либо версии 2, либо (по вашему усмотрению) любой более поздней версии.

source: This is distributed in the hope that it will be useful, but <emphasis>without any warranty</emphasis>; without even the implied warranty of merchantability or fitness for a particular purpose. See the GNU General Public License for more details.
ru: Руководство распространяется в надежде на то, что оно будет кому-нибудь полезно, но <emphasis>без каких-либо гарантий</emphasis>; даже без гарантии товарного состояния или пригодности её использования в конкретных целях. Для получения более подробной информации ознакомьтесь со Стандартной общественной лицензией GNU.

source: A copy of the GNU General Public License is available as &file-GPL; in the &debian-formal; distribution or on the World Wide Web at <ulink url="&url-gpl;">the GNU web site</ulink>. You can also obtain it by writing to the &fsf-addr;.
ru: Копия Стандартной общественной лицензии GNU доступна в &file-GPL; в дистрибутиве &debian-formal;, либо во Всемирной паутине на <ulink url="&url-gpl;">веб-сайте GNU</ulink>. Также вы можете получить печатную версию, обратившись по адресу &fsf-addr;.

source: If you want to print this reference, you should use the <ulink url="developers-reference.pdf">pdf version</ulink>. This page is also available in <ulink url="index.fr.html">French</ulink>, <ulink url="index.de.html">German</ulink> and <ulink url="index.ja.html">Japanese</ulink>.
ru: Если вы хотите распечатать данное руководство, вам следует использовать <ulink url="developers-reference.pdf">pdf-версию</ulink>. Данная страница также доступна на <ulink url="index.fr.html">французском</ulink>, <ulink url="index.de.html">немецком</ulink> и <ulink url="index.ja.html">японском</ulink> языках.

source: Internationalization and Translations
ru: Интернационализация и переводы

source: Debian supports an ever-increasing number of natural languages. Even if you are a native English speaker and do not speak any other language, it is part of your duty as a maintainer to be aware of issues of internationalization (abbreviated i18n because there are 18 letters between the 'i' and the 'n' in internationalization). Therefore, even if you are ok with English-only programs, you should read most of this chapter.
ru: Debian поддерживает постоянно увеличивающееся число языков. Даже если вашим родным языком является английский, и вы не говорите ни на одном другом языке, как сопровождающий вы должны знать о процессе интернационализации (сокращённо i18n, так как в слове inernationalization между 'i' и 'n' 18 букв). Следовательно, даже если вам вполне подходят программы с интерфейсом на английском языке, вам следует прочесть большую часть этой главы.
