Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Porters may also have an unofficial location where they can put the results of their work during the waiting period. This helps others running the port have the benefit of the porter's work, even during the waiting period. Of course, such locations have no official blessing or status, so buyer beware.
ru: У тех, кто занимается переносом, также имеется неофициальное место, куда они могут поместить результаты своей работы во время периода ожидания. Это помогает остальным, кто занимается переносом, использовать вашу работу даже во время периода ожидания. Конечно, такие места не являются официальными и не имеют какого-либо специального статуса, поэтому будьте внимательны.

source: Porting infrastructure and automation
ru: Инфраструктура переноса и автоматизация

source: There is infrastructure and several tools to help automate package porting. This section contains a brief overview of this automation and porting to these tools; see the package documentation or references for full information.
ru: Имеется специальная инфраструктура и некоторые инструменты, необходимые для автоматизации переноса пакетов. Данный раздел сдержит краткий обзор автоматизации и переноса с помощью данных инструментов; дополнительную информацию см. в документации пакетов или по другим ссылкам.

source: Mailing lists and web pages
ru: Списки рассылки и веб-страницы

source: Web pages containing the status of each port can be found at <ulink url="&url-debian-ports;"></ulink>.
ru: Веб-страницы, содержащие информацию о статусе каждого переноса, можно найти по адресу: <ulink url="&url-debian-ports;"></ulink>.

source: Each port of Debian has a mailing list. The list of porting mailing lists can be found at <ulink url="&url-debian-port-lists;"></ulink>. These lists are used to coordinate porters, and to connect the users of a given port with the porters.
ru: У каждого переноса Debian имеется свой список рассылки. Список списков рассылки различных проектов по переносу может быть найден по адресу: <ulink url="&url-debian-port-lists;"></ulink>. Эти списки рассылки используются для координации работы и связи пользователей с теми, кто работает над переносом.

source: Porter tools
ru: Инструменты переноса

source: Descriptions of several porting tools can be found in <xref linkend="tools-porting"/>.
ru: Описания некоторых инструментов переноса могут быть найдены в разделе <xref linkend="tools-porting"/>.

source: The <systemitem role="package">wanna-build</systemitem> system is used as a distributed, client-server build distribution system. It is usually used in conjunction with build daemons running the <systemitem role="package">buildd</systemitem> program. <literal>Build daemons</literal> are ``slave'' hosts which contact the central <systemitem role="package">wanna-build</systemitem> system to receive a list of packages that need to be built.
ru: Система <systemitem role="package">wanna-build</systemitem> используется как распределённая клиент-серверная система сборки дистрибутива. Обычно она используется вместе со сборочными службами, запускающими программу <systemitem role="package">buildd</systemitem>. <literal>Сборочные службы</literal> являются ``подчинёнными'' узлами, они связываются с центральной системой <systemitem role="package">wanna-build</systemitem> для получения списка пакетов, которые следует собрать.

source: <systemitem role="package">wanna-build</systemitem> is not yet available as a package; however, all Debian porting efforts are using it for automated package building. The tool used to do the actual package builds, <systemitem role="package">sbuild</systemitem> is available as a package, see its description in <xref linkend="sbuild"/>. Please note that the packaged version is not the same as the one used on build daemons, but it is close enough to reproduce problems.
ru: Система <systemitem role="package">wanna-build</systemitem> пока недоступна в виде пакета; тем не менее, она используется для переноса Debian в режиме автоматической сборки пакетов. Инструмент, используемый для создания фактических сборок пакетов, <systemitem role="package">sbuild</systemitem>, доступен в виде пакета, см. его описание в <xref linkend="sbuild"/>. Заметьте, что версия в пакете отличается от той, что используется в сборочных службах, но она достаточно близка к ней и поэтому подходит для воспроизведения проблем.

source: Most of the data produced by <systemitem role="package">wanna-build</systemitem> which is generally useful to porters is available on the web at <ulink url="&url-buildd;"></ulink>. This data includes nightly updated statistics, queueing information and logs for build attempts.
ru: Большая часть данных, создаваемых системой <systemitem role="package">wanna-build</systemitem>, которая обычно бывает полезна для тех, кто занимается переносом, доступна на следующей веб-странице: <ulink url="&url-buildd;"></ulink>. Эта информация включает в себя обновляемую каждую ночь статистику, информацию об очереди и журналы попыток сборки.

source: We are quite proud of this system, since it has so many possible uses. Independent development groups can use the system for different sub-flavors of Debian, which may or may not really be of general interest (for instance, a flavor of Debian built with <command>gcc</command> bounds checking). It will also enable Debian to recompile entire distributions quickly.
ru: Мы очень гордимся этой системой, поскольку у неё так много возможных пользователей. Независимые от разработки группы могут использовать данную систему для подготовки различных вариантов Debian, которые иногда могут быть интересы и более широкому кругу пользователей (например, вариант Debian, собранный с поддержкой проверки связывания средствами <command>gcc</command>). Кроме того, она позволяет довольно быстро заново собрать целый выпуск Debian.

source: The wanna-build team, in charge of the buildds, can be reached at <literal>debian-wb-team@lists.debian.org</literal>. To determine who (wanna-build team, release team) and how (mail, BTS) to contact, refer to <ulink url="&url-wb-team;"></ulink>.
ru: Связаться с командой wanna-build, ответственной за службы buildd, можно по адресу: <literal>debian-wb-team@lists.debian.org</literal>. Для того, чтобы определить, с кем (команда wanna-build, команда выпуска) и как (почта, система отслеживания ошибок) следует связаться в конкретном случае, см. <ulink url="&url-wb-team;"></ulink>.

source: When requesting binNMUs or give-backs (retries after a failed build), please use the format described at <ulink url="&url-release-wb;"/>.
ru: При запросе binNMU или возвратов (повторов после неудачной сборки) используйте описанный в <ulink url="&url-release-wb;"/> формат.

source: When your package is <emphasis>not</emphasis> portable
ru: Если ваш пакет <emphasis>не</emphasis> может быть перенесён

source: Some packages still have issues with building and/or working on some of the architectures supported by Debian, and cannot be ported at all, or not within a reasonable amount of time. An example is a package that is SVGA-specific (only available for <literal>i386</literal> and <literal>amd64</literal>), or uses other hardware-specific features not supported on all architectures.
ru: Некоторые пакеты всё равно имеют проблемы со сборкой и/или с работой на некоторых поддерживаемых Debian архитектурах, они вообще не могут быть перенесены, либо для их переноса требуется слишком много времени. Примером этого является пакет, который конкретно связан с SVGA (доступен только для <literal>i386</literal> и <literal>amd64</literal>), либо использует другие специфические возможности оборудования, которые совсем не поддерживаются на всех архитектурах.

source: In order to prevent broken packages from being uploaded to the archive, and wasting buildd time, you need to do a few things:
ru: Для того, чтобы сломанные пакеты не были загружены в архив и не потратили зря время работы buildd, вам следует выполнить несколько вещей:

source: First, make sure your package <emphasis>does</emphasis> fail to build on architectures that it cannot support. There are a few ways to achieve this. The preferred way is to have a small testsuite during build time that will test the functionality, and fail if it doesn't work. This is a good idea anyway, as this will prevent (some) broken uploads on all architectures, and also will allow the package to build as soon as the required functionality is available.
ru: Во-первых, убедитесь, что ваш пакет <emphasis>действительно</emphasis> не может быть собран на архитектурах, которые он не может поддерживать. Для достижения этого имеется несколько способов. Предпочтительный способ состоит в том, чтобы иметь небольшой тестовый набор для использования во время сборки, который будет проверять функциональность пакета и который будет завершаться неудачей в случае, если пакет не работает. Отличной идеей является и то, что это помешает (некоторым) сломанным загрузкам на все архитектуры, а также позволит пакету собираться сразу как толькотребуемая функциональность будет доступна.

source: Additionally, if you believe the list of supported architectures is pretty constant, you should change <literal>any</literal> to a list of supported architectures in <filename>debian/control</filename>. This way, the build will fail also, and indicate this to a human reader without actually trying.
ru: Кроме того, если вы убеждены, что список поддерживаемых архитектур вполне постоянен, вам следует изменить <literal>any</literal> на список поддерживаемых архитектур в <filename>debian/control</filename>. При этом способе сборка опять же завершиться неудачно, пользователю будет сообщено об этом, даже хотя попытки сборки не было.

source: In order to prevent autobuilders from needlessly trying to build your package, it must be included in <filename>Packages-arch-specific</filename>, a list used by the <command>wanna-build</command> script. The current version is available as <ulink url="&url-buildd-p-a-s;"/>; please see the top of the file for whom to contact for changes.
ru: Для того, чтобы ПО для автоматической сборки не пыталось без необходимости на то собрать ваш пакет, в <filename>Packages-arch-specific</filename> должен быть включён список, используемый сценарием <command>wanna-build</command>. Текущая версия доступна как <ulink url="&url-buildd-p-a-s;"/>; с кем можно связаться по поводу изменений см. в начале файла.

source: Please note that it is insufficient to only add your package to <filename>Packages-arch-specific</filename> without making it fail to build on unsupported architectures: A porter or any other person trying to build your package might accidently upload it without noticing it doesn't work. If in the past some binary packages were uploaded on unsupported architectures, request their removal by filing a bug against <systemitem role="package">ftp.debian.org</systemitem>.
ru: Заметьте, что это недостаточно просто добавить ваш пакет в <filename>Packages-arch-specific</filename> без того, чтобы его сборка на неподдерживаемых архитектурах завершилась неудачно: тот, кто занимается переносом, либо кто-либо другой, пытающиеся собрать ваш пакет, может случайно загрузить его, не заметив, что пакет не работает. Если в прошлом некоторые двоичные пакеты были загружены и для неподдерживаемых архитектур, запросите их удаление, заполнив сообщение об ошибке в <systemitem role="package">ftp.debian.org</systemitem>.

source: Marking non-free packages as auto-buildable
ru: Отмечаем несвободные пакеты как собираемые автоматически (auto-buildable)

source: By default packages from the <literal>non-free</literal> section are not built by the autobuilder network (mostly because the license of the packages could disapprove). To enable a package to be build you need to perform the following steps:
ru: По умолчанию пакеты из раздела <literal>non-free</literal> не собираются сетью автоматической сборки (по большей части из-за того, что это может быть запрещено лицензией пакета). Чтобы разрешить сборку пакета, вам следует предпринять следующие шаги:

source: Check whether it is legally allowed and technically possible to auto-build the package;
ru: Проверьте, законно ли и возможно ли технически автоматически собирать данный пакет;

source: Add <literal>XS-Autobuild: yes</literal> into the header part of <filename>debian/control</filename>;
ru: Добавьте <literal>XS-Autobuild: yes</literal> в заголовок файла <filename>debian/control</filename>;

source: Send an email to &email-nonfree-release; and explain why the package can legitimately and technically be auto-built.
ru: Отправьте сообщение по электронной почте на адрес &email-nonfree-release;, объясните, почему пакет можно собрать как с правовой, так и с технической точки зрения с помощью автоматической сборки.

source: Non-Maintainer Uploads (NMUs)
ru: Загрузки не-сопровождающим (NMU)

source: Every package has one or more maintainers. Normally, these are the people who work on and upload new versions of the package. In some situations, it is useful that other developers can upload a new version as well, for example if they want to fix a bug in a package they don't maintain, when the maintainer needs help to respond to issues. Such uploads are called <emphasis>Non-Maintainer Uploads (NMU)</emphasis>.
ru: Каждый пакет имеет одного или нескольких сопровождающих. Обычно это люди, которые работают над пакетом и выполняют загрузки новых версий. В некоторых ситуациях бывает полезно, если и другие разработчики смогут загрузить новую версию, например, если они хотят исправить ошибку в пакете, сопровождением которого они не занимаются, и если сопровождающий нуждается в помощи для решения проблем с пакетом. Такие загрузки называются <emphasis>загрузки не-сопровождающими, Non-Maintainer Uploads (NMU)</emphasis>.

source: When and how to do an NMU
ru: Когда и как делать NMU

source: Before doing an NMU, consider the following questions:
ru: До выполнения NMU, ответьте на следующие вопросы:

source: Does your NMU really fix bugs? Fixing cosmetic issues or changing the packaging style in NMUs is discouraged.
ru: Действительно ли NMU исправляет ошибки? Исправление косметических проблем или изменению стиля создания пакета не приветствуется для NMU.

source: Did you give enough time to the maintainer? When was the bug reported to the BTS? Being busy for a week or two isn't unusual. Is the bug so severe that it needs to be fixed right now, or can it wait a few more days?
ru: Даёте ли вы достаточное количество времени сопровождающему? Когда в системе отслеживания ошибок было прислано сообщение об ошибке? Человек может быть занят одну или две недели, в этом не ничего необычного. Так ли серьёзная ошибка, что её необходимо исправить прямо сейчас, можно ли подождать ещё несколько дней?

source: How confident are you about your changes? Please remember the Hippocratic Oath: "Above all, do no harm." It is better to leave a package with an open grave bug than applying a non-functional patch, or one that hides the bug instead of resolving it. If you are not 100% sure of what you did, it might be a good idea to seek advice from others. Remember that if you break something in your NMU, many people will be very unhappy about it.
ru: Насколько вы уверены в своих изменениях? Помните клятву Гиппократа: "Не навреди." Лучше оставить пакет даже с самой серьёзной ошибкой, чем применять к нему неработающую заплату, либо заплату, которая скорее скрывает ошибку, а не решает её. Если вы не уверены на 100% в том, что вы делаете, лучше будет попросить совета у других. Помните, что если вы что-то сломаете во время NMU, многие люди будут недовольны.

source: Have you clearly expressed your intention to NMU, at least in the BTS? It is also a good idea to try to contact the maintainer by other means (private email, IRC).
ru: Выразили ли вы ясно ваше намерение сделать NMU, по меньшей мере в системе отслеживания ошибок? Также хорошо бы связаться с сопровождающим с помощью каких-то других средств (частный адрес электронной почты, IRC).

source: If the maintainer is usually active and responsive, have you tried to contact them? In general it should be considered preferable that maintainers take care of an issue themselves and that they are given the chance to review and correct your patch, because they can be expected to be more aware of potential issues which an NMUer might miss. It is often a better use of everyone's time if the maintainer is given an opportunity to upload a fix on their own.
ru: Если сопровождающий обычно активен и отзывчив, попытались ли вы с ним связаться? Вообще же предпочтительно, чтобы сопровождающие самостоятельно решали проблемы в своих пакетах, нужно дать им возможность проверить вашу заплату и при необходимости исправить её, поскольку они скорее всего лучше осведомлены о потенциальных проблемах, которые могут быть упущены в ходе NMU. Часто время каждого используется значительно лучше, если у сопровождающего будет возможность самому загрузить исправление.

source: When doing an NMU, you must first make sure that your intention to NMU is clear. Then, you must send a patch with the differences between the current package and your proposed NMU to the BTS. The <command>nmudiff</command> script in the <systemitem role="package">devscripts</systemitem> package might be helpful.
ru: Если вы выполняете NMU, вам для начала следует убедиться, что ваше намерение сделать NMU ясно и понятно. Затем вам необходимо отправить заплату с различиями между текущим пакетом и предполагаемой NMU в системе отслеживания ошибок. Сценарий <command>nmudiff</command> из пакета <systemitem role="package">devscripts</systemitem> может вам в этом помочь.

source: While preparing the patch, you should better be aware of any package-specific practices that the maintainer might be using. Taking them into account reduces the burden of integrating your changes into the normal package workflow and thus increases the chances that integration will happen. A good place where to look for for possible package-specific practices is <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.
ru: Во время подготовки заплаты вам следует хорошо разобраться с практикой создания данного пакета. Если вы будете это учитывать, что это уменьшит бремя интеграции ваших изменений в обычный ход работы над пакетом и, таким образом, увеличит шансы на то, что ваши изменения будут в дальнейшем интегрированы. О практиках сборки данного пакета можно прочитать в файле <ulink url="&url-debian-policy;ch-source.html#s-readmesource"><filename>debian/README.source</filename></ulink>.

source: Unless you have an excellent reason not to do so, you must then give some time to the maintainer to react (for example, by uploading to the <literal>DELAYED</literal> queue). Here are some recommended values to use for delays:
ru: Если у вас нет каких-либо веских причин не давать сопровождающему время для самостоятельной работы, вам следует дать последнему это время (например, загрузив пакет в очередь <literal>DELAYED</literal>). Для задержек рекомендуется использовать следующие значения:

source: Upload fixing only release-critical bugs older than 7 days, with no maintainer activity on the bug for 7 days and no indication that a fix is in progress: 0 days
ru: Загрузка исправлений критичных для выпуска ошибок, о которых было сообщено более 7 дней назад, сопровождающий не проявлял активности в течении 7 дней, нет никакого указания на то, что исправление находится в стадии подготовки: 0 дней

source: Upload fixing only release-critical bugs older than 7 days: 2 days
ru: Загрузка исправления только критичных для выпуска ошибок, о которых было сообщено более 7 дней назад: 2 дня

source: Upload fixing only release-critical and important bugs: 5 days
ru: Исправление только критичных для выпуска ошибок и важных ошибок: 5 дней

source: Other NMUs: 10 days
ru: Другие NMU: 10 дней

source: Those delays are only examples. In some cases, such as uploads fixing security issues, or fixes for trivial bugs that blocking a transition, it is desirable that the fixed package reaches <literal>unstable</literal> sooner.
ru: Эти задержки являются лишь примерами. В некоторых случаях, таких как загрузка исправлений безопасности, либо исправлений тривиальных ошибок, блокирующий перемещение пакета, желательно, чтобы исправленный пакет попал в <literal>нестабильный выпуск</literal> как можно скорее.

source: Sometimes, release managers decide to allow NMUs with shorter delays for a subset of bugs (e.g release-critical bugs older than 7 days). Also, some maintainers list themselves in the <ulink url="&url-low-threshold-nmu;">Low Threshold NMU list</ulink>, and accept that NMUs are uploaded without delay. But even in those cases, it's still a good idea to give the maintainer a few days to react before you upload, especially if the patch wasn't available in the BTS before, or if you know that the maintainer is generally active.
ru: Иногда управляющие выпуском принимают решение разрешить NMU с более короткими задержками для некоторого подмножества ошибок (напр., для критичных для выпуска ошибок, о которых было сообщено более 7 дней назад). Кроме того, некоторые сопровождающие добавляют себя в <ulink url="&url-low-threshold-nmu;">список NMU с низким порогом</ulink> и разрешают загружать NMU без какой-либо задержки. Но даже в этих случаях лучше всего дать сопровождающему несколько дней на самостоятельную работу и только потом осуществлять загрузку, особенно если заплата ранее не была доступна в системе отслеживания ошибок, либо если вы знаете, что сопровождающий в принципе активен.

source: After you upload an NMU, you are responsible for the possible problems that you might have introduced. You must keep an eye on the package (subscribing to the package on the PTS is a good way to achieve this).
ru: После загрузки NMU вы становитесь ответственным за возможные проблемы, которые вы могли создать. Вам необходимо следить за пакетом (чтобы сделать это, подпишитесь на пакет в систем отслеживания пакетов).

source: This is not a license to perform NMUs thoughtlessly. If you NMU when it is clear that the maintainers are active and would have acknowledged a patch in a timely manner, or if you ignore the recommendations of this document, your upload might be a cause of conflict with the maintainer. You should always be prepared to defend the wisdom of any NMU you perform on its own merits.
ru: Не разрешается бездумно выполнять NMU. Если вы выполняете NMU, и ясно, что сопровождающие активны и приняли бы заплату немного позже, либо если вы игнорируете рекомендации, приведённые в данном документе, ваша загрузка может привести к конфликту с сопровождающим. Вам всегда следует быть готовым к отстаиванию своего решения относительно любой загрузки NMU, которую вы выполняете.

source: NMUs and <filename>debian/changelog</filename>
ru: NMU и файл <filename>debian/changelog</filename>

source: Just like any other (source) upload, NMUs must add an entry to <filename>debian/changelog</filename>, telling what has changed with this upload. The first line of this entry must explicitely mention that this upload is an NMU, e.g.:
ru: Как и во время любой другой загрузки (исходного кода) при выполнении NMU следует добавить запись в файл <filename>debian/changelog</filename>, сообщающую о том, что было изменено в данной загрузке. В первой строке записи должно быть явно указано, что это загрузка NMU, напр.:

source: The way to version NMUs differs for native and non-native packages.
ru: Присваивание версий при выполнении NMU разница для родных и неродных пакетов.
