Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: An upload to the delayed directory keeps the package in <ulink url="http://ftp-master.debian.org/deferred.html">the deferred uploads queue</ulink>. When the specified waiting time is over, the package is moved into the regular incoming directory for processing. This is done through automatic uploading to <literal>&ftp-upload-host;</literal> in upload-directory <literal>DELAYED/<replaceable>X</replaceable>-day</literal> (<replaceable>X</replaceable> between 0 and 15). 0-day is uploaded multiple times per day to <literal>&ftp-upload-host;</literal>.
ru: Загрузка в каталог задержанных пакетов приводит к сохранению пакета в <ulink url="http://ftp-master.debian.org/deferred.html">очереди отложенной загрузки</ulink>. Когда указанное время ожидания истечёт, пакет будет перемещён в обычный каталог входящих пакетов для его обработки. Это производится путём автоматической загрузки на <literal>&ftp-upload-host;</literal> в каталог загрузки <literal>DELAYED/<replaceable>X</replaceable>-дней</literal> (<replaceable>X</replaceable> может быть в интервале от 0 до 15). 0-дней загружается несколько раз в день на <literal>&ftp-upload-host;</literal>.

source: With dput, you can use the <literal>--delayed <replaceable>DELAY</replaceable></literal> parameter to put the package into one of the queues.
ru: Работая с dput, вы можете использовать параметр <literal>--delayed <replaceable>ЗАДЕРЖКА</replaceable></literal>, чтобы поместить пакет в одну из очередей.

source: Security uploads
ru: Загрузки безопасности

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload. For details, please see <xref linkend="bug-security"/>.
ru: <emphasis role="strong">НЕ</emphasis> загружайте пакет в очередь загрузки безопасности (на <literal>security-master.debian.org</literal>) без предварительного разрешения от команды безопасности. Если пакет не соответствует требованиям команды безопасности, он может вызвать множество проблем и задержек во время рассмотрения этой нежелательной загрузки. Подробности см. в <xref linkend="bug-security"/>.

source: Other upload queues
ru: Другие очереди загрузки

source: There is an alternative upload queue in Europe at <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. It operates in the same way as <literal>&ftp-upload-host;</literal>, but should be faster for European developers.
ru: В Европе имеется альтернативная очередь загрузки по адресу <ulink url="ftp://&ftp-eu-upload-host;&upload-queue;"/>. Она работает точно так же как и <literal>&ftp-upload-host;</literal>, но для разработчиков из Европы она может быть более удобной из-за более быстрого доступа.

source: Packages can also be uploaded via ssh to <literal>&ssh-upload-host;</literal>; files should be put <literal>/srv/upload.debian.org/UploadQueue</literal>. This queue does not support <link linkend="delayed-incoming">delayed uploads</link>.
ru: Кроме того, пакеты можно загружать через ssh на <literal>&ssh-upload-host;</literal>; файлы должны быть помещены в <literal>/srv/upload.debian.org/UploadQueue</literal>. Эта очередь не поддерживает <link linkend="delayed-incoming">отложенные загрузки</link>.

source: Notification that a new package has been installed
ru: Уведомление об установке нового пакета

source: The Debian archive maintainers are responsible for handling package uploads. For the most part, uploads are automatically handled on a daily basis by the archive maintenance tools, <command>dak process-upload</command>. Specifically, updates to existing packages to the <literal>unstable</literal> distribution are handled automatically. In other cases, notably new packages, placing the uploaded package into the distribution is handled manually. When uploads are handled manually, the change to the archive may take some time to occur. Please be patient.
ru: Сопровождающие архива Debian ответственны за обработку загрузок пакетов. По большей части загрузки обрабатываются автоматически и ежедневно при помощи специальных инструментов для сопровождения архива, <command>dak process-upload</command>. Говоря более конкретно, обновление существующих пакетов, предназначенные для <literal>нестабильного</literal> выпуска, обрабатываются автоматически. В других случаях (особенно это касается новых пакетов) помещение загруженного пакета в выпуск осуществляется вручную. Если загрузки обрабатываются вручную, изменение архива может потребовать некоторого времени. Пожалуйста, будьте терпеливы.

source: In any case, you will receive an email notification indicating that the package has been added to the archive, which also indicates which bugs will be closed by the upload. Please examine this notification carefully, checking if any bugs you meant to close didn't get triggered.
ru: В любом случае вы получите уведомление по электронной почте о том, что пакет был добавлен в архив, в этом уведомлении также указаны сообщения об ошибках, которые будут закрыты благодаря данной загрузке. Внимательно изучите это уведомление, проверьте, все ли сообщения об ошибках, которые должны быть закрыты, в нём указаны.

source: The installation notification also includes information on what section the package was inserted into. If there is a disparity, you will receive a separate email notifying you of that. Read on below.
ru: Уведомление об установке также включает в себя информацию о том, в какой раздел был добавлен ваш пакет. Если имеет место несоответствие, то вы получите об этом отдельное сообщение. Читайте ниже.

source: Note that if you upload via queues, the queue daemon software will also send you a notification by email.
ru: Заметьте, что если вы загрузили пакет через очереди, служба очередей также отправит вам уведомление по электронной почте.

source: Specifying the package section, subsection and priority
ru: Определение раздела для пакета, подраздела и приоритета

source: The <filename>debian/control</filename> file's <literal>Section</literal> and <literal>Priority</literal> fields do not actually specify where the file will be placed in the archive, nor its priority. In order to retain the overall integrity of the archive, it is the archive maintainers who have control over these fields. The values in the <filename>debian/control</filename> file are actually just hints.
ru: Поля <literal>Section</literal> и <literal>Priority</literal> файла <filename>debian/control</filename> фактически не определяют то, куда в архиве будет помещён ваш пакет, также они не определяют приоритет. Для того, чтобы сохранить общую целостность архива, сопровождающие архива осуществляют контроль над данными полями. Значения в файле <filename>debian/control</filename> в действительности являются лишь подсказками.

source: The archive maintainers keep track of the canonical sections and priorities for packages in the <literal>override file</literal>. If there is a disparity between the <literal>override file</literal> and the package's fields as indicated in <filename>debian/control</filename>, then you will receive an email noting the divergence when the package is installed into the archive. You can either correct your <filename>debian/control</filename> file for your next upload, or else you may wish to make a change in the <literal>override file</literal>.
ru: Сопровождающие архива отслеживаю канонические разделы и приоритеты пакетов с помощью специального <literal>файла замещения</literal>. Если между <literal>файлом замещения</literal> и полями пакета, определёнными в файле <filename>debian/control</filename>, имеет место несоответствие, то вы получите сообщение о расхождении в момент, когда пакет будет установлен в архив. Вы можете либо исправить ваш файл <filename>debian/control</filename> во время следующей загрузки, либо вы можете захотеть изменить <literal>файл замещения</literal>.

source: To alter the actual section that a package is put in, you need to first make sure that the <filename>debian/control</filename> file in your package is accurate. Next, submit a bug against <systemitem role="package">ftp.debian.org</systemitem> requesting that the section or priority for your package be changed from the old section or priority to the new one. Use a Subject like <literal>override: PACKAGE1:section/priority, [...], PACKAGEX:section/priority</literal>, and include the justification for the change in the body of the bug report.
ru: Чтобы изменить раздел, в который был помещён пакет, вам для начала нужно убедиться, что файл <filename>debian/control</filename> в вашем пакете правилен. Далее, отправьте сообщение об ошибке в <systemitem role="package">ftp.debian.org</systemitem> с запросом изменения раздела или приоритета для вашего пакета. Используйте тему сообщения на подобие <literal>override: ПАКЕТ1:раздел/приоритет, [...], ПАКЕТX:раздел/приоритет</literal> и добавьте обоснование данного изменения в теле сообщения об ошибке.

source: For more information about <literal>override files</literal>, see <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> and <ulink url="&url-bts-devel;#maintincorrect"></ulink>.
ru: Дополнительную информацию о <literal>файлах замещения</literal> см. в <citerefentry> <refentrytitle>dpkg-scanpackages</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> и <ulink url="&url-bts-devel;#maintincorrect"></ulink>.

source: Note that the <literal>Section</literal> field describes both the section as well as the subsection, which are described in <xref linkend="archive-sections"/>. If the section is main, it should be omitted. The list of allowable subsections can be found in <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.
ru: Заметьте, что поле <literal>Section</literal> описывает и раздел, и подраздел, которые описываются в <xref linkend="archive-sections"/>. Если раздел имеет значение main (основной), то его указание должно быть опущено. Список разрешённых подразделов может быть найден в <ulink url="&url-debian-policy;ch-archive.html#s-subsections"></ulink>.

source: Handling bugs
ru: Работа с ошибками

source: Every developer has to be able to work with the Debian <ulink url="&url-bts;">bug tracking system</ulink>. This includes knowing how to file bug reports properly (see <xref linkend="submit-bug"/>), how to update them and reorder them, and how to process and close them.
ru: Каждый разработчик должен быть способен работать с <ulink url="&url-bts;">системой отслеживания ошибок</ulink> Debian. Это предполагает знание того, как следует правильно отправлять сообщения об ошибках (см. <xref linkend="submit-bug"/>), как обновлять и упорядочивать их, а также то, как с ними работать и как их закрывать.

source: The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for developers</ulink>. This includes closing bugs, sending followup messages, assigning severities and tags, marking bugs as forwarded, and other issues.
ru: Возможности системы отслеживания ошибок описаны в <ulink url="&url-bts-devel;">документации по системе отслеживания ошибок для разработчиков</ulink>. Она включает в себя описание того, как закрывать сообщения об ошибках, отправлять ответные сообщения, назначать важность и теги, отмечать ошибки как перенаправленные, а также многих других вопросов.

source: Operations such as reassigning bugs to other packages, merging separate bug reports about the same issue, or reopening bugs when they are prematurely closed, are handled using the so-called control mail server. All of the commands available on this server are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>.
ru: Такие операции как переназначение сообщений об ошибках другим пакетам, объединение отдельных сообщений об ошибках в одну проблему, а также повторное открытие ошибок, если они были закрыты прежде времени, осуществляются при помощи так называемого сервера управляющей почты. Все доступные на этом сервере команды описываются в <ulink url="&url-bts-control;">документации по управляющему серверу системы отслеживания ошибок</ulink>.

source: Monitoring bugs
ru: Мониторинг ошибок

source: If you want to be a good maintainer, you should periodically check the <ulink url="&url-bts;">Debian bug tracking system (BTS)</ulink> for your packages. The BTS contains all the open bugs against your packages. You can check them by browsing this page: <literal>http://&bugs-host;/<replaceable>yourlogin</replaceable>@debian.org</literal>.
ru: Если вы хотите быть хорошим сопровождающим, вам следует периодически проверять в <ulink url="&url-bts;">системе отслеживания ошибок Debian (BTS)</ulink> состояние ваших пакетов. Система отслеживания ошибок содержит все открытые сообщения об ошибках в ваших пакетах. Вы можете проверить их путём просмотра следующей страницы: <literal>http://&bugs-host;/<replaceable>ваша-учётная-запись</replaceable>@debian.org</literal>.

source: Maintainers interact with the BTS via email addresses at <literal>&bugs-host;</literal>. Documentation on available commands can be found at <ulink url="&url-bts;"></ulink>, or, if you have installed the <systemitem role="package">doc-debian</systemitem> package, you can look at the local files &file-bts-docs;.
ru: Сопровождающие взаимодействуют с системой отслеживания ошибок через адреса электронной почты <literal>&bugs-host;</literal>. Документация по доступным командам может быть найдена в <ulink url="&url-bts;"></ulink>, либо, если вы установили пакет <systemitem role="package">doc-debian</systemitem>, вы можете посмотреть локальные файлы &file-bts-docs;.

source: Some find it useful to get periodic reports on open bugs. You can add a cron job such as the following if you want to get a weekly email outlining all the open bugs against your packages:
ru: Некоторые разработчики находят полезным получение периодических отчётов об открытых ошибках. Вы можете добавить работу cron подобно следующей, если вы хотите получить еженедельные сообщения с обзором всех открытых сообщений об ошибках в ваших пакетах:

source: # ask for weekly reports of bugs in my packages &cron-bug-report;
ru: # запрашивает еженедельные отчёты об ошибках в моих пакетах &cron-bug-report;

source: Replace <replaceable>address</replaceable> with your official Debian maintainer address.
ru: Замените <replaceable>адрес</replaceable> вашим официальным адресом сопровождающего Debian.

source: Responding to bugs
ru: Ответ на ошибки

source: When responding to bugs, make sure that any discussion you have about bugs is sent both to the original submitter of the bug, and to the bug itself (e.g., <email><replaceable>123</replaceable>@&bugs-host;</email>). If you're writing a new mail and you don't remember the submitter email address, you can use the <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> email to contact the submitter <emphasis>and</emphasis> to record your mail within the bug log (that means you don't need to send a copy of the mail to <email><replaceable>123</replaceable>@&bugs-host;</email>).
ru: Отвечая на сообщения об ошибках, убедитесь, что любое обсуждение сообщения об ошибке отправляется и изначальному автору сообщения об ошибке, и записи в системе отслеживания ошибок (напр., <email><replaceable>123</replaceable>@&bugs-host;</email>). Если вы пишете новое сообщение и не помните адрес электронной почты изначального автора сообщения об ошибке, вы можете использовать адрес <email><replaceable>123</replaceable>-submitter@&bugs-host;</email> для того, чтобы связаться с ним <emphasis>и</emphasis> записать вашу почту в журнал сообщения об ошибке (что означает, что вам не нужно будет отправлять копию письма на адрес <email><replaceable>123</replaceable>@&bugs-host;</email>).

source: If you get a bug which mentions FTBFS, this means Fails to build from source. Porters frequently use this acronym.
ru: Если вы получили сообщение об ошибке, в котором упоминается FTBFS, то это означает Fails to build from source (не удалось собрать из исходного кода). Те, кто занимаются переносами, часто используют данный акроним.

source: Once you've dealt with a bug report (e.g. fixed it), mark it as <literal>done</literal> (close it) by sending an explanation message to <email><replaceable>123</replaceable>-done@&bugs-host;</email>. If you're fixing a bug by changing and uploading the package, you can automate bug closing as described in <xref linkend="upload-bugfix"/>.
ru: Как только вы закончили работать с сообщением об ошибке (напр., исправили ошибку) отметьте его как <literal>завершённое</literal> (закройте его), отправив сообщение с объяснением по адресу <email><replaceable>123</replaceable>-done@&bugs-host;</email>. Если вы исправили ошибку путём изменения и загрузки пакета, вы можете автоматизировать закрытие сообщения об ошибке как это описано в <xref linkend="upload-bugfix"/>.

source: You should <emphasis>never</emphasis> close bugs via the bug server <literal>close</literal> command sent to &email-bts-control;. If you do so, the original submitter will not receive any information about why the bug was closed.
ru: Вам <emphasis>никогда</emphasis> не следует закрывать ошибки через отправку команды <literal>close</literal> для сервера ошибок по адресу &email-bts-control;. Если вы так сделаете, то изначальный автор сообщения об ошибке не получит какой-либо информации о том, почему сообщение об ошибке было закрыта.

source: As a package maintainer, you will often find bugs in other packages or have bugs reported against your packages which are actually bugs in other packages. The bug tracking system's features are described in the <ulink url="&url-bts-devel;">BTS documentation for Debian developers</ulink>. Operations such as reassigning, merging, and tagging bug reports are described in the <ulink url="&url-bts-control;">BTS control server documentation</ulink>. This section contains some guidelines for managing your own bugs, based on the collective Debian developer experience.
ru: Как сопровождающий пакетов вы часто будете находить ошибки в других пакетах, иногда вы будете получать сообщения об ошибках в ваших пакетах, которые в действительности касаются ошибок в других пакетах. Возможности системы отслеживания ошибок описываются в <ulink url="&url-bts-devel;">документации по системе отслеживания ошибок для разработчиков Debian</ulink>. Такие операции как переназначение, объединение и отметка тегами сообщений об ошибках описываются в <ulink url="&url-bts-control;">документации по управляющему серверу системы отслеживания ошибок</ulink>. Данный раздел содержит некоторые рекомендации по управлению сообщениями об ошибках в ваших собственных пакетах, эти рекомендации основываются на коллективном опыте разработчиков Debian.

source: Filing bugs for problems that you find in other packages is one of the civic obligations of maintainership, see <xref linkend="submit-bug"/> for details. However, handling the bugs in your own packages is even more important.
ru: Отправка сообщений об ошибках по поводу проблем, которые вы найдёте в других пакетах, является одной из гражданских обязанностей сопровождающего, см. <xref linkend="submit-bug"/> для получения дополнительной информации. Тем не менее, работа с ошибками в ваших собственных пакетах ещё более важна.

source: Here's a list of steps that you may follow to handle a bug report:
ru: Ниже приведена последовательность шагов, которой можно следовать при работе с сообщением об ошибке:

source: Decide whether the report corresponds to a real bug or not. Sometimes users are just calling a program in the wrong way because they haven't read the documentation. If you diagnose this, just close the bug with enough information to let the user correct their problem (give pointers to the good documentation and so on). If the same report comes up again and again you may ask yourself if the documentation is good enough or if the program shouldn't detect its misuse in order to give an informative error message. This is an issue that may need to be brought up with the upstream author.
ru: Решите, соответствует присланный отчёт реальной ошибке или нет. Иногда пользователи всего лишь неправильно запускают программу, поскольку они не прочли документацию. Если вы это обнаружите, то просто закройте сообщение об ошибке, предоставив достаточное количество информации, которая позволит пользователю исправить свою проблему (вышлите ссылки на хорошую документацию и так далее). Если вы снова получите то же сообщение об ошибке, задайте себе вопрос, достаточно ли хороша документация, или может быть программа не может обнаружить случаи неправильного использования и выдать информативное сообщение об ошибке. Об этой проблеме следует сообщить автору основной ветки разработки.

source: If the bug submitter disagrees with your decision to close the bug, they may reopen it until you find an agreement on how to handle it. If you don't find any, you may want to tag the bug <literal>wontfix</literal> to let people know that the bug exists but that it won't be corrected. If this situation is unacceptable, you (or the submitter) may want to require a decision of the technical committee by reassigning the bug to <systemitem role="package">tech-ctte</systemitem> (you may use the clone command of the BTS if you wish to keep it reported against your package). Before doing so, please read the <ulink url="&url-tech-ctte;">recommended procedure</ulink>.
ru: Если тот, кто отправил сообщение об ошибке, не согласен с вашим решением о закрытии сообщения об ошибке, то он может заново открывать его до тех пор, пока вы не придёте к согласию о том, что делать. Если вы не сможете найти общего решения, тогда вы можете отметить ошибку тегом <literal>wontfix</literal>, чтобы люди знали, что ошибка существует, но что она не будет исправлена. Если эта ситуация не приемлема, вы (или тот, кто отправил сообщение об ошибке) можете потребовать решение проблемы от технического комитета, переназначив сообщение об ошибке <systemitem role="package">tech-ctte</systemitem> (вы можете использовать команду clone, если вы хотите, чтобы сообщение об ошибке осталось сообщением об ошибке в вашем пакете). До того, как сделать это, прочтите информацию о <ulink url="&url-tech-ctte;">рекомендуемой процедуре</ulink>.
