Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Some tools (e.g. <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem>, or the <systemitem role="package">translate-toolkit</systemitem>) are specialized in extracting the translatable material from different formats. They produce PO files, a format quite common to translators, which permits to see what needs to be retranslated when the translated document is updated.
ru: Некоторые инструменты (напр., <systemitem role="package">po4a</systemitem>, <systemitem role="package">poxml</systemitem> или <systemitem role="package">translate-toolkit</systemitem>) специализируются на извлечении переводимой информации из различных форматов. Они создают файлы PO, этот формат довольно хорошо знаком переводчикам, он позволяет видеть то, что следует перевести заново, если переведённый документ был обновлён.

source: Common packaging situations
ru: Общие ситуации при создании пакетов

source: Packages using <command>autoconf</command>/<command>automake</command>
ru: Пакеты, использующие <command>autoconf</command>/<command>automake</command>

source: Keeping <command>autoconf</command>'s <filename>config.sub</filename> and <filename>config.guess</filename> files up to date is critical for porters, especially on more volatile architectures. Some very good packaging practices for any package using <command>autoconf</command> and/or <command>automake</command> have been synthesized in &file-bpp-autotools; from the <systemitem role="package">autotools-dev</systemitem> package. You're strongly encouraged to read this file and to follow the given recommendations.
ru: Поддержка файлов <command>autoconf</command> <filename>config.sub</filename> и <filename>config.guess</filename> в актуальном состоянии является критической задачей для тех, кто занимается переносом, особенно на более волатильные архитектуры. Некоторые очень хорошие практики по созданию пакетов для любого пакета, использующего <command>autoconf</command> и/или <command>automake</command> были синтезированы в &file-bpp-autotools; из пакета <systemitem role="package">autotools-dev</systemitem> package. Настойчиво рекомендуем прочитать этот файл и следовать приведённым в нём рекомендациям.

source: Libraries
ru: Библиотеки

source: Libraries are always difficult to package for various reasons. The policy imposes many constraints to ease their maintenance and to make sure upgrades are as simple as possible when a new upstream version comes out. Breakage in a library can result in dozens of dependent packages breaking.
ru: По ряду причина для библиотек всегда трудно создавать пакеты. Политика налагает множество ограничений для облегчения из сопровождения и для того, чтобы гарантировать, что обновления будут настолько просты, насколько это возможно, когда выходит новая версия из основной ветки разработки. Поломка в библиотеке может вызвать поломку множества зависимых пакетов.

source: Good practices for library packaging have been grouped in <ulink url="&url-libpkg-guide;">the library packaging guide</ulink>.
ru: Хорошие практики по созданию пакетов для библиотек были сгруппированы в <ulink url="&url-libpkg-guide;">справочнику по созданию пакетов библиотек</ulink>.

source: Documentation
ru: Документация

source: Be sure to follow the <ulink url="&url-debian-policy;ch-docs.html">Policy on documentation</ulink>.
ru: Обязательно пройдите по ссылке <ulink url="&url-debian-policy;ch-docs.html">Политика документации</ulink>.

source: If your package contains documentation built from XML or SGML, we recommend you not ship the XML or SGML source in the binary package(s). If users want the source of the documentation, they should retrieve the source package.
ru: Если ваш пакет содержит документацию, собираемую из XML или SGML, рекомендуем вам не добавлять исходный код в форматах XML или SGML в двоичный пакет (-ы). Если пользователи захотят получить исходный код документации, им следует загрузить пакет с исходным кодом.

source: Major shipped manuals should register themselves with <systemitem role="package">doc-base</systemitem> on installation. See the <systemitem role="package">doc-base</systemitem> package documentation for more information.
ru: Крупные руководства должны при установке регистрироваться в <systemitem role="package">doc-base</systemitem>. Дополнительную информацию см. в документации пакета <systemitem role="package">doc-base</systemitem>.

source: Debian policy (section 12.1) directs that manual pages should accompany every program, utility, and function, and suggests them for other objects like configuration files. If the work you are packaging does not have such manual pages, consider writing them for inclusion in your package, and submitting them upstream.
ru: Политика Debian (раздел 12.1) указывает, что справочные страницы должны поставляться со всякой программой, утилитой и функцией, и предлагает поставку справочных страниц для других объектов, таких как файлы настройки. Если та работа, для которой вы создаёте пакеты, не имеет таких справочных страниц, постарайтесь написать их самостоятельно для включения в ваш пакет и отправки в основную ветку разработки.

source: The manpages do not need to be written directly in the troff format. Popular source formats are Docbook, POD and reST, which can be converted using <command>xsltproc</command>, <command>pod2man</command> and <command>rst2man</command> respectively. To a lesser extent, the <command>help2man</command> program can also be used to write a stub.
ru: Справочные страницы не должны быть написаны непосредственно в формате troff. Популярными исходными форматами являются Docbook, POD и reST, которые могут быть конвертированы с помощью <command>xsltproc</command>, <command>pod2man</command> и <command>rst2man</command> соответственно. В меньшей степени для написания заглушки может использоваться программа <command>help2man</command>.

source: Specific types of packages
ru: Конкретные типы пакетов

source: Several specific types of packages have special sub-policies and corresponding packaging rules and practices:
ru: Некоторые конкретные типы пакетов имеют свои специальные подполитики и соответствующие правила и практики создания пакетов:

source: Perl related packages have a <ulink url="&url-perl-policy;">Perl policy</ulink>, some examples of packages following that policy are <systemitem role="package">libdbd-pg-perl</systemitem> (binary perl module) or <systemitem role="package">libmldbm-perl</systemitem> (arch independent perl module).
ru: Пакеты, связанные с Perl, имеют <ulink url="&url-perl-policy;">Политику Perl</ulink>, некоторые примеры пакетов, следующих этой политике: <systemitem role="package">libdbd-pg-perl</systemitem> (двоичный модуль perl) или <systemitem role="package">libmldbm-perl</systemitem> (зависящий от архитектуры модуль perl).

source: Python related packages have their python policy; see &file-python-policy; in the <systemitem role="package">python</systemitem> package.
ru: Связанные с Python пакеты имеют свою Политику Python; см. &file-python-policy; в пакете <systemitem role="package">python</systemitem>.

source: Emacs related packages have the <ulink url="&url-emacs-policy;">emacs policy</ulink>.
ru: Связанные с Emacs пакеты имеют <ulink url="&url-emacs-policy;">Политику Emacs</ulink>.

source: Java related packages have their <ulink url="&url-java-policy;">java policy</ulink>.
ru: Связанные с Java пакеты имеют свою <ulink url="&url-java-policy;">Политику Java</ulink>.

source: Ocaml related packages have their own policy, found in &file-ocaml-policy; from the <systemitem role="package">ocaml</systemitem> package. A good example is the <systemitem role="package">camlzip</systemitem> source package.
ru: Связанные с Ocaml имеют свою собственную политику, см. в &file-ocaml-policy; из пакета <systemitem role="package">ocaml</systemitem>. Хорошим примером является пакет с исходным кодом <systemitem role="package">camlzip</systemitem>.

source: Packages providing XML or SGML DTDs should conform to the recommendations found in the <systemitem role="package">sgml-base-doc</systemitem> package.
ru: Пакеты, предоставляющие XML или SGML DTD должны соответствовать рекомендациям из пакета <systemitem role="package">sgml-base-doc</systemitem>.

source: Lisp packages should register themselves with <systemitem role="package">common-lisp-controller</systemitem>, about which see &file-lisp-controller;.
ru: Пакеты Lisp должны регистрироваться в <systemitem role="package">common-lisp-controller</systemitem>, об этом см. &file-lisp-controller;.

source: Architecture-independent data
ru: Независящие от архитектуры данные

source: It is not uncommon to have a large amount of architecture-independent data packaged with a program. For example, audio files, a collection of icons, wallpaper patterns, or other graphic files. If the size of this data is negligible compared to the size of the rest of the package, it's probably best to keep it all in a single package.
ru: Добавление большого количества независящих от архитектуры данных в пакеты с программами не является в каком бы то ни было смысле необычным явлением при создании пакетов. Например, аудио файлы, наборы иконок, шаблоны обоев рабочего стола или другие графические файлы. Если размер этих данных незначителен по сравнению с размером остального пакета, возможно лучшим решением будет сохранение всех данных в одном пакете.

source: However, if the size of the data is considerable, consider splitting it out into a separate, architecture-independent package (<filename>_all.deb</filename>). By doing this, you avoid needless duplication of the same data into eleven or more .debs, one per each architecture. While this adds some extra overhead into the <filename>Packages</filename> files, it saves a lot of disk space on Debian mirrors. Separating out architecture-independent data also reduces processing time of <command>lintian</command> (see <xref linkend="tools-lint"/>) when run over the entire Debian archive.
ru: Тем не менее, если размер данных значителен, постарайтесь выделить их в отдельный независящий от архитектуры пакет (<filename>_all.deb</filename>). Делая это, вы избежите ненужного дублирования одних и тех же данных в одиннадцати или более файлах .debs, по одному на каждую архитектуру. Хотя это добавляет некоторую дополнительную информацию в файлы <filename>Packages</filename>, это сохраняет большое количество места на зеркалах Debian. Выделение независящих от архитектуры данных также снижает время обработки <command>lintian</command> (см. <xref linkend="tools-lint"/>) при проверке всего архива Debian.

source: Needing a certain locale during build
ru: Необходимость в конкретной локали во время сборки

source: If you need a certain locale during build, you can create a temporary file via this trick:
ru: Если вам требуется определённая локаль во время сборки, вы можете создать временный файл с помощью следующих команд:

source: If you set <varname>LOCPATH</varname> to the equivalent of <filename>/usr/lib/locale</filename>, and <varname>LC_ALL</varname> to the name of the locale you generate, you should get what you want without being root. Something like this:
ru: Если вы установите <varname>LOCPATH</varname> значение, эквивалентное <filename>/usr/lib/locale</filename>, а значение <varname>LC_ALL</varname> будет имя той локали, которую вы создаёте, у вас будет то, что вам нужно при работе из-за учётной записи суперпользователя. Что-то вроде этого:

source: LOCALE_PATH=debian/tmpdir/usr/lib/locale LOCALE_NAME=en_IN LOCALE_CHARSET=UTF-8 mkdir -p $LOCALE_PATH localedef -i $LOCALE_NAME.$LOCALE_CHARSET -f $LOCALE_CHARSET $LOCALE_PATH/$LOCALE_NAME.$LOCALE_CHARSET # Using the locale LOCPATH=$LOCALE_PATH LC_ALL=$LOCALE_NAME.$LOCALE_CHARSET date
ru: LOCALE_PATH=debian/tmpdir/usr/lib/locale LOCALE_NAME=en_IN LOCALE_CHARSET=UTF-8 mkdir -p $LOCALE_PATH localedef -i $LOCALE_NAME.$LOCALE_CHARSET -f $LOCALE_CHARSET $LOCALE_PATH/$LOCALE_NAME.$LOCALE_CHARSET # Используйте локаль LOCPATH=$LOCALE_PATH LC_ALL=$LOCALE_NAME.$LOCALE_CHARSET date

source: Make transition packages deborphan compliant
ru: Делаем так, чтобы deborphan определят переходные пакеты

source: Deborphan is a program for helping users to detect which packages can safely be removed from the system, i.e. the ones that have no packages depending on them. The default operation is to search only within the libs and oldlibs sections, to hunt down unused libraries. But when passed the right argument, it tries to catch other useless packages.
ru: deborphan &mdash; программам, помогающая пользователям определить то, какие пакеты могут быть безопасно удалены из системы, т. е. те, от которых не зависит более ни один пакет. По умолчанию поиск осуществляется только в разделах libs и oldlibs для обнаружения неиспользуемых библиотек. Но когда вы передали этой программе необходимых аргумент, она пытается найти все бесполезные пакеты.

source: For example, with <literal>--guess-dummy</literal>, <command>deborphan</command> tries to search all transitional packages which were needed for upgrade but which can now safely be removed. For that, it looks for the string dummy or transitional in their short description.
ru: Например, с аргументом <literal>--guess-dummy</literal>, <command>deborphan</command> пытается найти все переходные пакеты, которые нужны для обновления, но которые теперь могут быть легко удалены. Для этого она ищет строку dummy или transitional в их кратком описании.

source: So, when you are creating such a package, please make sure to add this text to your short description. If you are looking for examples, just run: <command>apt-cache search .|grep dummy</command> or <command>apt-cache search .|grep transitional</command>.
ru: Поэтому когда вы создаёте такой пакет, убедитесь, что этот текст добавлен в ваше краткое описание. Если вы хотите ознакомиться с примерами, запустите: <command>apt-cache search .|grep dummy</command> или <command>apt-cache search .|grep transitional</command>.

source: Also, it is recommended to adjust its section to <literal>oldlibs</literal> and its priority to <literal>extra</literal> in order to ease <command>deborphan</command>'s job.
ru: Кроме того, рекомендуется установить раздел в значение <literal>oldlibs</literal>, а приоритет в значение <literal>extra</literal> для того, чтобы упростить работу <command>deborphan</command>.

source: Best practices for <filename>.orig.tar.{gz,bz2,xz}</filename> files
ru: Лучшие практики для файлов <filename>.orig.tar.{gz,bz2,xz}</filename>

source: There are two kinds of original source tarballs: Pristine source and repackaged upstream source.
ru: Существует два вида оригинальных tar-архивов с исходным кодом: чистый исходный код и запакованный заново исходный код основной ветки разработки.

source: Pristine source
ru: Чистый исходный код

source: We cannot prevent upstream authors from changing the tarball they distribute without also incrementing the version number, so there can be no guarantee that a pristine tarball is identical to what upstream <emphasis>currently</emphasis> distributing at any point in time. All that can be expected is that it is identical to something that upstream once <emphasis>did</emphasis> distribute. If a difference arises later (say, if upstream notice that they weren't using maximal compression in their original distribution and then re-<command>gzip</command> it), that's just too bad. Since there is no good way to upload a new <filename>.orig.tar.{gz,bz2,xz}</filename> for the same version, there is not even any point in treating this situation as a bug.
ru: Мы не можем запретить авторам основной ветки разработки изменять tar-архив, поставляемый ими, без одновременного изменения номера версии, поэтому не может быть никаких гарантий, что чистый исходный код идентичен тому, что поставляется основной веткой разработки <emphasis>в данный момент</emphasis>. Всё, что можно ожидать, состоит в том, что он идентичен чему-то, кто когда-то <emphasis>распространялось</emphasis> основной веткой разработки. Если позже обнаруживается разница (например, если основная ветка разработки извещает о том, что они не использовали максимальное сжатие для своих оригинальных файлов и затем заново сжали их с помощью <command>gzip</command>), это просто очень плохо. Поскольку нет какого-либо хорошего способа загрузить новый файл <filename>.orig.tar.{gz,bz2,xz}</filename> для той же версии, то нет и оснований считать эту ситуацию ошибкой.

source: The defining characteristic of a pristine source tarball is that the <filename>.orig.tar.{gz,bz2,xz}</filename> file is byte-for-byte identical to a tarball officially distributed by the upstream author.<placeholder type="footnote" id="0"/> This makes it possible to use checksums to easily verify that all changes between Debian's version and upstream's are contained in the Debian diff. Also, if the original source is huge, upstream authors and others who already have the upstream tarball can save download time if they want to inspect your packaging in detail.
ru: Определяющей характеристикой чистого tar-архива с исходным кодом является то, что файл <filename>.orig.tar.{gz,bz2,xz}</filename> по-байтово идентичен tar-архиву, который официальной распространялся автором основной ветки разработки.<placeholder type="footnote" id="0"/> Это позволяет использовать контрольные суммы для простой проверки, что все изменения между версией Debian и версией основной ветки содержаться в db=iff-файле Debian. Кроме того, если оригинальный исходный код имеет большой размер, авторы основной ветки разработки и другие, кто уже имеют tar-архив из основной ветки, могут сохранить время, затрачиваемое на скачивание, в том случае, если они хотят подробно проверить ваш пакет.

source: There is no universally accepted guidelines that upstream authors follow regarding to the directory structure inside their tarball, but <command>dpkg-source</command> is nevertheless able to deal with most upstream tarballs as pristine source. Its strategy is equivalent to the following:
ru: Нет никаких универсально принимаемых рекомендаций, которым бы следовали авторы основной ветки разработки, по поводу структуры каталогов в tar-архивах, но <command>dpkg-source</command> может, тем не менее, обрабатывать большинство tar-архивов основных веток разработки как чистый исходный код. Его стратегия эквивалентна следующему:

source: It unpacks the tarball in an empty temporary directory by doing
ru: Он распаковывает tar-архив в пустой временный каталог, выполняя

source: zcat path/to/<replaceable>packagename</replaceable>_<replaceable>upstream-version</replaceable>.orig.tar.gz | tar xf -
ru: zcat путь/к/<replaceable>имя-пакета</replaceable>_<replaceable>версия-основной-ветки</replaceable>.orig.tar.gz | tar xf -

source: If, after this, the temporary directory contains nothing but one directory and no other files, <command>dpkg-source</command> renames that directory to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>. The name of the top-level directory in the tarball does not matter, and is forgotten.
ru: Если после этого временный каталог не содержит ничего кроме одного каталога и не содержит других файлов, <command>dpkg-source</command> переименовывает этот каталог в <filename><replaceable>имяпакета</replaceable>-<replaceable>версия-основной-ветки</replaceable>(.orig)</filename>. Имя каталога верхнего уровня в tar-архиве не имеет значения и просто забывается.

source: Otherwise, the upstream tarball must have been packaged without a common top-level directory (shame on the upstream author!). In this case, <command>dpkg-source</command> renames the temporary directory <emphasis>itself</emphasis> to <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>(.orig)</filename>.
ru: В противном случае, tar-архив основной ветки должен быть запакован без общего каталога верхнего уровня (позор автору основной ветки!). В этом случае <command>dpkg-source</command> переименовывает <emphasis>самостоятельно</emphasis> временный каталог в <filename><replaceable>имяпакета</replaceable>-<replaceable>версия-основной-ветки</replaceable>(.orig)</filename>.

source: Repackaged upstream source
ru: Повторная упаковка исходного кода основной ветки

source: You <emphasis role="strong">should</emphasis> upload packages with a pristine source tarball if possible, but there are various reasons why it might not be possible. This is the case if upstream does not distribute the source as gzipped tar at all, or if upstream's tarball contains non-DFSG-free material that you must remove before uploading.
ru: Вы <emphasis role="strong">должны</emphasis> загружать пакеты с чистым исходным кодом, если это возможно, но имеются причины, по которым это может быть невозможно. Это имеет место, когда основная ветка вообще не поставляет исходный код в виде сжатого при помощи gzip tar-архива, либо если tar-архив основной ветки содержит не свободный в соответствии с критериями DFSG материал, который вам следует удалить до момента осуществления загрузки.

source: In these cases the developer must construct a suitable <filename>.orig.tar.{gz,bz2,xz}</filename> file themselves. We refer to such a tarball as a repackaged upstream source. Note that a repackaged upstream source is different from a Debian-native package. A repackaged source still comes with Debian-specific changes in a separate <filename>.diff.gz</filename> or <filename>.debian.tar.{gz,bz2,xz}</filename> and still has a version number composed of <replaceable>upstream-version</replaceable> and <replaceable>debian-version</replaceable>.
ru: В этих случаях разработчик должен создать подходящий файл <filename>.orig.tar.{gz,bz2,xz}</filename> самостоятельно. Мы говорим о таком tar-архиве как о запакованном заново исходном коде основной ветки. Заметьте, что запакованный заново исходный код основной ветки отличается от родного пакета Debian. Запакованный заново исходный код содержит специфичные для Debian изменения в отдельных файлах <filename>.diff.gz</filename> или <filename>.debian.tar.{gz,bz2,xz}</filename> и всё ещё имеет номер версии, составленный из <replaceable>версия-основной-ветки</replaceable> и <replaceable>версия-debian</replaceable>.

source: There may be cases where it is desirable to repackage the source even though upstream distributes a <filename>.tar.{gz,bz2,xz}</filename> that could in principle be used in its pristine form. The most obvious is if <emphasis>significant</emphasis> space savings can be achieved by recompressing the tar archive or by removing genuinely useless cruft from the upstream archive. Use your own discretion here, but be prepared to defend your decision if you repackage source that could have been pristine.
ru: Возможны такие случаи, когда желательно запаковать исходный код заново, даже несмотря на то, что основная ветка разработки поставляет <filename>.tar.{gz,bz2,xz}</filename>, который в принципе может использовать в его чистой форме. Наиболее очевидным случаем является ситуация, когда может быть достигнута <emphasis>значительная</emphasis> экономия места путём повторной упаковки tar-архива или путём удаления действительно ненужного хлама из архива основной ветки. Используйте это на своё усмотрение, но будьте готовы защищать своё решение, если вы запаковали заново исходный код, которые мог бы быть чистым.

source: A repackaged <filename>.orig.tar.{gz,bz2,xz}</filename>
ru: Запакованный заново <filename>.orig.tar.{gz,bz2,xz}</filename>
