Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: They must be in sync on all architectures and mustn't have dependencies that make them uninstallable; they also have to have generally no known release-critical bugs at the time they're installed into <literal>testing</literal>. This way, <literal>testing</literal> should always be close to being a release candidate. Please see below for details.
ru: На всех архитектурах должна быть доступна одна и та же версия пакета, у пакета не должно быть зависимостей, которые помешают установить этот пакет; также они не должны иметь на момент установки в <literal>тестируемый</literal> выпуск известных критичных для выпуска ошибок. Таким образом, <literal>тестируемый</literal> выпуск всегда должен быть близок кандидату на выпуск. Подробности см. ниже.

source: Updates from unstable
ru: Обновления из нестабильного выпуска

source: The scripts that update the <literal>testing</literal> distribution are run twice each day, right after the installation of the updated packages; these scripts are called <literal>britney</literal>. They generate the <filename>Packages</filename> files for the <literal>testing</literal> distribution, but they do so in an intelligent manner; they try to avoid any inconsistency and to use only non-buggy packages.
ru: Сценарии, обновляющие <literal>тестируемый</literal> выпуск, запускаются дважды каждый день, сразу же после установки обновлённых пакетов; эти сценарии имеют имя <literal>britney</literal>. Они создают файлы <filename>Packages</filename> для <literal>тестируемого</literal> выпуска, но делают они это разумным способом; они пытаются избежать противоречивости и использовать только те пакеты, которые не имеют ошибок.

source: The inclusion of a package from <literal>unstable</literal> is conditional on the following:
ru: Включение пакета из <literal>нестабильного</literal> выпуска выполняется в соответствии со следующими условиями:

source: The package must have been available in <literal>unstable</literal> for 2, 5 or 10 days, depending on the urgency (high, medium or low). Please note that the urgency is sticky, meaning that the highest urgency uploaded since the previous <literal>testing</literal> transition is taken into account;
ru: Пакет должен быть доступен в <literal>нестабильном</literal> выпуске в течении 2, 5 или 10 дней в зависимости от его срочности (высокая, средняя или низкая). Заметьте, что учитывается также и срочность прошлых загрузок, точнее учитывается наивысшая срочность загрузки с момента последнего перехода пакета в <literal>тестируемый</literal> выпуск;

source: It must not have new release-critical bugs (RC bugs affecting the version available in <literal>unstable</literal>, but not affecting the version in <literal>testing</literal>);
ru: Пакет не должен иметь новых ошибок, критичных для выпуска (то есть, критичных для выпуска ошибок в версии пакета, доступной в <literal>нестабильном</literal> выпуске, но отсутствующих в версии из <literal>тестируемого</literal> выпуска);

source: It must be available on all architectures on which it has previously been built in <literal>unstable</literal>. <link linkend="dak-ls">dak ls</link> may be of interest to check that information;
ru: Пакет должен быть доступен на всех архитектурах, на которых он ранее был собран в <literal>нестабильном</literal> выпуске. <link linkend="dak-ls">dak ls</link> может помочь проверить эту информацию;

source: It must not break any dependency of a package which is already available in <literal>testing</literal>;
ru: Пакет не должен ломать зависимости какого-либо уже доступного в <literal>тестируемом</literal> выпуске пакета;

source: The packages on which it depends must either be available in <literal>testing</literal> or they must be accepted into <literal>testing</literal> at the same time (and they will be if they fulfill all the necessary criteria);
ru: Пакеты, от которых зависит данный пакет, должны либо быть доступны в <literal>тестируемом</literal> выпуске, либо должны быть приняты в <literal>тестируемый</literal> выпуск одновременно с этим пакетом (эти пакеты будут приняты в случае, если они удовлетворяют всем необходимым критериям);

source: The phase of the project. I.e. automatic transitions are turned off during the <emphasis>freeze</emphasis> of the <literal>testing</literal> distribution.
ru: Фаза проекта. Напр., автоматические переходы отключаются во время <emphasis>заморозки</emphasis> <literal>тестируемого</literal> выпуска.

source: To find out whether a package is progressing into <literal>testing</literal> or not, see the <literal>testing</literal> script output on the <ulink url="&url-testing-maint;">web page of the testing distribution</ulink>, or use the program <command>grep-excuses</command> which is in the <systemitem role="package">devscripts</systemitem> package. This utility can easily be used in a <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> to keep yourself informed of the progression of your packages into <literal>testing</literal>.
ru: Чтобы узнать, продвигается пакет к переходу в <literal>тестируемый</literal> выпуск или нет, см. вывод сценария <literal>тестируемого</literal> выпуска на <ulink url="&url-testing-maint;">веб-странице тестируемого выпуска</ulink>, либо используйте программу <command>grep-excuses</command>, которая является частью пакета <systemitem role="package">devscripts</systemitem>. Данная утилита легко может использоваться в <citerefentry> <refentrytitle>crontab</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> для того, чтобы у вас всегда имелась информация о продвижении ваших пакетов в <literal>тестируемый</literal> выпуск.

source: The <filename>update_excuses</filename> file does not always give the precise reason why the package is refused; you may have to find it on your own by looking for what would break with the inclusion of the package. The <ulink url="&url-testing-maint;">testing web page</ulink> gives some more information about the usual problems which may be causing such troubles.
ru: Файл <filename>update_excuses</filename> не всегда содержит точную причину того, почему пакет был отклонён; вам может потребоваться выяснить это самостоятельно, проверяя, что может сломаться из-за добавления вашего пакета. <ulink url="&url-testing-maint;">Веб-страница тестируемого выпуска</ulink> содержит немного больше информации об обычных проблемах, которые могут вызывать подобные затруднения.

source: Sometimes, some packages never enter <literal>testing</literal> because the set of interrelationship is too complicated and cannot be sorted out by the scripts. See below for details.
ru: Бывает так, что некоторые пакет никогда не включаются в <literal>тестируемый</literal> выпуск из-за того, что набор взаимных зависимостей слишком сложен и не может быть разобран сценариями. Подробности см. ниже.

source: Some further dependency analysis is shown on <ulink url="http://release.debian.org/migration/"></ulink> — but be warned, this page also shows build dependencies which are not considered by britney.
ru: Некоторый дополнительный анализ зависимостей доступен по адресу <ulink url="http://release.debian.org/migration/"></ulink> — но предупреждаем, эта страница также содержит сборочные зависимости, которые не были рассмотрены britney.

source: Out-of-date
ru: Устаревание

source: Consider this example:
ru: Рассмотрим следующий пример:

source: The package is out of date on <literal>alpha</literal> in <literal>unstable</literal>, and will not go to <literal>testing</literal>. Removing the package would not help at all, the package is still out of date on <literal>alpha</literal>, and will not propagate to <literal>testing</literal>.
ru: Пакет является устаревшим на архитектуре <literal>alpha</literal> в <literal>нестабильном</literal> выпуске, и он не попадёт в <literal>тестируемый</literal> выпуск. Удаление пакета не поможет, пакет всё равно считается устаревшим на архитектуре <literal>alpha</literal>, и он не будет перемещён в <literal>тестируемый</literal> выпуск.

source: However, if ftp-master removes a package in <literal>unstable</literal> (here on <literal>arm</literal>):
ru: Тем не менее, если сопровождающий ftp удаляет пакет в <literal>нестабильном</literal> выпуске (здесь — на архитектуре <literal>arm</literal>):

source: In this case, the package is up to date on all release architectures in <literal>unstable</literal> (and the extra <literal>hurd-i386</literal> doesn't matter, as it's not a release architecture).
ru: В этом случае пакет считается обновлённым на всех выпускаемых архитектурах в <literal>нестабильном</literal> выпуске (дополнительная архитектура <literal>hurd-i386</literal> не имеет значения, поскольку она не является выпускаемой архитектурой).

source: Sometimes, the question is raised if it is possible to allow packages in that are not yet built on all architectures: No. Just plainly no. (Except if you maintain glibc or so.)
ru: Время от времени возникает вопрос о том, можно ли разрешить переход пакетов, которые ещё не были собраны на всех архитектурах. Нет. Просто нет и всё. (За исключением случая, если вы сопровождаете glibc или что-то подобное.)

source: Removals from testing
ru: Удаление из тестируемого выпуска

source: Sometimes, a package is removed to allow another package in: This happens only to allow <emphasis>another</emphasis> package to go in if it's ready in every other sense. Suppose e.g. that <literal>a</literal> cannot be installed with the new version of <literal>b</literal>; then <literal>a</literal> may be removed to allow <literal>b</literal> in.
ru: Иногда какой-то пакет удаляется для того, чтобы был осуществлён переход другого пакета. Это происходит только для того, чтобы позволить <emphasis>другому</emphasis> пакету осуществить переход в случае, если он уже готов. Допустим, напр., что пакет <literal>a</literal> не может быть установлен вместе с новой версией пакета <literal>b</literal>; тогда пакет <literal>a</literal> может быть удалён для того, чтобы был осуществлён переход пакета <literal>b</literal>.

source: Of course, there is another reason to remove a package from <literal>testing</literal>: It's just too buggy (and having a single RC-bug is enough to be in this state).
ru: Конечно, имеется и другая причина для удаления пакета из <literal>тестируемого</literal> выпуска. Он имеет слишком много ошибок (хотя даже одной критичной для выпуска ошибки достаточно).

source: Furthermore, if a package has been removed from <literal>unstable</literal>, and no package in <literal>testing</literal> depends on it any more, then it will automatically be removed.
ru: Более того, если пакет был удалён из <literal>нестабильного</literal> выпуска, и ни один пакет в <literal>тестируемом</literal> выпуске не зависит от него, то этот пакет будет автоматически удалён.

source: Circular dependencies
ru: Круговые зависимости

source: A situation which is not handled very well by britney is if package <literal>a</literal> depends on the new version of package <literal>b</literal>, and vice versa.
ru: Ситуация, которая не может быть правильно обработана britney, заключает в том, что пакет <literal>a</literal> зависит от новой версии пакета <literal>b</literal>, и наоборот.

source: An example of this is:
ru: Пример:

source: Neither package <literal>a</literal> nor package <literal>b</literal> is considered for update.
ru: Ни пакет <literal>a</literal>, ни пакет <literal>b</literal> не рассматриваются для обновления.

source: Currently, this requires some manual hinting from the release team. Please contact them by sending mail to &email-debian-release; if this happens to one of your packages.
ru: В настоящее время такая ситуация требует вмешательства выпускающей команды. Свяжитесь с ними, отправив сообщение по адресу &email-debian-release;, если такая ситуация возникла для одного из ваших пакетов.

source: Influence of package in testing
ru: Влияние пакета в тестируемом выпуске

source: Generally, there is nothing that the status of a package in <literal>testing</literal> means for transition of the next version from <literal>unstable</literal> to <literal>testing</literal>, with two exceptions: If the RC-bugginess of the package goes down, it may go in even if it is still RC-buggy. The second exception is if the version of the package in <literal>testing</literal> is out of sync on the different arches: Then any arch might just upgrade to the version of the source package; however, this can happen only if the package was previously forced through, the arch is in fuckedarches, or there was no binary package of that arch present in <literal>unstable</literal> at all during the <literal>testing</literal> migration.
ru: Вообще же, статус пакета в <literal>тестируемом</literal> выпуске ничего не значит для перехода следующей версии этого пакета из <literal>нестабильного</literal> выпуска в <literal>тестируемый</literal>, с двумя исключениями. Во-первых, если у пакета уменьшается количество критичных для выпуска ошибок, то он может осуществить переход даже в том случае, если у него всё ещё остаются критичные для выпуска ошибки. Во-вторых, если версия пакета в <literal>тестируемом</literal> выпуске не синхронизирована на разных архитектурах. Тогда любая архитектура может быть обновлена до версии пакета с исходным кодом; тем не менее, это может произойти только в том случае, если пакет ранее был перемещён вручную, данная архитектура входит в список fuckedarches, либо для данной архитектуры не было двоичного пакета в <literal>нестабильном</literal> выпуске во время перехода в <literal>тестируемый</literal> выпуск.

source: In summary this means: The only influence that a package being in <literal>testing</literal> has on a new version of the same package is that the new version might go in easier.
ru: Короче говоря, это означает следующее: единственный фактор, на который влияет нахождение пакета в <literal>тестируемом</literal> выпуске, состоит в том, что новая версия этого пакета может быть проще добавлена.

source: Details
ru: Подробности

source: If you are interested in details, this is how britney works:
ru: Если вам интересны подробности, то britney работает следующим образом:

source: The packages are looked at to determine whether they are valid candidates. This gives the update excuses. The most common reasons why a package is not considered are too young, RC-bugginess, and out of date on some arches. For this part of britney, the release managers have hammers of various sizes, called hints (see below), to force britney to consider a package.
ru: Просматриваются пакеты на предмет выявления того, являются они корректными кандидатами или нет. Это даёт нам список оснований для отказа в обновлении. Наиболее частыми основаниями того, почему пакет не рассматривается для обновления, являются то, что он слишком нов, имеет критичные для выпуска ошибки, устарел на каких-то архитектурах. Для этой части britney у управляющих выпуском имеются различные инструменты, называемые подсказками (см. ниже), которые используются для того, чтобы заставить britney рассмотреть данный пакет.

source: Now, the more complex part happens: Britney tries to update <literal>testing</literal> with the valid candidates. For that, britney tries to add each valid candidate to the testing distribution. If the number of uninstallable packages in <literal>testing</literal> doesn't increase, the package is accepted. From that point on, the accepted package is considered to be part of <literal>testing</literal>, such that all subsequent installability tests include this package. Hints from the release team are processed before or after this main run, depending on the exact type.
ru: Далее начинается более сложная часть. Britney пытается обновить <literal>тестируемый</literal> выпуск путём установки корректных кандидатов. Для этого britney пытается добавить каждого корректного кандидата в тестируемый выпуск. Если число неустанавливаемых пакетов в <literal>тестируемом</literal> выпуске не увеличивается, то пакет принимается. С этой точки зрения принятый пакет считается частью <literal>тестируемого</literal> выпуска, такой частью, что все последующий проверки установок будут включать в себя этот пакет. Подсказки выпускающей команды обрабатываются после или до этой основной работы в зависимости от типа подсказок.

source: If you want to see more details, you can look it up on <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink>.
ru: Если вы хотите ознакомиться с дополнительными подробностями, вы можете прочитать <ulink url="http://&ftp-master-host;/testing/update_output/"></ulink>.

source: The hints are available via <ulink url="http://&ftp-master-host;/testing/hints/"></ulink>, where you can find the <ulink url="http://&ftp-master-host;/testing/hints/README">description</ulink> as well. With the hints, the Debian Release team can block or unblock packages, ease or force packages into <literal>testing</literal>, remove packages from <literal>testing</literal>, approve uploads to <link linkend="t-p-u">testing-proposed-updates</link> or override the urgency.
ru: Подсказки доступны в <ulink url="http://&ftp-master-host;/testing/hints/"></ulink>, также там вы можете найти <ulink url="http://&ftp-master-host;/testing/hints/README">описание</ulink>. При помощи подсказок выпускающая команда Debian может блокировать или разблокировать пакеты, замедлять или ускорять переход пакетов в <literal>тестируемый</literal> выпуск, удалять пакеты из <literal>тестируемого</literal> выпуска, принимать загрузки в <link linkend="t-p-u">testing-proposed-updates</link>, либо изменять срочность загрузки.

source: Direct updates to testing
ru: Прямые обновления тестируемого выпуска

source: The <literal>testing</literal> distribution is fed with packages from <literal>unstable</literal> according to the rules explained above. However, in some cases, it is necessary to upload packages built only for <literal>testing</literal>. For that, you may want to upload to <literal>testing-proposed-updates</literal>.
ru: <literal>Тестируемый</literal> выпуск получает пакеты из <literal>нестабильного</literal> выпуска в соответствии с описанными ранее правилами. Тем не менее, в некоторых случаях необходимо загружать пакеты, собранные только для <literal>тестируемого</literal> выпуска. Для этого вы можете использовать загрузку в <literal>testing-proposed-updates</literal>.

source: Keep in mind that packages uploaded there are not automatically processed, they have to go through the hands of the release manager. So you'd better have a good reason to upload there. In order to know what a good reason is in the release managers' eyes, you should read the instructions that they regularly give on &email-debian-devel-announce;.
ru: Помните, что пакеты, загруженные туда, не обрабатываются автоматически, они должны пройти через руки управляющего выпуском. Поэтому для того, чтобы загружать свои пакеты туда, вам следует иметь для этого хорошее основание. Для того, чтобы знать, что управляющие выпуском считаются хорошим основанием, вам следует прочитать инструкции, которые они регулярно публикуют в &email-debian-devel-announce;.

source: You should not upload to <literal>testing-proposed-updates</literal> when you can update your packages through <literal>unstable</literal>. If you can't (for example because you have a newer development version in <literal>unstable</literal>), you may use this facility, but it is recommended that you ask for authorization from the release manager first. Even if a package is frozen, updates through <literal>unstable</literal> are possible, if the upload via <literal>unstable</literal> does not pull in any new dependencies.
ru: Вам не следует загружать в <literal>testing-proposed-updates</literal>, если вы можете обновить ваши пакеты через <literal>нестабильный</literal> выпуск. Если вы не можете этого сделать (например, из-за того, что у вас имеется более новая версия в <literal>нестабильном</literal> выпуске), вы можете использовать эту возможность. Однако рекомендуется сначала попросить на это разрешение у управляющего выпуском. Даже если пакет заморожен обновления через <literal>нестабильный</literal> выпуск всё равно возможны, если загрузка через <literal>нестабильный</literal> выпуск не тянет за собой какие-либо новые зависимости.

source: Version numbers are usually selected by adding the codename of the <literal>testing</literal> distribution and a running number, like <literal>1.2squeeze1</literal> for the first upload through <literal>testing-proposed-updates</literal> of package version <literal>1.2</literal>.
ru: Номера версий обычно формируются путём добавления кодового имени <literal>тестируемого</literal> выпуска и порядкового номера, например, <literal>1.2squeeze1</literal> для первой загрузки через <literal>testing-proposed-updates</literal> пакета с ПО версии <literal>1.2</literal>.

source: Please make sure you didn't miss any of these items in your upload:
ru: Убедитесь, что в вашей загрузке вы ничего не пропустили из следующего списка:

source: Make sure that your package really needs to go through <literal>testing-proposed-updates</literal>, and can't go through <literal>unstable</literal>;
ru: Убедитесь, что ваш пакет действительно должен пройти через <literal>testing-proposed-updates</literal>, и что он не может пройти через <literal>нестабильный</literal> выпуск;

source: Make sure that you included only the minimal amount of changes;
ru: Убедитесь, что вы включили в пакет лишь минимальное число изменений;

source: Make sure that you included an appropriate explanation in the changelog;
ru: Убедитесь, что вы включили соответствующее объяснение в журнал изменений пакета;

source: Make sure that you've written <literal>testing</literal> or <literal>testing-proposed-updates</literal> into your target distribution;
ru: Убедитесь, что вы указали <literal>тестируемый</literal> выпуск или <literal>testing-proposed-updates</literal> в списке целевых выпусков;

source: Make sure that you've built and tested your package in <literal>testing</literal>, not in <literal>unstable</literal>;
ru: Убедитесь, что вы собрали и протестировали ваш пакет в <literal>тестируемом</literal>, а не в <literal>нестабильном</literal> выпуске;

source: Make sure that your version number is higher than the version in <literal>testing</literal> and <literal>testing-proposed-updates</literal>, and lower than in <literal>unstable</literal>;
ru: Убедитесь, что номер версии пакета выше номера версии, входящей в <literal>тестируемый</literal> выпуск и в <literal>testing-proposed-updates</literal>, а также ниже, чем в <literal>нестабильном</literal> выпуске;

source: After uploading and successful build on all platforms, contact the release team at &email-debian-release; and ask them to approve your upload.
ru: После загрузки и успешной сборки на всех платформах, свяжитесь с выпускающей командой по адресу &email-debian-release; и попросите их одобрить вашу загрузку.

source: Frequently asked questions
ru: Часто задаваемые вопросы

source: What are release-critical bugs, and how do they get counted?
ru: Что такое критичные для выпуска ошибки, как производится их подсчёт?

source: All bugs of some higher severities are by default considered release-critical; currently, these are <literal>critical</literal>, <literal>grave</literal> and <literal>serious</literal> bugs.
ru: Все ошибки, имеющие высокую важность, по умолчанию считаются критичными для выпуска; в настоящее время это ошибки с важностью <literal>critical</literal>, <literal>grave</literal> и <literal>serious</literal>.
