Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If the package is a native package (without a Debian revision in the version number), the version must be the version of the last maintainer upload, plus <literal>+nmu<replaceable>X</replaceable></literal>, where <replaceable>X</replaceable> is a counter starting at <literal>1</literal>. If the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5</literal>, then an NMU would get version <literal>1.5+nmu1</literal>.
ru: Если пакет является родным пакетом (без номера ревизии Debian в номере версии), версия должны совпадать с версией загрузки её последним сопровождающим, плюс <literal>+nmu<replaceable>X</replaceable></literal>, где <replaceable>X</replaceable> представляет собой счётчик, начинающийся с <literal>1</literal>. Если последняя загрузка также была NMU, то счётчик следует увеличить. Например, если текущая версия пакета равна <literal>1.5</literal>, то загрузка NMU должна получить версию <literal>1.5+nmu1</literal>.

source: If the package is not a native package, you should add a minor version number to the Debian revision part of the version number (the portion after the last hyphen). This extra number must start at <literal>1</literal>. For example, if the current version is <literal>1.5-2</literal>, then an NMU would get version <literal>1.5-2.1</literal>. If a new upstream version is packaged in the NMU, the Debian revision is set to <literal>0</literal>, for example <literal>1.6-0.1</literal>.
ru: Если пакет не является родным пакетом, вам следует добавить минорный номер версии к части о ревизии Debian номера версии (та часть, которая идёт после последнего знака тире). Этот дополнительный номер должен начинаться с <literal>1</literal>. Например, если текущей версией является <literal>1.5-2</literal>, то загрузка NMU должна иметь версию <literal>1.5-2.1</literal>. Если в ходе NMU создаётся пакет для новой версии из основной ветки разработки, то номер ревизии Debian устанавливается в <literal>0</literal>, например, <literal>1.6-0.1</literal>.

source: In both cases, if the last upload was also an NMU, the counter should be increased. For example, if the current version is <literal>1.5+nmu3</literal> (a native package which has already been NMUed), the NMU would get version <literal>1.5+nmu4</literal>.
ru: В обоих случаях если последняя загрузка также была загрузкой NMU, счётчик должен быть увеличен. Например, если текущей версией является <literal>1.5+nmu3</literal> (родной пакет, для которого уже была выполнена загрузка NMU в прошлый раз), загрузка NMU должна получить версию <literal>1.5+nmu4</literal>.

source: A special versioning scheme is needed to avoid disrupting the maintainer's work, since using an integer for the Debian revision will potentially conflict with a maintainer upload already in preparation at the time of an NMU, or even one sitting in the ftp NEW queue. It also has the benefit of making it visually clear that a package in the archive was not made by the official maintainer.
ru: Специальная схема версий требуется для того, чтобы избежать срыва работы сопровождающего, поскольку использование целого числа для ревизии Debian потенциально может привести к конфликту с загрузкой, которая уже находится в стадии подготовки самим сопровождающим в то время, как вы выполняете NMU, либо даже уже включена в очередь NEW на ftp. Кроме того, это полезно для визуального выделения того, что пакет в архиве был подготовлен не тем, кто является его официальным сопровождающим.

source: If you upload a package to testing or stable, you sometimes need to "fork" the version number tree. This is the case for security uploads, for example. For this, a version of the form <literal>+deb<replaceable>X</replaceable>u<replaceable>Y</replaceable></literal> should be used, where <replaceable>X</replaceable> is the major release number, and <replaceable>Y</replaceable> is a counter starting at <literal>1</literal>. For example, while Wheezy (Debian 7.0) is stable, a security NMU to stable for a package at version <literal>1.5-3</literal> would have version <literal>1.5-3+deb7u1</literal>, whereas a security NMU to Jessie would get version <literal>1.5-3+deb8u1</literal>.
ru: Если вы загружаете пакет в тестируемый или стабильный выпуски, иногда вам необходимо выполнить "разветвление" древа номера версии. Это делается, например, в случае подготовки загрузок с исправлениями безопасности. Для этого следует использовать версию вида <literal>+deb<replaceable>X</replaceable>u<replaceable>Y</replaceable></literal>, где <replaceable>X</replaceable> представляет собой мажорный номер версии, а <replaceable>Y</replaceable> является счётчиком, начинающимся с <literal>1</literal>. Например, поскольку Wheezy (Debian 7.0) является стабильным выпуском, загрузка NMU для исправления проблем безопасности стабильного выпуска для пакета, имеющего версию <literal>1.5-3</literal> будет иметь версию <literal>1.5-3+deb7u1</literal>, а загрузка NMU с исправлением безопасности для Jessie будет иметь версию <literal>1.5-3+deb8u1</literal>.

source: Using the <literal>DELAYED/</literal> queue
ru: Использование очереди <literal>DELAYED/</literal>

source: Having to wait for a response after you request permission to NMU is inefficient, because it costs the NMUer a context switch to come back to the issue. The <literal>DELAYED</literal> queue (see <xref linkend="delayed-incoming"/>) allows the developer doing the NMU to perform all the necessary tasks at the same time. For instance, instead of telling the maintainer that you will upload the updated package in 7 days, you should upload the package to <literal>DELAYED/7</literal> and tell the maintainer that they have 7 days to react. During this time, the maintainer can ask you to delay the upload some more, or cancel your upload.
ru: Ожидание ответа на ваш запрос разрешения выполнить NMU не эффективно, так как это предполагает, что тот, кто выполняет NMU, должен будет отвлечься от проблемы, а затем снова вернутся к ней. Очередь <literal>DELAYED</literal> (см. <xref linkend="delayed-incoming"/>) позволяет разработчику, занимающемуся NMU, в то же самое время выполнять все необходимые задачи. Например, вместо того, чтобы сообщить сопровождающему о том, что вы собираетесь загрузить обновлённый пакет в течении 7 дней, вам следует загрузить пакет в <literal>DELAYED/7</literal> и сообщить сопровождающему, что у него имеется 7 дней для того, чтобы отреагировать на это. В течении этого времени сопровождающий может попросить вас ещё немного задержать загрузку, либо отменить её.

source: The <literal>DELAYED</literal> queue should not be used to put additional pressure on the maintainer. In particular, it's important that you are available to cancel or delay the upload before the delay expires since the maintainer cannot cancel the upload themselves.
ru: Очередь <literal>DELAYED</literal> не должна использоваться для дополнительного давления на сопровождающего. В частности, важно, что у вас имеется возможность отметить или задержать загрузку ещё немного до того момента, как срок изначальной задержки закончиться, так как сопровождающий не может сам отметить вашу загрузку.

source: If you make an NMU to <literal>DELAYED</literal> and the maintainer updates the package before the delay expires, your upload will be rejected because a newer version is already available in the archive. Ideally, the maintainer will take care to include your proposed changes (or at least a solution for the problems they address) in that upload.
ru: Если вы выполняете NMU в <literal>DELAYED</literal>, а сопровождающий обновляет пакет до того, как закончится срок задержки, ваша загрузку будет отклонена, поскольку в архиве уже будет доступна более новая версия. В идеале сопровождающий позаботится о включении предлагаемых вами изменений (или по меньшей мере о решении проблем, для решения который предназначаются ваши изменения) в своей загрузке.

source: NMUs from the maintainer's point of view
ru: NMU с точки зрения сопровождающего

source: When someone NMUs your package, this means they want to help you to keep it in good shape. This gives users fixed packages faster. You can consider asking the NMUer to become a co-maintainer of the package. Receiving an NMU on a package is not a bad thing; it just means that the package is interesting enough for other people to work on it.
ru: Когда кто-то выполняет NMU для вашего пакета, то это означает, что он хочет помочь вам поддерживать пакет в хорошей форме. Это позволяет пользователям быстрее получать исправленные пакеты. Вы можете попросить того, кто выполнил NMU, стать помощником сопровождающего для данного пакета. Когда кто-то выполнил NMU для вашего пакета, это вовсе не плохо; это лишь означает, что пакет интересен достаточному количеству людей, которые готовы работать над ним.

source: To acknowledge an NMU, include its changes and changelog entry in your next maintainer upload. If you do not acknowledge the NMU by including the NMU changelog entry in your changelog, the bugs will remain closed in the BTS but will be listed as affecting your maintainer version of the package.
ru: Для подтверждения NMU, добавьте предлагаемые изменения и запись журнала изменений в вашу собственную загрузку. Если вы не подтвердите NMU, добавив запись из журнала изменений NMU в ваш журнал изменений, сообщения об ошибках в системе отслеживания ошибок останутся закрытыми, но будут указаны как актуальные для версии пакета, которую загрузите вы.

source: Source NMUs vs Binary-only NMUs (binNMUs)
ru: NMU исходного кода и двоичные NMU (binNMU)

source: The full name of an NMU is <emphasis>source NMU</emphasis>. There is also another type, namely the <emphasis>binary-only NMU</emphasis>, or <emphasis>binNMU</emphasis>. A binNMU is also a package upload by someone other than the package's maintainer. However, it is a binary-only upload.
ru: Полностью NMU называется <emphasis>NMU исходного кода</emphasis>. Есть и другой тип NMU, а именно <emphasis>двоичные NMU</emphasis> или <emphasis>binNMU</emphasis>. BinNMU также представляет собой загрузку пакета тем, что не является его сопровождающим. Тем не менее, это загрузка исключительно двоичного кода.

source: When a library (or other dependency) is updated, the packages using it may need to be rebuilt. Since no changes to the source are needed, the same source package is used.
ru: При обновлении библиотеки (либо другой зависимости) пакеты, использующие её вероятно потребуется собрать заново. Поскольку изменения исходного кода не требуются, используется тот же самый пакет с исходным кодом.

source: BinNMUs are usually triggered on the buildds by wanna-build. An entry is added to <filename>debian/changelog</filename>, explaining why the upload was needed and increasing the version number as described in <xref linkend="binary-only-nmu"/>. This entry should not be included in the next upload.
ru: BinNMU обычно выполняются на buildd по инструкции wanna-build. В файл <filename>debian/changelog</filename> добавляется запись, объясняющая то, почему потребовалась загрузка, номер версии увеличивается в соответствии с тем, как это описано в <xref linkend="binary-only-nmu"/>. Эту запись не следует включать в следующую загрузку.

source: Buildds upload packages for their architecture to the archive as binary-only uploads. Strictly speaking, these are binNMUs. However, they are not normally called NMU, and they don't add an entry to <filename>debian/changelog</filename>.
ru: Buildd загружает пакеты для своей архитектуры в архив как двоичные загрузки. Строго говоря, они являются binNMU. Тем не менее, обычно они не называются NMU, они не добавляют запись в <filename>debian/changelog</filename>.

source: NMUs vs QA uploads
ru: NMU и загрузки командой контроля качества

source: NMUs are uploads of packages by somebody else than their assigned maintainer. There is another type of upload where the uploaded package is not yours: QA uploads. QA uploads are uploads of orphaned packages.
ru: NMU представляют собой загрузки пакетов теми, кто не является сопровождающим этих пакетов. Существует также другой тип загрузок, когда загружаемый пакет не является вашим: это загрузки команды контроля качества. Загрузки, выполняемые командой контроля качества, являются загрузками осиротевших пакетов.

source: QA uploads are very much like normal maintainer uploads: they may fix anything, even minor issues; the version numbering is normal, and there is no need to use a delayed upload. The difference is that you are not listed as the <literal>Maintainer</literal> or <literal>Uploader</literal> for the package. Also, the changelog entry of a QA upload has a special first line:
ru: Загрузки, выполняемые командой контроля качества, очень похожи на загрузки обычных сопровождающих: они могут исправлять всё, что угодно, даже незначительные проблемы; присвоение номера версии происходит обычным путём, также нет необходимости использовать задержку при загрузке. Отличие состоит в том, что вы не указаны в полях <literal>Maintainer</literal> и <literal>Uploader</literal> данного пакета. Кроме того, запись журнала изменений при загрузке, выполняемой командой контроля качества, содержит специальную первую строку:

source: If you want to do an NMU, and it seems that the maintainer is not active, it is wise to check if the package is orphaned (this information is displayed on the package's Package Tracking System page). When doing the first QA upload to an orphaned package, the maintainer should be set to <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal>. Orphaned packages which did not yet have a QA upload still have their old maintainer set. There is a list of them at <ulink url="&url-orphaned-not-qa;"/>.
ru: Если вы хотите выполнить NMU, и у вас складывается впечатление, что сопровождающий не активен, вам следует проверить, является ли данный пакет осиротевшим пакетом (эта информация отображается на странице пакета в системе отслеживания пакетов). При выполнении первой загрузки командой контроля качества в качестве сопровождающего устанавливается <literal>Debian QA Group &lt;packages@qa.debian.org&gt;</literal>. Для осиротевших пакетов, загрузка которых командой контроля качества ещё не выполнялась, в качестве сопровождающего имеют своего старого сопровождающего. Имеется список таких пакетов: <ulink url="&url-orphaned-not-qa;"/>.

source: Instead of doing a QA upload, you can also consider adopting the package by making yourself the maintainer. You don't need permission from anybody to adopt an orphaned package, you can just set yourself as maintainer and upload the new version (see <xref linkend="adopting"/>).
ru: Вместо выполнения загрузки командой контроля качестве, вы можете усыновить пакет и стать его сопровождающим. Вам не нужно разрешение кого бы то ни было для того, чтобы усыновить осиротевший пакет, вы можете установить себя его сопровождающим и загрузить новую версию (см. <xref linkend="adopting"/>).

source: NMUs vs team uploads
ru: NMU и командные загрузки

source: Sometimes you are fixing and/or updating a package because you are member of a packaging team (which uses a mailing list as <literal>Maintainer</literal> or <literal>Uploader</literal>, see <xref linkend="collaborative-maint"/>) but you don't want to add yourself to <literal>Uploaders</literal> because you do not plan to contribute regularly to this specific package. If it conforms with your team's policy, you can perform a normal upload without being listed directly as <literal>Maintainer</literal> or <literal>Uploader</literal>. In that case, you should start your changelog entry with the following line:
ru: Иногда вы занимаетесь исправлением и/или загрузкой пакета потому, что вы являетесь членом команды по созданию пакетов (команда использует адрес списка рассылки в качестве значения <literal>Maintainer</literal> или <literal>Uploader</literal>, см. <xref linkend="collaborative-maint"/>), но вы не хотите добавлять себя в поле <literal>Uploaders</literal>, поскольку вы не планируете постоянно участвовать в поддержке данного конкретного пакета. Если это соответствует политике вашей команды, вы можете выполнить обычную загрузку, не указывая себя в полях <literal>Maintainer</literal> или <literal>Uploader</literal>. В этом случае вам следует начать вашу запись в журнале изменения со следующей строки:

source: Collaborative maintenance
ru: Совместное сопровождение

source: Collaborative maintenance is a term describing the sharing of Debian package maintenance duties by several people. This collaboration is almost always a good idea, since it generally results in higher quality and faster bug fix turnaround times. It is strongly recommended that packages with a priority of <literal>standard</literal> or which are part of the base set have co-maintainers.
ru: Совместное сопровождение представляет собой термин, описывающий разделение обязанностей по сопровождению пакета Debian между несколькими людьми. Эта совместная работа почти всегда является отличной идеей, поскольку её результатом обычно является более высокое качество пакета и более быстрое исправление ошибок. Настоятельно рекомендуется, чтобы пакет с приоритетом <literal>standard</literal>, а также пакеты, являющиеся частью базового набора пакетов, имели несколько сопровождающих.

source: Generally there is a primary maintainer and one or more co-maintainers. The primary maintainer is the person whose name is listed in the <literal>Maintainer</literal> field of the <filename>debian/control</filename> file. Co-maintainers are all the other maintainers, usually listed in the <literal>Uploaders</literal> field of the <filename>debian/control</filename> file.
ru: Обычно имеется главный сопровождающий и один или больше помощников. Главный сопровождающий является тем, чьё имя указано в поле <literal>Maintainer</literal> файла <filename>debian/control</filename>. Помощники сопровождающего — это все остальные сопровождающие, обычно они указаны в поле <literal>Uploaders</literal> файла <filename>debian/control</filename>.

source: In its most basic form, the process of adding a new co-maintainer is quite easy:
ru: В наиболее простом виде процесс добавления новых помощников сопровождающий крайне лёгок:

source: Setup the co-maintainer with access to the sources you build the package from. Generally this implies you are using a network-capable version control system, such as <literal>CVS</literal> or <literal>Subversion</literal>. Alioth (see <xref linkend="alioth"/>) provides such tools, amongst others.
ru: Предоставьте помощнику сопровождающего доступ к исходному коду, из которого вы собираете ваш пакет. Обычно это предполагает, что вы используете систему контроля версий, поддерживающую работу в сети, такую как <literal>CVS</literal> или <literal>Subversion</literal>. Alioth (см. <xref linkend="alioth"/>) предоставляет помимо прочего и такие инструменты.

source: Add the co-maintainer's correct maintainer name and address to the <literal>Uploaders</literal> field in the first paragraph of the <filename>debian/control</filename> file.
ru: Добавьте имя и адрес электронной почты вашего помощника в поле <literal>Uploaders</literal> из первого раздела файла <filename>debian/control</filename>.

source: Using the PTS (<xref linkend="pkg-tracking-system"/>), the co-maintainers should subscribe themselves to the appropriate source package.
ru: Используя систему отслеживания пакетов (<xref linkend="pkg-tracking-system"/>), помощники сопровождающего должны оформить подписку на соответствующий пакет с исходным кодом.

source: Another form of collaborative maintenance is team maintenance, which is recommended if you maintain several packages with the same group of developers. In that case, the <literal>Maintainer</literal> and <literal>Uploaders</literal> field of each package must be managed with care. It is recommended to choose between one of the two following schemes:
ru: Другой формой совместного сопровождения является командное сопровождение, которое рекомендуется в случае если вы сопровождаете несколько пакетов вместе группой одних и тех же разработчиков. В этом случае на поля <literal>Maintainer</literal> и <literal>Uploaders</literal> каждого пакеты следует обратить особое внимание. Рекомендуется выбрать одну из двух следующих схем:

source: Put the team member mainly responsible for the package in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal>, put the mailing list address, and the team members who care for the package.
ru: Поместите в поле <literal>Maintainer</literal> члена команды, который будет ответственен за данный пакет. В поле <literal>Uploaders</literal> поместите адрес списка рассылки, а также тех членов команды, которые также будут следить за пакетов.

source: Put the mailing list address in the <literal>Maintainer</literal> field. In the <literal>Uploaders</literal> field, put the team members who care for the package. In this case, you must make sure the mailing list accept bug reports without any human interaction (like moderation for non-subscribers).
ru: Поместите адрес списка рассылки в поле <literal>Maintainer</literal>. В поле <literal>Uploaders</literal> поместите членов команды, которые будут следить за пакетом. В этом случае убедитесь, что список рассылки принимает сообщения об ошибках без какого-либо дополнительного взаимодействия (типа модерации для отправителей, не являющихся членами списка рассылки).

source: In any case, it is a bad idea to automatically put all team members in the <literal>Uploaders</literal> field. It clutters the Developer's Package Overview listing (see <xref linkend="ddpo"/>) with packages one doesn't really care for, and creates a false sense of good maintenance. For the same reason, team members do not need to add themselves to the <literal>Uploaders</literal> field just because they are uploading the package once, they can do a “Team upload” (see <xref linkend="nmu-team-upload"/>). Conversely, it is a bad idea to keep a package with only the mailing list address as a <literal>Maintainer</literal> and no <literal>Uploaders</literal>.
ru: В любом случае не следует помещать всех членов команды в поле <literal>Uploaders</literal>. Это приводит к путанице — в обзорный список пакетов разработчика (см. <xref linkend="ddpo"/>) попадают пакеты, о который данный разработчик фактически не заботится, и создаёт у пользователей ложное чувство того, что пакет хорошо сопровождается. По той же самой причине члены команды не должны добавлять себя в поле <literal>Uploaders</literal> только потому, что они загрузили данный пакет один раз, они могут выполнить “командную загрузку” (см. <xref linkend="nmu-team-upload"/>). И наоборот, не следует оставлять пакет только с одним адресом списка рассылки в поле <literal>Maintainer</literal>, когда поле <literal>Uploaders</literal> пусто.

source: The testing distribution
ru: Тестируемый выпуск

source: Basics
ru: Основы

source: Packages are usually installed into the <literal>testing</literal> distribution after they have undergone some degree of <literal>testing</literal> in <literal>unstable</literal>.
ru: Пакеты обычно устанавливаются в <literal>тестируемый</literal> выпуск после того, как они прошли некоторую <literal>проверку</literal> в <literal>нестабильном</literal> выпуске.
