Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Security advisories are only issued for the current, released stable distribution, and <emphasis>not</emphasis> for <literal>testing</literal> or <literal>unstable</literal>. When released, advisories are sent to the &email-debian-security-announce; mailing list and posted on <ulink url="&url-debian-security-advisories;">the security web page</ulink>. Security advisories are written and posted by the security team. However they certainly do not mind if a maintainer can supply some of the information for them, or write part of the text. Information that should be in an advisory includes:
ru: Рекомендации по безопасности выпускаются только для текущего стабильного выпуска, а <emphasis>не</emphasis> для <literal>тестируемого</literal> или <literal>нестабильного</literal> выпусков. Рекомендации при их выпуске отправляются в список рассылки &email-debian-security-announce; и размещаются на <ulink url="&url-debian-security-advisories;">веб-странице о безопасности</ulink>. Рекомендации по безопасности пишутся и публикуются командной безопасности. Тем не менее, они вовсе не против того, чтобы сопровождающий предоставил им какую-либо информацию или написал часть текста. В рекомендации по безопасности должна содержаться следующая информация:

source: A description of the problem and its scope, including:
ru: Описание проблемы и её масштаба, включая следующее:

source: The type of problem (privilege escalation, denial of service, etc.)
ru: Тип проблемы (повышение привилегий, отказ в обслуживании и т. д.)

source: What privileges may be gained, and by whom (if any)
ru: Какие привилегии могут быть получены и кем (если это имеет место)

source: How it can be exploited
ru: Как эта уязвимость может использоваться

source: Whether it is remotely or locally exploitable
ru: Может ли она использоваться удалённо, либо локально

source: How the problem was fixed
ru: Как проблема была исправлена

source: This information allows users to assess the threat to their systems.
ru: Эта информация позволяет пользователям оценить угрозу их системам

source: Version numbers of affected packages
ru: Номера версий подверженных проблеме пакетов

source: Version numbers of fixed packages
ru: Номера версий исправленных пакетов

source: Information on where to obtain the updated packages (usually from the Debian security archive)
ru: Информация о том, где можно получить обновлённые пакеты (обычно из архива безопасности Debian)

source: References to upstream advisories, <ulink url="http://cve.mitre.org">CVE</ulink> identifiers, and any other information useful in cross-referencing the vulnerability
ru: Ссылки на рекомендации по безопасности основной ветки разработки, идентификационные номера <ulink url="http://cve.mitre.org">CVE</ulink> и любую другую информацию, полезную для перекрёстного указания уязвимости

source: Preparing packages to address security issues
ru: Подготовка пакетов для решения проблем безопасности

source: One way that you can assist the security team in their duties is to provide them with fixed packages suitable for a security advisory for the stable Debian release.
ru: Вы можете помочь команде безопасности, если предоставите им исправления пакетов, подходящие для рекомендации по безопасности для стабильного выпуска Debian.

source: When an update is made to the stable release, care must be taken to avoid changing system behavior or introducing new bugs. In order to do this, make as few changes as possible to fix the bug. Users and administrators rely on the exact behavior of a release once it is made, so any change that is made might break someone's system. This is especially true of libraries: make sure you never change the API or ABI, no matter how small the change.
ru: Когда вы производите обновление стабильного выпуска, следует быть осторожным в том, чтобы не изменить поведение системы и не внести новые ошибки. Для того, чтобы сделать это, для исправления ошибки производите как можно более мелкие изменения. Пользователи и администраторы полагаются на строго определённое поведение ПО, поэтому любое изменение может сломать работу чьей-то системы. Это в особенности касается библиотек: убедитесь, что вы не изменили API или ABI, причём не важно, насколько малым было изменение.

source: This means that moving to a new upstream version is not a good solution. Instead, the relevant changes should be back-ported to the version present in the current stable Debian release. Generally, upstream maintainers are willing to help if needed. If not, the Debian security team may be able to help.
ru: Это означает, что переход на новую версию из основной ветки разработке не является хорошим решением. Вместо этого вам следует осуществить обратный перенос релевантных изменений в версию ПО, которая входит в стабильный выпуск Debian. Как правило, сопровождающие основной ветки разработки помогают сделать это, если это необходимо. Если же нет, то вам может помочь команда безопасности Debian.

source: In some cases, it is not possible to back-port a security fix, for example when large amounts of source code need to be modified or rewritten. If this happens, it may be necessary to move to a new upstream version. However, this is only done in extreme situations, and you must always coordinate that with the security team beforehand.
ru: В некоторых случаях обратный перенос исправления безопасности невозможен, например, когда должно быть изменено или переписано большое количество исходного кода. Если это имеет место, может потребоваться переход на новую версию основной ветки разработки. Тем не менее, это осуществляется только в крайних случаях, вам всегда следует заранее координировать такой переход с командой безопасности.

source: Related to this is another important guideline: always test your changes. If you have an exploit available, try it and see if it indeed succeeds on the unpatched package and fails on the fixed package. Test other, normal actions as well, as sometimes a security fix can break seemingly unrelated features in subtle ways.
ru: С этим де связан и другой важный совет: всегда тестируйте ваши изменения. Если у вас имеется эксплоит, попробуйте использовать его и выяснить, работает ли он на изначальном пакете и действительно ли он не работает на исправленном пакете. Также протестируйте другие, обычные действия, поскольку исправление безопасности может поломать даже кажущиеся несвязанными возможности.

source: Do <emphasis role="strong">NOT</emphasis> include any changes in your package which are not directly related to fixing the vulnerability. These will only need to be reverted, and this wastes time. If there are other bugs in your package that you would like to fix, make an upload to proposed-updates in the usual way, after the security advisory is issued. The security update mechanism is not a means for introducing changes to your package which would otherwise be rejected from the stable release, so please do not attempt to do this.
ru: Никогда <emphasis role="strong">НЕ</emphasis> добавляйте какие-либо изменения в ваш пакет, которые не связаны напрямую с исправлением уязвимости. Это лишь потребует вернуть изменения, это лишь зря потратит время разработчика. Если в вашем пакете имеются другие ошибки, которые вам хотелось бы исправить, подготовьте загрузку в proposed-updates обычным образом уже после того, как будет выпущена рекомендация по безопасности. Механизм обновления безопасности не служит для внесения в ваши пакеты таких изменений, которые в противном случае были бы отвернуты при их загрузке в стабильный выпуск, поэтому, пожалуйста, не пытайтесь этого делать.

source: Review and test your changes as much as possible. Check the differences from the previous version repeatedly (<command>interdiff</command> from the <systemitem role="package">patchutils</systemitem> package and <command>debdiff</command> from <systemitem role="package">devscripts</systemitem> are useful tools for this, see <xref linkend="debdiff"/>).
ru: Проверьте и протестируйте ваши изменения столько раз, сколько это возможно. Проверьте отличия от предыдущей версии (для этого очень полезны <command>interdiff</command> из пакета <systemitem role="package">patchutils</systemitem> и <command>debdiff</command> из пакета <systemitem role="package">devscripts</systemitem>, см. <xref linkend="debdiff"/>).

source: Be sure to verify the following items:
ru: Убедитесь, что вы проверили следующее:

source: <emphasis role="strong">Target the right distribution</emphasis> in your <filename>debian/changelog</filename>: <replaceable>codename</replaceable><literal>-security</literal> (e.g. <literal>wheezy-security</literal>). Do not target <replaceable>distribution</replaceable><literal>-proposed-updates</literal> or <literal>stable</literal>!
ru: <emphasis role="strong">Укажите верный выпуск</emphasis> в вашем файле <filename>debian/changelog</filename>: <replaceable>кодовое-имя</replaceable><literal>-security</literal> (напр., <literal>wheezy-security</literal>). Не указывайте <replaceable>выпуск</replaceable><literal>-proposed-updates</literal> или <literal>stable</literal>!

source: The upload should have <emphasis role="strong">urgency=high</emphasis>.
ru: Загрузка должна иметь <emphasis role="strong">urgency=high</emphasis>.

source: Make descriptive, meaningful changelog entries. Others will rely on them to determine whether a particular bug was fixed. Add <literal>closes:</literal> statements for any <emphasis role="strong">Debian bugs</emphasis> filed. Always include an external reference, preferably a <emphasis role="strong">CVE identifier</emphasis>, so that it can be cross-referenced. However, if a CVE identifier has not yet been assigned, do not wait for it but continue the process. The identifier can be cross-referenced later.
ru: Ваши записи в журнале изменений должны быть информативны и осмысленны. Другие пользователи будут полагаться не них при определении того, была исправлена определённая ошибка или нет. Добавляйте записи <literal>closes:</literal> о любых <emphasis role="strong">ошибках Debian</emphasis>. Всегда добавляйте внешнюю ссылку, желательно <emphasis role="strong">идентификатор CVE</emphasis>. Тем не менее, если идентификатор CVE ещё не был назначен, не ждите его, продолжайте процесс. Указать идентификатор можно позже.

source: Make sure the <emphasis role="strong">version number</emphasis> is proper. It must be greater than the current package, but less than package versions in later distributions. If in doubt, test it with <literal>dpkg --compare-versions</literal>. Be careful not to re-use a version number that you have already used for a previous upload, or one that conflicts with a binNMU. The convention is to append <literal>+deb</literal><replaceable>X</replaceable><literal>u1</literal> (where <replaceable>X</replaceable> is the major release number), e.g. <literal>1:2.4.3-4+deb7u1</literal>, of course increasing 1 for any subsequent uploads.
ru: Убедитесь, что <emphasis role="strong">номер версии</emphasis> верен. Он должен быть больше, чем номер версии текущего пакета, но меньше, чем версии пакета в более поздних выпусках. Если вы сомневаетесь, протестируйте пакет при помощи <literal>dpkg --compare-versions</literal>. Будьте внимательны, не используйте номер версии, который вы уже использовали при предыдущей загрузке, не используйте номер версии, который конфликтует с binNMU. Принято добавлять <literal>+deb</literal><replaceable>X</replaceable><literal>u1</literal> (где <replaceable>X</replaceable> является главным номером выпуска), напр. <literal>1:2.4.3-4+deb7u1</literal>, конечно, увеличивайте номер на 1 в своих последующих загрузках.

source: Unless the upstream source has been uploaded to <literal>security.debian.org</literal> before (by a previous security update), build the upload <emphasis role="strong">with full upstream source</emphasis> (<literal>dpkg-buildpackage -sa</literal>). If there has been a previous upload to <literal>security.debian.org</literal> with the same upstream version, you may upload without upstream source (<literal>dpkg-buildpackage -sd</literal>).
ru: Если исходный код из основной ветки разработки не был ранее загружен на <literal>security.debian.org</literal> (во время предыдущего обновления безопасности), соберите свою загрузку <emphasis role="strong">с полным исходным кодом из основной ветки разработки</emphasis> (<literal>dpkg-buildpackage -sa</literal>). Если же ранее была произведена загрузка на <literal>security.debian.org</literal>, содержащая ту же самую версию из основной ветки разработки, вы можете осуществить загрузку без добавления исходного кода из основной ветки (<literal>dpkg-buildpackage -sd</literal>).

source: Be sure to use the <emphasis role="strong">exact same <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis> as used in the normal archive, otherwise it is not possible to move the security fix into the main archives later.
ru: Убедитесь, что используется <emphasis role="strong">в точности тот же файл <filename>*.orig.tar.{gz,bz2,xz}</filename></emphasis>, который использовался в обычном архиве, в противном случае переместить исправление безопасности в основной архив будет нельзя.

source: Build the package on a <emphasis role="strong">clean system</emphasis> which only has packages installed from the distribution you are building for. If you do not have such a system yourself, you can use a debian.org machine (see <xref linkend="server-machines"/>) or setup a chroot (see <xref linkend="pbuilder"/> and <xref linkend="debootstrap"/>).
ru: Соберите пакет в <emphasis role="strong">чистой системе</emphasis>, в которой установлен пакеты только из того выпуска, для которого вы собираете свой пакет. Если у вам нет такой системы, вы можете использовать машину debian.org (см. <xref linkend="server-machines"/>), либо настроить chroot (см. <xref linkend="pbuilder"/> и <xref linkend="debootstrap"/>).

source: Uploading the fixed package
ru: Загрузка исправленного пакета

source: Do <emphasis role="strong">NOT</emphasis> upload a package to the security upload queue (on <literal>security-master.debian.org</literal>) without prior authorization from the security team. If the package does not exactly meet the team's requirements, it will cause many problems and delays in dealing with the unwanted upload.
ru: Никогда <emphasis role="strong">НЕ</emphasis> загружайте пакет в очередь обновлений безопасности (на <literal>security-master.debian.org</literal>) без соответствующего разрешения от команды безопасности. Если пакет не соответствует требованиями команды безопасности, работа с нежелательной загрузкой приведёт к возникновению множества проблем и задержек.

source: Do <emphasis role="strong">NOT</emphasis> upload your fix to <literal>proposed-updates</literal> without coordinating with the security team. Packages from <literal>security.debian.org</literal> will be copied into the <literal>proposed-updates</literal> directory automatically. If a package with the same or a higher version number is already installed into the archive, the security update will be rejected by the archive system. That way, the stable distribution will end up without a security update for this package instead.
ru: Никогда <emphasis role="strong">НЕ</emphasis> загружайте ваше исправление в <literal>proposed-updates</literal>, не связавшись с командой безопасности. Пакеты из <literal>security.debian.org</literal> будут скопированы в каталог <literal>proposed-updates</literal> автоматически. Если какой-то пакет с тем же самым или более высоким номером версии уже установлен в архиве, обновление безопасности будет отклонено системой, управляющей архивом. В этом случае стабильный выпуск останется без обновления безопасности.

source: Once you have created and tested the new package and it has been approved by the security team, it needs to be uploaded so that it can be installed in the archives. For security uploads, the place to upload to is <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.
ru: Как только вы создадите и протестируете новый пакет, когда он будет утверждён командой безопасности, этот пакет следует загрузить, чтобы он был установлен в архивы. Для обновлений безопасности пакеты следует загружать на <literal>ftp://security-master.debian.org/pub/SecurityUploadQueue/</literal>.

source: Once an upload to the security queue has been accepted, the package will automatically be built for all architectures and stored for verification by the security team.
ru: Как только будет принята ваша загрузка в очередь обновления безопасности, пакет будет автоматически собран для всех архитектур и сохранён для проверки командой безопасности.

source: Uploads which are waiting for acceptance or verification are only accessible by the security team. This is necessary since there might be fixes for security problems that cannot be disclosed yet.
ru: Загрузки, ожидающие принятия или проверки, доступны только членам команды безопасности. Это необходимо потому, что они могут содержать исправления таких проблем безопасности, информация о которых пока не может быть раскрыта.

source: If a member of the security team accepts a package, it will be installed on <literal>security.debian.org</literal> as well as proposed for the proper <replaceable>distribution</replaceable><literal>-proposed-updates</literal> on <literal>&ftp-master-host;</literal>.
ru: Если член команды безопасности принимает пакет, этот пакет будет установлен в <literal>security.debian.org</literal>, а также предложен для соответствующего каталога <replaceable>выпуск</replaceable><literal>-proposed-updates</literal> на <literal>&ftp-master-host;</literal>.

source: Moving, removing, renaming, orphaning, adopting, and reintroducing packages
ru: Перемещение, удаление, переименование, придание статуса осиротевшего, усыновление и повторное введение пакетов

source: Some archive manipulation operations are not automated in the Debian upload process. These procedures should be manually followed by maintainers. This chapter gives guidelines on what to do in these cases.
ru: Некоторые действия по управлению архивом в Debian не автоматизированы во время загрузки. Эти процедуры должны быть вручную выполнены сопровождающими. В данной главе содержатся советы о том, что следует делать в этих случаях.

source: Moving packages
ru: Перемещение пакетов

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for guidelines on what section a package belongs in.
ru: См. <ulink url="&url-debian-policy;">Руководство по политике Debian</ulink> для получения советов о том, к какому разделу относится тот или иной пакет.

source: Sometimes a package will change its section. For instance, a package from the <literal>non-free</literal> section might be GPL'd in a later version, in which case the package should be moved to `main' or `contrib'.<placeholder type="footnote" id="0"/>
ru: Иногда для какого-то пакета раздел может быть изменён. Например, пакет из раздела <literal>non-free</literal> (раздел несвободных пакетов) может быть перелицензирован под GPL, в этом случае этот пакет следует переместить в `main' (основной раздел) или `contrib' (раздел ПО, зависящего от несвободного ПО).<placeholder type="footnote" id="0"/>

source: If you need to change the section for one of your packages, change the package control information to place the package in the desired section, and re-upload the package (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). You must ensure that you include the <filename>.orig.tar.{gz,bz2,xz}</filename> in your upload (even if you are not uploading a new upstream version), or it will not appear in the new section together with the rest of the package. If your new section is valid, it will be moved automatically. If it does not, then contact the ftpmasters in order to understand what happened.
ru: Если вам нужно изменить раздел у одного из ваших пакетов, измените управляющую информацию о пакете, затем заново загрузите ваш пакет (подробности см. в <ulink url="&url-debian-policy;">Руководстве по политике Debian</ulink>). Вам следует чётко убедиться, что вы добавили <filename>.orig.tar.{gz,bz2,xz}</filename> в вашу загрузку (даже если вы не загружаете новую версию из основной ветки разработки), либо что этот файл не будет встречаться в новом разделе с остальной частью пакета. Если ваш новый раздел верен, пакет будет перемещён автоматически. Если же пакет не будет перемещён, тогда свяжитесь с управляющими ftp для того, чтобы понять, что же произошло.

source: Removing packages
ru: Удаление пакетов

source: If for some reason you want to completely remove a package (say, if it is an old compatibility library which is no longer required), you need to file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking that the package be removed; as all bugs, this bug should normally have normal severity. The bug title should be in the form <literal>RM: <replaceable>package</replaceable> <replaceable>[architecture list]</replaceable> -- <replaceable>reason</replaceable></literal>, where <replaceable>package</replaceable> is the package to be removed and <replaceable>reason</replaceable> is a short summary of the reason for the removal request. <replaceable>[architecture list]</replaceable> is optional and only needed if the removal request only applies to some architectures, not all. Note that the <command>reportbug</command> will create a title conforming to these rules when you use it to report a bug against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package.
ru: Если по какой-то причине вам необходимо полностью удалить пакет (например, если он представляет собой устаревшую библиотеку для совместимости, которая более не требуется), вам необходимо отправить отчёт об ошибке в псевдопакете <systemitem role="package">&ftp-debian-org;</systemitem> с просьбой об удалении вашего пакета; как и все сообщения об ошибках, это сообщение об ошибках обычно должно иметь важность normal. Заголовок сообщения об ошибке должен иметь вид <literal>RM: <replaceable>пакет</replaceable> <replaceable>[список архитектур]</replaceable> -- <replaceable>причина</replaceable></literal>, где <replaceable>пакет</replaceable> — это пакет, который следует удалить, а <replaceable>причина</replaceable> — краткое описание причины, по которой вы отправляете запрос на удаление. <replaceable>[список архитектур]</replaceable> опционален и и требуется только в том случае, если пакет необходимо удалить только для некоторых архитектур, а не для всех. Заметьте, что утилита <command>reportbug</command> создаст заголовок, соответствующий указанным правилам, если вы будете использовать её для отправки сообщения об ошибке в псевдопакете <systemitem role="package">&ftp-debian-org;</systemitem>.

source: If you want to remove a package you maintain, you should note this in the bug title by prepending <literal>ROM</literal> (Request Of Maintainer). There are several other standard acronyms used in the reasoning for a package removal, see <ulink url="http://&ftp-master-host;/removals.html"></ulink> for a complete list. That page also provides a convenient overview of pending removal requests.
ru: Если вы хотите удалить сопровождаемый вами пакет, вам следует указать это в заголовке вашего сообщения об ошибке, добавив в начале <literal>ROM</literal> (Request Of Maintainer, Запрос сопровождающего). Имеется некоторое количество других стандартных сокращений, используемых при удалении пакетов, полный список см. на странице <ulink url="http://&ftp-master-host;/removals.html"></ulink>. Кроме того, на этой странице представлен удобный обзор обработки запросов об удалении.
