Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Such bugs are presumed to have an impact on the chances that the package will be released with the <literal>stable</literal> release of Debian: in general, if a package has open release-critical bugs filed on it, it won't get into <literal>testing</literal>, and consequently won't be released in <literal>stable</literal>.
ru: Предполагается, что такие ошибки влияют на шансы того, будет пакет выпущен в составе <literal>стабильного</literal> выпуска Debian или нет. В общем случае, если пакет имеет открытые сообщения о критичных для выпуска ошибках, он не попадёт в <literal>тестируемый</literal> выпуск и, соответственно, не будет выпущен в составе <literal>стабильного</literal> выпуска.

source: The <literal>unstable</literal> bug count are all release-critical bugs which are marked to apply to <replaceable>package</replaceable>/<replaceable>version</replaceable> combinations that are available in unstable for a release architecture. The <literal>testing</literal> bug count is defined analogously.
ru: Число ошибок в пакетах <literal>нестабильного</literal> выпуска представляет собой все критичные для выпуска ошибки, которые помечены как применимые к комбинациям <replaceable>пакет</replaceable>/<replaceable>версия</replaceable>, доступным в нестабильном выпуске для выпускаемой архитектуры. Число ошибок в пакетах <literal>тестируемого</literal> выпуска определяется аналогичным образом.

source: How could installing a package into <literal>testing</literal> possibly break other packages?
ru: Как установка какого-то пакета в <literal>тестируемый</literal> выпуск может сломать другие пакеты?

source: The structure of the distribution archives is such that they can only contain one version of a package; a package is defined by its name. So when the source package <literal>acmefoo</literal> is installed into <literal>testing</literal>, along with its binary packages <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> and <literal>libacme-foo-dev</literal>, the old version is removed.
ru: Структура архивов выпусков такова, что они могут содержать только одну версию пакета; пакет определяется его именем. Поэтому, когда пакет с исходным кодом <literal>acmefoo</literal> устанавливается в <literal>тестируемый</literal> выпуск вместе с соответствующими двоичными пакетами <literal>acme-foo-bin</literal>, <literal>acme-bar-bin</literal>, <literal>libacme-foo1</literal> и <literal>libacme-foo-dev</literal>, старая версии пакетов удаляются.

source: However, the old version may have provided a binary package with an old soname of a library, such as <literal>libacme-foo0</literal>. Removing the old <literal>acmefoo</literal> will remove <literal>libacme-foo0</literal>, which will break any packages which depend on it.
ru: Тем не менее, старая версия может предоставлять двоичный пакет со старой библиотекой с тем же именем, такой как <literal>libacme-foo0</literal>. Удаление старого пакета <literal>acmefoo</literal> приведёт к удалению <literal>libacme-foo0</literal>, что в свою очередь приведёт к удалению всех зависящих от неё пакетов.

source: Evidently, this mainly affects packages which provide changing sets of binary packages in different versions (in turn, mainly libraries). However, it will also affect packages upon which versioned dependencies have been declared of the ==, &lt;=, or &lt;&lt; varieties.
ru: Очевидно, эта ситуация касается пакетов, которые в своих разных версиях предоставляют разные наборы двоичных пакетов (в основном библиотеки). Тем не менее, она также касается пакетов, которые имеют зависимости от конкретных версий, задаваемые через ==, &lt;= или &lt;&lt;.

source: When the set of binary packages provided by a source package change in this way, all the packages that depended on the old binaries will have to be updated to depend on the new binaries instead. Because installing such a source package into <literal>testing</literal> breaks all the packages that depended on it in <literal>testing</literal>, some care has to be taken now: all the depending packages must be updated and ready to be installed themselves so that they won't be broken, and, once everything is ready, manual intervention by the release manager or an assistant is normally required.
ru: Если набор двоичных пакетов, предоставляемый пакетом с исходным кодом, меняется подобным образом, все пакеты, которые зависят от старых двоичных пакетов должны быть обновлены таким образом, что они должны зависеть от новых двоичных пакетов. Поскольку установка такого пакета с исходным кодом в <literal>тестируемый</literal> выпуск ломает все пакеты, которые зависят от него в <literal>тестируемом</literal> выпуске, следует быть немного более внимательным: все зависящие пакеты сами должны быть обновлены и готовы к установке, так чтобы они не сломалось, и когда всё будет готово, обычно требуется ручное вмешательство управляющего выпуском или его ассистента.

source: If you are having problems with complicated groups of packages like this, contact &email-debian-devel; or &email-debian-release; for help.
ru: Если у вас имеются подобные проблемы со сложной группой пакетов, свяжитесь с &email-debian-devel; or &email-debian-release; for help.

source: Resources for Debian Developers
ru: Ресурсы для разработчиков Debian

source: In this chapter you will find a very brief road map of the Debian mailing lists, the Debian machines which may be available to you as a developer, and all the other resources that are available to help you in your maintainer work.
ru: В данной главе вы найдёте очень краткую дорожную карту списков рассылки Debian, машин Debian, которые доступны вам как разработчику, а также всех других ресурсов, доступных вам, которые могут помочь вам в вашей работе в качестве сопровождающего.

source: Mailing lists
ru: Списки рассылки

source: Much of the conversation between Debian developers (and users) is managed through a wide array of mailing lists we host at <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal>. To find out more on how to subscribe or unsubscribe, how to post and how not to post, where to find old posts and how to search them, how to contact the list maintainers and see various other information about the mailing lists, please read <ulink url="&url-debian-lists;"></ulink>. This section will only cover aspects of mailing lists that are of particular interest to developers.
ru: Большая часть общения между разработчиками Debian (а также пользователями) происходит в списках рассылки, которые расположены по адресу <literal><ulink url="http://&lists-host;/">&lists-host;</ulink></literal>. Чтобы узнать о том, как подписаться или отписаться, как отправлять сообщения и как не отправлять их, где искать старые сообщения и как осуществлять поиск по ним, как связаться с сопровождающими данного списка рассылки и как просмотреть другую информацию о данном списке рассылки, прочтите <ulink url="&url-debian-lists;"></ulink>. В данном разделе приводятся лишь некоторые аспекты списков рассылки, которые особенно интересны разработчикам.

source: Basic rules for use
ru: Базовые правила

source: Cross-posting (sending the same message to multiple lists) is discouraged. As ever on the net, please trim down the quoting of articles you're replying to. In general, please adhere to the usual conventions for posting messages.
ru: Отправление нескольких одинаковых сообщений в разные списки рассылки не желательно. Как это обычно делается при работе в сети, сокращайте цитаты из сообщений, на которые вы отвечаете. В общем придерживайтесь обычных договорённостей по отправке сообщений.

source: Please read the <ulink url="&url-debian-lists;#codeofconduct">code of conduct</ulink> for more information. The <ulink url="&url-dcg;">Debian Community Guidelines</ulink> are also worth reading.
ru: Для получения дополнительной информации ознакомьтесь с <ulink url="&url-debian-lists;#codeofconduct">нормами поведения</ulink>. Также стоит прочитать <ulink url="&url-dcg;">Руководство по взаимодействию в сообществе Debian</ulink>.

source: Core development mailing lists
ru: Базовые списки рассылки

source: The core Debian mailing lists that developers should use are:
ru: Базовые списки рассылки Debian, которыми следует пользоваться разработчикам:

source: &email-debian-devel-announce;, used to announce important things to developers. All developers are expected to be subscribed to this list.
ru: &email-debian-devel-announce; используется для анонсирования важной информации для разработчиков. Ожидается, что все разработчики подписаны на этот список рассылки.

source: &email-debian-devel;, used to discuss various development related technical issues.
ru: &email-debian-devel; используется для обсуждения различных вопросов разработки, связанных с техническими проблемами.

source: &email-debian-policy;, where the Debian Policy is discussed and voted on.
ru: &email-debian-policy; используется для обсуждения и Политика Debian и голосования по её изменению.

source: &email-debian-project;, used to discuss various non-technical issues related to the project.
ru: &email-debian-project; используется для обсуждения различных не-технических проблем, связанных с Проектом.

source: There are other mailing lists available for a variety of special topics; see <ulink url="http://&lists-host;/"></ulink> for a list.
ru: Существуют и другие списки рассылки для обсуждения специальных вопросов; см. список по адресу <ulink url="http://&lists-host;/"></ulink>.

source: Special lists
ru: Специальные списки рассылки

source: &email-debian-private; is a special mailing list for private discussions amongst Debian developers. It is meant to be used for posts which for whatever reason should not be published publicly. As such, it is a low volume list, and users are urged not to use &email-debian-private; unless it is really necessary. Moreover, do <emphasis>not</emphasis> forward email from that list to anyone. Archives of this list are not available on the web for obvious reasons, but you can see them using your shell account on <literal>&master-host;</literal> and looking in the <filename>&file-debian-private-archive;</filename> directory.
ru: &email-debian-private; представляет собой специальный список рассылки для частных дискуссий между разработчиками Debian. Предполагается, что он будет использоваться для сообщений, которые по какой-либо причине не должны быть доступны широкой публике. Как таковой это небольшой список рассылки, пользователям рекомендуется не использовать &email-debian-private;, если только это не является действительно необходимым. Более того, <emphasis>не</emphasis> пересылайте сообщения из этого списка кому бы то ни было. Архивы данного списка не доступны в сети по очевидным причинам, но вы можете просмотреть их, используя вашу учётную запись для командной оболочки на <literal>&master-host;</literal>, архив находится в каталоге <filename>&file-debian-private-archive;</filename>.

source: &email-debian-email; is a special mailing list used as a grab-bag for Debian related correspondence such as contacting upstream authors about licenses, bugs, etc. or discussing the project with others where it might be useful to have the discussion archived somewhere.
ru: &email-debian-email; представляет собой специальный список рассылки, используемый для сбора связанной с Debian корреспонденции, такой как взаимодействие с авторами основной ветки разработки по поводу лицензий, ошибок и т. д., либо для обсуждения Проекта с другими пользователями и разработчиками, если сохранение этого обсуждения может оказаться полезным.

source: Requesting new development-related lists
ru: Запрос новых списков рассылки, связанных с разработкой

source: Before requesting a mailing list that relates to the development of a package (or a small group of related packages), please consider if using an alias (via a .forward-aliasname file on master.debian.org, which translates into a reasonably nice <replaceable>you-aliasname@debian.org</replaceable> address) or a self-managed mailing list on <link linkend="alioth">Alioth</link> is more appropriate.
ru: До отправки запроса по поводу списка рассылки, связанного с разработкой пакета (или небольшой группы связанных пакетов) подходит ли для этого использование псевдонима (через файл .forward-aliasname на master.debian.org, который переводит адрес в довольно хороший адрес <replaceable>you-aliasname@debian.org</replaceable>), либо самостоятельно управляемого списка рассылки на <link linkend="alioth">Alioth</link>.

source: If you decide that a regular mailing list on &lists-host; is really what you want, go ahead and fill in a request, following <ulink url="&url-debian-lists-new;">the HOWTO</ulink>.
ru: Если вы решили, что обычный список рассылки на &lists-host; — это то, что вы хотите, то заполните запрос, следуя <ulink url="&url-debian-lists-new;">данному руководству</ulink>.

source: IRC channels
ru: Каналы IRC

source: Several IRC channels are dedicated to Debian's development. They are mainly hosted on the <ulink url="&url-oftc;">Open and free technology community (OFTC)</ulink> network. The <literal>irc.debian.org</literal> DNS entry is an alias to <literal>irc.oftc.net</literal>.
ru: Несколько каналов IRC специально посвящены разработке Debian. В основном они размещены в сети <ulink url="&url-oftc;">сообщества открытых и свободных технологий (OFTC)</ulink>. Запись DNS <literal>irc.debian.org</literal> является псевдонимом для <literal>irc.oftc.net</literal>.

source: The main channel for Debian in general is <literal>#debian</literal>. This is a large, general-purpose channel where users can find recent news in the topic and served by bots. <literal>#debian</literal> is for English speakers; there are also <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> and other similarly named channels for speakers of other languages.
ru: Основным общим каналом для Debian является <literal>#debian</literal>. Это большой канал общего назначения, где пользователи могут найти свежие новости о Проекте, этот канал обслуживается роботами. <literal>#debian</literal> предназначен для говорящих на английском языке; также имеются <literal>#debian.de</literal>, <literal>#debian-fr</literal>, <literal>#debian-br</literal> и другие каналы со сходными названиями для тех, кто говорит на других языках.

source: The main channel for Debian development is <literal>#debian-devel</literal>. It is a very active channel; it will typically have a minimum of 150 people at any time of day. It's a channel for people who work on Debian, it's not a support channel (there's <literal>#debian</literal> for that). It is however open to anyone who wants to lurk (and learn). Its topic is commonly full of interesting information for developers.
ru: Основным каналом по вопросам разработки Debian является <literal>#debian-devel</literal>. Это довольно активный канал; обычно на нём присутствует не менее 150 человек в любое время дня. Это канал для тех, кто хочет работать над Debian, это не канал поддержки (это этого используется канал <literal>#debian</literal>). Тем не менее, этот канал открыт для всех, кто хочет затаиться (и научиться). Его тематика состоит в обсуждении любой информации, которая интересна разработчикам.

source: Since <literal>#debian-devel</literal> is an open channel, you should not speak there of issues that are discussed in &email-debian-private;. There's another channel for this purpose, it's called <literal>#debian-private</literal> and it's protected by a key. This key is available at <filename>master.debian.org:&file-debian-private-key;</filename>.
ru: Поскольку <literal>#debian-devel</literal> является открытым каналом, вам не следует обсуждать в нём то, что обсуждается в &email-debian-private;. Для этого цели имеется другой канал, который имеет имя <literal>#debian-private</literal>, он защищён ключом. Ключ доступен по адресу <filename>master.debian.org:&file-debian-private-key;</filename>.

source: There are other additional channels dedicated to specific subjects. <literal>#debian-bugs</literal> is used for coordinating bug squashing parties. <literal>#debian-boot</literal> is used to coordinate the work on the debian-installer. <literal>#debian-doc</literal> is occasionally used to talk about documentation, like the document you are reading. Other channels are dedicated to an architecture or a set of packages: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (OpenOffice.org package)...
ru: Имеются и другие дополнительные каналы, специально предназначенные для конкретных тем. <literal>#debian-bugs</literal> используется для координации вечеринок по исправлению ошибок. <literal>#debian-boot</literal> используется для координации работы над программой установки Debian. <literal>#debian-doc</literal> время от времени используется для разговоров по поводу документации, например, для обсуждения документации, которую вы читаете в настоящий момент. Другие каналы выделены для архитектур или наборов пакетов: <literal>#debian-kde</literal>, <literal>#debian-dpkg</literal>, <literal>#debian-jr</literal>, <literal>#debian-edu</literal>, <literal>#debian-oo</literal> (пакет OpenOffice.org)...

source: Some non-English developers' channels exist as well, for example <literal>#debian-devel-fr</literal> for French speaking people interested in Debian's development.
ru: Существуют также некоторые каналы для разработчиков, родным языком которые не является английский, например <literal>#debian-devel-fr</literal> для людей, говорящих на французском языке и заинтересованных в разработке Debian.

source: Channels dedicated to Debian also exist on other IRC networks, notably on the <ulink url="&url-openprojects;">freenode</ulink> IRC network, which was pointed at by the <literal>irc.debian.org</literal> alias until 4th June 2006.
ru: В других сетях IRC также существуют каналы, посвящённые Debia, в частности в IRC сети <ulink url="&url-openprojects;">freenode</ulink>, на который для 4 июня 2006 года работало перенаправление с псевдонима <literal>irc.debian.org</literal>.

source: This document contains a lot of information which is useful to Debian developers, but it cannot contain everything. Most of the other interesting documents are linked from <ulink url="&url-devel-docs;">The Developers' Corner</ulink>. Take the time to browse all the links, you will learn many more things.
ru: Данный документ содержит большое количество полезной разработчикам Debian информации, но он не может содержать всё. Ссылки на большинство других интересных документов приведены в <ulink url="&url-devel-docs;">Уголке разработчика</ulink>. Потратьте некоторое время на то, чтобы ознакомиться с ними, вы обязательно узнаете много нового.

source: Debian machines
ru: Машины Debian

source: Debian has several computers working as servers, most of which serve critical functions in the Debian project. Most of the machines are used for porting activities, and they all have a permanent connection to the Internet.
ru: У Debian имеется несколько компьютеров, которые работают в качестве серверов, большинство из них обслуживают критически важные функции в Проекте Debian. Большая часть машин используется для переноса пакетов, все эти машины имеют постоянное подключение в сети Интернет.

source: Some of the machines are available for individual developers to use, as long as the developers follow the rules set forth in the <ulink url="&url-dmup;">Debian Machine Usage Policies</ulink>.
ru: Некоторые машины доступны для использования отдельными разработчиками до тех пор, пока эти разработчики соблюдают правила, приведённые в <ulink url="&url-dmup;">Политике использования машин Debian</ulink>.

source: Generally speaking, you can use these machines for Debian-related purposes as you see fit. Please be kind to system administrators, and do not use up tons and tons of disk space, network bandwidth, or CPU without first getting the approval of the system administrators. Usually these machines are run by volunteers.
ru: Вообще говоря, вы можете использовать эти машины для связанных с Debian целей, если это кажется вам подходящим. Пожалуйста, будьте добры с системными администраторами, не используйте большое количество места на диске, пропускной способности сети, либо процессорного времени без предварительного разрешения системных администраторов. Обычно эти машины предоставляются добровольцами.

source: Please take care to protect your Debian passwords and SSH keys installed on Debian machines. Avoid login or upload methods which send passwords over the Internet in the clear, such as Telnet, FTP, POP etc.
ru: Позаботьтесь о защите ваших паролей Debian и ключей SSH, установленных на машинах Debian. Избегайте входа или методов загрузки, которые пересылают пароли по сети Интернет в открытом виде, такие как Telnet, FTP, POP и т. д.

source: Please do not put any material that doesn't relate to Debian on the Debian servers, unless you have prior permission.
ru: Пожалуйста, на размещайте какой-либо материал, не связанный с Debian, на серверах Debian в случае, если у вас нет на это соответствующего разрешения.

source: The current list of Debian machines is available at <ulink url="&url-devel-machines;"></ulink>. That web page contains machine names, contact information, information about who can log in, SSH keys etc.
ru: Текущий список машин Debian доступен по адресу: <ulink url="&url-devel-machines;"></ulink>. Эта веб-страница содержит имена машин, контактную информацию, информацию о том, кто может входить на данную машину, ключи SSH и т. д.

source: If you have a problem with the operation of a Debian server, and you think that the system operators need to be notified of this problem, you can check the list of open issues in the DSA queue of our request tracker at <ulink url="&url-rt;" /> (you can login with user "debian", its password is available at <filename>master.debian.org:&file-debian-rt-password;</filename>). To report a new problem, simply send a mail to &email-rt-dsa; and make sure to put the string "Debian RT" somewhere in the subject.
ru: Если у вас имеются проблемы с работой сервера Debian, и вы считаете, что системные операторы должны быть извещены об этой проблеме, вы можете обратиться к списку открытых проблем в очереди DSA в нашей системе отслеживания билетов <ulink url="&url-rt;" /> (вы можете войти под пользователем "debian", пароль же доступен по адресу: <filename>master.debian.org:&file-debian-rt-password;</filename>). Чтобы сообщить о новой проблеме, вам нужно лишь отправить сообщение по адресу &email-rt-dsa; и убедиться, что в теме вы указали "Debian RT".

source: If you have a problem with a certain service, not related to the system administration (such as packages to be removed from the archive, suggestions for the web site, etc.), generally you'll report a bug against a ``pseudo-package''. See <xref linkend="submit-bug"/> for information on how to submit bugs.
ru: Если у вас имеются проблемы с конкретной службой, которые не связаны с администрированием системы (такие как пакеты, которые следует удалить из архива, предложения для веб-сайта и т. д.), вам следует отправить сообщение об ошибке в псевдопакете ``pseudo-package''. Информацию о том, как отправлять такие сообщения об ошибках, см. <xref linkend="submit-bug"/>.

source: Some of the core servers are restricted, but the information from there is mirrored to another server.
ru: Некоторые корневые серверы ограничены, но информация с них зеркалируется на других серверах.

source: The bugs server
ru: Сервер bugs

source: <literal>&bugs-host;</literal> is the canonical location for the Bug Tracking System (BTS).
ru: <literal>&bugs-host;</literal> является каноническим размещением системы отслеживания ошибок.
