Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Changes that you make to the package need to be recorded in the <filename>debian/changelog</filename>. These changes should provide a concise description of what was changed, why (if it's in doubt), and note if any bugs were closed. They also record when the package was completed. This file will be installed in <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.Debian.gz</filename>, or <filename>/usr/share/doc/<replaceable>package</replaceable>/changelog.gz</filename> for native packages.
ru: Изменения, которые вы произвели в пакете, должны быть записаны в файл <filename>debian/changelog</filename>. Эти изменения должны содержать точное описание того, что было изменено, почему это было изменено (в случае если имеются какие-либо сомнения), а также номера закрываемых сообщений об ошибках. Кроме того, в журнале должно быть указано, когда была завершена работа над пакетом. Этот файл будет установлен как <filename>/usr/share/doc/<replaceable>пакет</replaceable>/changelog.Debian.gz</filename>, либо как <filename>/usr/share/doc/<replaceable>пакет</replaceable>/changelog.gz</filename> в случае, если пакет является родным.

source: The <filename>debian/changelog</filename> file conforms to a certain structure, with a number of different fields. One field of note, the <literal>distribution</literal>, is described in <xref linkend="distribution"/>. More information about the structure of this file can be found in the Debian Policy section titled <filename>debian/changelog</filename>.
ru: Файл <filename>debian/changelog</filename> соответствует определённой структуре, имеющей ряд различных полей. Одно из этих полей, <literal>выпуск</literal>, описывается в разделе <xref linkend="distribution"/>. Дополнительная информация о структуре этого файла может быть найдена в Политике Debian, в разделе с названием <filename>debian/changelog</filename>.

source: Changelog entries can be used to automatically close Debian bugs when the package is installed into the archive. See <xref linkend="upload-bugfix"/>.
ru: Записи журнала изменений могут использоваться для автоматического закрытия сообщений об ошибках Debian, когда пакет устанавливается в архив. См. <xref linkend="upload-bugfix"/>.

source: It is conventional that the changelog entry of a package that contains a new upstream version of the software looks like this:
ru: Обычная запись в журнале изменений какого-либо пакета, содержащего новую версию из основной ветки разработки ПО, выглядит следующим образом:

source: There are tools to help you create entries and finalize the <filename>changelog</filename> for release — see <xref linkend="devscripts"/> and <xref linkend="dpkg-dev-el"/>.
ru: Имеются специальные инструменты, которые помогают вам создавать записи журнала изменений и готовить файл <filename>changelog</filename> к выпуску — см. <xref linkend="devscripts"/> и <xref linkend="dpkg-dev-el"/>.

source: See also <xref linkend="bpp-debian-changelog"/>.
ru: Также см. <xref linkend="bpp-debian-changelog"/>.

source: Testing the package
ru: Тестирование пакета

source: Before you upload your package, you should do basic testing on it. At a minimum, you should try the following activities (you'll need to have an older version of the same Debian package around):
ru: До того как вы загрузите ваш пакет, вам следует провести его простое тестирование. Как минимум вам следует попытаться выполнить следующие действия (вам будет нужна более старая версия того же пакета Debian):

source: Install the package and make sure the software works, or upgrade the package from an older version to your new version if a Debian package for it already exists.
ru: Установите пакет и убедитесь, что ПО работает, либо обновите пакет с более старой версии до вашей новой версии, если пакет Debian для данного ПО уже существует.

source: Run <command>lintian</command> over the package. You can run <command>lintian</command> as follows: <literal>lintian -v <replaceable>package-version</replaceable>.changes</literal>. This will check the source package as well as the binary package. If you don't understand the output that <command>lintian</command> generates, try adding the <literal>-i</literal> switch, which will cause <command>lintian</command> to output a very verbose description of the problem.
ru: Выполните <command>lintian</command>, в качестве цели укажите ваш пакет. Вы можете запустить <command>lintian</command> следующим образом: <literal>lintian -v <replaceable>версия-пакета</replaceable>.changes</literal>. Эта команда проверит пакет с исходным кодом, наряду с двоичным пакетом. Если вы не понимаете вывод, предоставляемый вам <command>lintian</command>, попробуйте добавить опцию <literal>-i</literal>, это приведёт к тому, что <command>lintian</command> будет выводить довольно подробное описание проблему.

source: Normally, a package should <emphasis>not</emphasis> be uploaded if it causes <command>lintian</command> to emit errors (they will start with <literal>E</literal>).
ru: Обычно пакет <emphasis>не</emphasis> следует загружать в случае, если <command>lintian</command> сообщает об ошибках (они начинаются с <literal>E</literal>).

source: For more information on <command>lintian</command>, see <xref linkend="lintian"/>.
ru: Для получения дополнительной информации о команде <command>lintian</command>, см. <xref linkend="lintian"/>.

source: Optionally run <command>debdiff</command> (see <xref linkend="debdiff"/>) to analyze changes from an older version, if one exists.
ru: Также вы можете выполнить <command>debdiff</command> (см. <xref linkend="debdiff"/>), чтобы проанализировать изменения по сравнению с более старой версией (если таковая существует).

source: Downgrade the package to the previous version (if one exists) — this tests the <filename>postrm</filename> and <filename>prerm</filename> scripts.
ru: Установите предыдущую версию пакета (если она существует) поверх новой — это позволит проверить работу сценариев <filename>postrm</filename> и <filename>prerm</filename>.

source: Remove the package, then reinstall it.
ru: Удалите пакет, затем заново установите его.

source: Copy the source package in a different directory and try unpacking it and rebuilding it. This tests if the package relies on existing files outside of it, or if it relies on permissions being preserved on the files shipped inside the <filename>.diff.gz</filename> file.
ru: Скопируйте пакет с исходным кодом в другой каталог и попытайтесь распаковать и собрать его заново. Это позволит проверить то, зависит ли пакет от существующих файлов, которые не были добавлены в сам пакет, а также проверить то, зависит ли он от того, сохраняются ли права доступа в файлах из файла <filename>.diff.gz</filename>.

source: Layout of the source package
ru: Схема пакета с исходным кодом

source: There are two types of Debian source packages:
ru: Имеется два типа пакетов Debian с исходным кодом:

source: the so-called <literal>native</literal> packages, where there is no distinction between the original sources and the patches applied for Debian
ru: так называемые <literal>родные</literal> пакеты, для которых нет различия между оригинальным исходным кодом и заплатами Debian

source: the (more common) packages where there's an original source tarball file accompanied by another file that contains the changes made by Debian
ru: (более частные) пакеты, для которых имеется оригинальный исходный файл с tarball-архивом и другой файл, содержащий изменения, внесённые Проектом Debian

source: For the native packages, the source package includes a Debian source control file (<filename>.dsc</filename>) and the source tarball (<filename>.tar.{gz,bz2,xz}</filename>). A source package of a non-native package includes a Debian source control file, the original source tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>) and the Debian changes (<filename>.diff.gz</filename> for the source format “1.0” or <filename>.debian.tar.{gz,bz2,xz}</filename> for the source format “3.0 (quilt)”).
ru: У родных пакетов пакеты с исходным кодом включают в себя исходный файл контроля (<filename>.dsc</filename>) и исходный архив в виде tarball (<filename>.tar.{gz,bz2,xz}</filename>). Пакет с исходным кодом неродного пакета включает в себя исходный файл контроля, оригинальный исходный файл в виде tarball (<filename>.orig.tar.{gz,bz2,xz}</filename>) и специфичные изменения Debian (<filename>.diff.gz</filename> для формата пакета с исходным кодом “1.0” или <filename>.debian.tar.{gz,bz2,xz}</filename> для формата пакета с исходным кодом “3.0 (quilt)”).

source: With source format “1.0”, whether a package is native or not was determined by <command>dpkg-source</command> at build time. Nowadays it is recommended to be explicit about the desired source format by putting either “3.0 (quilt)” or “3.0 (native)” in <filename>debian/source/format</filename>. The rest of this section relates only to non-native packages.
ru: Для пакетов в исходном формате “1.0” то, является пакет родным или нет, определялось командой <command>dpkg-source</command> во время сборки. Сегодня же рекомендуется явным образом указывать желаемый исходный формат, помещая строку “3.0 (quilt)”, либо “3.0 (native)” в файл <filename>debian/source/format</filename>. Остаток настоящего раздела посвящён исключительно неродным пакетам.

source: The first time a version is uploaded which corresponds to a particular upstream version, the original source tar file should be uploaded and included in the <filename>.changes</filename> file. Subsequently, this very same tar file should be used to build the new diffs and <filename>.dsc</filename> files, and will not need to be re-uploaded.
ru: Во время первой загрузки пакета, версия пакета должна соответствовать определённой версии основной ветки разработки, должен быть загружен оригинальный исходный tar-файл, также он должен быть добавлен в файле <filename>.changes</filename>. В последующем этот самый tar-файл должен использоваться для сборки новых различий (diffs) и файлов <filename>.dsc</filename>, его не нужно будет загружать заново.

source: By default, <command>dpkg-genchanges</command> and <command>dpkg-buildpackage</command> will include the original source tar file if and only if the current changelog entry has a different upstream version from the preceding entry. This behavior may be modified by using <literal>-sa</literal> to always include it or <literal>-sd</literal> to always leave it out.
ru: По умолчанию команды <command>dpkg-genchanges</command> и <command>dpkg-buildpackage</command> включат оригинальный исходный tar-файл тогда и только тогда, когда текущая запись в журнале изменений содержит версию из основной ветки разработки, которая отличается от предыдущей записи. Это поведение может быть изменено при помощи использования <literal>-sa</literal>, что позволяет всегда включать оригинальный исходный tar-файл, либо <literal>-sd</literal>, что позволяет всегда игнорировать его.

source: If no original source is included in the upload, the original source tar-file used by <command>dpkg-source</command> when constructing the <filename>.dsc</filename> file and diff to be uploaded <emphasis>must</emphasis> be byte-for-byte identical with the one already in the archive.
ru: Если оригинальный исходный код не включён в загрузку, оригинальный tar-файлс исходным кодом, используемый <command>dpkg-source</command> при создании файла <filename>.dsc</filename> и diff для загрузки <emphasis>должен</emphasis> по-байтно совпадать с тем файлом, который уже добавлен в архив.

source: Please notice that, in non-native packages, permissions on files that are not present in the <filename>*.orig.tar.{gz,bz2,xz}</filename> will not be preserved, as diff does not store file permissions in the patch. However when using source format “3.0 (quilt)”, permissions of files inside the <filename>debian</filename> directory are preserved since they are stored in a tar archive.
ru: Заметьте, что в неродных пакетах права доступа к файлам, которые не входят в <filename>*.orig.tar.{gz,bz2,xz}</filename> не будут сохранены, поскольку diff не сохраняет права доступа к файлам в заплате. Тем не менее, если используется формат исходного кода “3.0 (quilt)”, права доступа к файлам внутри каталог <filename>debian</filename> сохраняются, так как они сохранены в архиве tar.

source: Picking a distribution
ru: Выбор выпуска

source: Each upload needs to specify which distribution the package is intended for. The package build process extracts this information from the first line of the <filename>debian/changelog</filename> file and places it in the <literal>Distribution</literal> field of the <filename>.changes</filename> file.
ru: Каждая загрузка должна содержать явное указание того, для какого выпуска предназначается данный пакет. Процесс сборки пакета извлекает эту информацию из первой строки файла <filename>debian/changelog</filename> и помещает её в поле <literal>Distribution</literal> файла <filename>.changes</filename>.

source: There are several possible values for this field: <literal>stable</literal>, <literal>unstable</literal>, <literal>testing-proposed-updates</literal> and <literal>experimental</literal>. Normally, packages are uploaded into <literal>unstable</literal>.
ru: Возможны следующие значения данного поля: <literal>stable</literal>, <literal>unstable</literal>, <literal>testing-proposed-updates</literal> и <literal>experimental</literal>. Обычно пакеты загружаются в <literal>unstable</literal>.

source: Actually, there are other possible distributions: <replaceable>codename</replaceable><literal>-security</literal>, but read <xref linkend="bug-security"/> for more information on those.
ru: Фактически, существуют и другие выпуски: <replaceable>кодовое-имя</replaceable><literal>-security</literal>, прочтите раздел <xref linkend="bug-security"/> для получения дополнительной информации.

source: It is not possible to upload a package into several distributions at the same time.
ru: Нельзя загрузить пакет в несколько выпусков одновременно.

source: Special case: uploads to the <literal>stable</literal> and <literal>oldstable</literal> distributions
ru: Специальный случай: загрузка в <literal>стабильный</literal> и <literal>предыдущий стабильный</literal> выпуски

source: Uploading to <literal>stable</literal> means that the package will transferred to the <literal>proposed-updates-new</literal> queue for review by the stable release managers, and if approved will be installed in <filename>stable-proposed-updates</filename> directory of the Debian archive. From there, it will be included in <literal>stable</literal> with the next point release.
ru: Загрузка в <literal>stable</literal> означает, что пакет будет передан в очередь <literal>proposed-updates-new</literal> для проверки управляющими стабильного выпуска, и если пакеты будут одобрены, то они будут установлены в каталог <filename>stable-proposed-updates</filename> архива Debian. Отсюда, в свою очередь, пакеты будут перенесены в <literal>stable</literal> во время формирования следующей редакции выпуска.

source: To ensure that your upload will be accepted, you should discuss the changes with the stable release team before you upload. For that, file a bug against the <systemitem role="package">release.debian.org</systemitem> pseudo-package using <command>reportbug</command>, including the patch you want to apply to the package version currently in <literal>stable</literal>. Always be verbose and detailed in your changelog entries for uploads to the <literal>stable</literal> distribution.
ru: Чтобы гарантировать, что ваша загрузка будет принята, вам следует обсудить изменения с командой стабильного выпуска до момента самой загрузки. Для этого отправьте сообщение об ошибке в псевдопакете-пакете <systemitem role="package">release.debian.org</systemitem>, используя <command>reportbug</command>, в сообщение добавьте заплату, которую вы желаете применить к той версии пакета, которая в настоящее время входит в <literal>стабильный</literal> выпуск. Будьте как можно более подробны в описании ваших записей журнала изменений, когда это касается <literal>стабильного</literal> выпуска.

source: Extra care should be taken when uploading to <literal>stable</literal>. Basically, a package should only be uploaded to <literal>stable</literal> if one of the following happens:
ru: Необходимо с особым вниманием относиться к загрузке пакета в <literal>стабильный</literal> выпуск. По сути, пакет следует загружать в <literal>стабильный</literal> выпуск исключительно в случае, если произошло что-либо из ниже следующего:

source: a truly critical functionality problem
ru: действительно критическая проблема функциональности

source: the package becomes uninstallable
ru: пакет больше нельзя установить

source: a released architecture lacks the package
ru: пакет отсутствует в выпущенной архитектуре

source: In the past, uploads to <literal>stable</literal> were used to address security problems as well. However, this practice is deprecated, as uploads used for Debian security advisories are automatically copied to the appropriate <filename>proposed-updates</filename> archive when the advisory is released. See <xref linkend="bug-security"/> for detailed information on handling security problems. If the security teams deems the problem to be too benign to be fixed through a <literal>DSA</literal>, the stable release managers are usually willing to include your fix nonetheless in a regular upload to <literal>stable</literal>.
ru: В прошлом загрузки в <literal>stable</literal> использовались и для решения проблема безопасности. Тем не менее, в настоящее время эта практика считается устаревшей, поскольку загрузки, используемые для рекомендаций Debian по безопасности, автоматически копируются в соответствующий архив <filename>proposed-updates</filename> в момент выпуска рекомендации. См. <xref linkend="bug-security"/> для получения подробной информации о работе с проблемами безопасности. Если команда безопасности считает, что проблема не настолько велика, чтобы исправлять её через механизм <literal>DSA</literal>, обычно управляющие стабильным выпуском добавляют ваше исправление в обычную загрузку в <literal>стабильный</literal> выпуск.

source: Changing anything else in the package that isn't important is discouraged, because even trivial fixes can cause bugs later on.
ru: Изменение в пакете чего-либо ещё, что не является действительно важным, крайне не рекомендуется, поскольку даже тривиальные исправления могут вызвать появление новых ошибок.

source: Packages uploaded to <literal>stable</literal> need to be compiled on systems running <literal>stable</literal>, so that their dependencies are limited to the libraries (and other packages) available in <literal>stable</literal>; for example, a package uploaded to <literal>stable</literal> that depends on a library package that only exists in <literal>unstable</literal> will be rejected. Making changes to dependencies of other packages (by messing with <literal>Provides</literal> or <filename>shlibs</filename> files), possibly making those other packages uninstallable, is strongly discouraged.
ru: Пакеты, загружаемые в <literal>стабильный</literal> выпуск, должны быть скомпилированы на системах, работающих под управлением <literal>стабильного</literal> выпуска, чтобы их зависимости были ограничены библиотеками (а также другими пакетами), доступными в <literal>стабильном</literal> выпуске; например, пакет, загруженный в <literal>стабильный</literal> выпуск, будет отклонён в том случае, если она зависит от пакета с библиотекой, который доступен только в <literal>нестабильном</literal> выпуске. Крайне не рекомендуется производить изменения зависимостей других пакетов (путём создания путаницы с <literal>Provides</literal> или файлами <filename>shlibs</filename>), которые могут привести к тому, что эти другие пакеты нельзя будет установить.

source: Uploads to the <literal>oldstable</literal> distributions are possible as long as it hasn't been archived. The same rules as for <literal>stable</literal> apply.
ru: Загрузки в <literal>предыдущие стабильные</literal> выпуски возможны до тех пор, пока эти выпуски не будут добавлены в архив. Те же правила применяются и к <literal>стабильным</literal> выпускам.

source: Special case: uploads to <literal>testing/testing-proposed-updates</literal>
ru: Специальный случай: загрузка в <literal>testing/testing-proposed-updates</literal>

source: Please see the information in the <link linkend="t-p-u">testing section</link> for details.
ru: Подробности см. в разделе <link linkend="t-p-u">тестируемом</link> выпуске.

source: Uploading a package
ru: Загрузка пакета

source: Uploading to <literal>ftp-master</literal>
ru: Загрузка на <literal>ftp-master</literal>

source: To upload a package, you should upload the files (including the signed changes and dsc-file) with anonymous ftp to <literal>&ftp-upload-host;</literal> in the directory <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. To get the files processed there, they need to be signed with a key in the Debian Developers keyring or the Debian Maintainers keyring (see <ulink url="&url-wiki-dm;"></ulink>).
ru: Чтобы загрузить пакет, вам следует загрузить файлы (включая подписанные файлы changes и dsc-файл) с помощью анонимного доступа по ftp на <literal>&ftp-upload-host;</literal> в каталог <ulink url="ftp://&ftp-upload-host;&upload-queue;">&upload-queue;</ulink>. Для того, чтобы файлы были обработаны, они должны быть подписаны ключом, входящим либо в брелок ключей разработчиков Debian, либо в брелок ключей сопровождающих Debian (см. <ulink url="&url-wiki-dm;"></ulink>).

source: Please note that you should transfer the changes file last. Otherwise, your upload may be rejected because the archive maintenance software will parse the changes file and see that not all files have been uploaded.
ru: Заметьте, что вам следует переслать файл changes самым последним. В противном случае ваша загрузка может быть отклонены потому, что ПО для сопровождения архива, осуществляющее грамматический разбор файла changes, посчитает, что не все файлы были загружены.

source: You may also find the Debian packages <link linkend="dupload">dupload</link> or <link linkend="dput">dput</link> useful when uploading packages.These handy programs help automate the process of uploading packages into Debian.
ru: Для загрузки пакетов Вам могут пригодиться пакеты <link linkend="dupload">dupload</link> или <link linkend="dput">dput</link>.Эти удобные программы помогают автоматизировать процесс загрузки пакетов в Debian.

source: For removing packages, please see <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> and the Debian package <link linkend="dcut">dcut</link>.
ru: Для удаления пакетов см. <ulink url="ftp://&ftp-upload-host;&upload-queue;README"/> и пакет <link linkend="dcut">dcut</link>.

source: Delayed uploads
ru: Задержанные загрузки

source: It is sometimes useful to upload a package immediately, but to want this package to arrive in the archive only a few days later. For example, when preparing a <link linkend="nmu">Non-Maintainer Upload</link>, you might want to give the maintainer a few days to react.
ru: Иногда полезно загрузить пакет сразу же, но так, чтобы этот пакет поступил в архив лишь несколько дней спустя. Например, при подготовке <link linkend="nmu">загрузки тем, кто не является сопровождающим</link>, вы возможно захотите дать сопровождающему несколько дней для того, чтобы тот как-то отреагировал.
