Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If you plan on doing some statistical analysis or processing of Debian bugs, this would be the place to do it. Please describe your plans on &email-debian-devel; before implementing anything, however, to reduce unnecessary duplication of effort or wasted processing time.
ru: Если вы планируете проводить какой-либо статистической анализ, либо обработку сообщений об ошибках Debian, то это можно сделать здесь. Тем не менее, пожалуйста, опишите ваши планы в сообщений в &email-debian-devel; до реализации чего бы то ни было, чтобы уменьшить объём ненужной работы или время на обработку запросов.

source: The ftp-master server
ru: Сервер ftp-master

source: The <literal>&ftp-master-host;</literal> server holds the canonical copy of the Debian archive. Generally, package uploaded to &ftp-upload-host; end up on this server, see <xref linkend="upload"/>.
ru: Сервер <literal>&ftp-master-host;</literal> хранит каноническую копию архива Debian. Вообще говоря, пакет, загружаемый на &ftp-upload-host;, в конце концов попадает на этот сервер, см. <xref linkend="upload"/>.

source: It is restricted; a mirror is available on <literal>&ftp-master-mirror;</literal>.
ru: Доступ у нему ограничен; зеркало доступно по адресу <literal>&ftp-master-mirror;</literal>.

source: Problems with the Debian FTP archive generally need to be reported as bugs against the <systemitem role="package">&ftp-debian-org;</systemitem> pseudo-package or an email to &email-ftpmaster;, but also see the procedures in <xref linkend="archive-manip"/>.
ru: О проблемам с архивом Debian FTP следует сообщать как об ошибках в псевдопакете <systemitem role="package">&ftp-debian-org;</systemitem>, либо по электронной почте на адрес &email-ftpmaster;, также см. описание процедур в <xref linkend="archive-manip"/>.

source: The www-master server
ru: Сервер www-master

source: The main web server is <literal>www-master.debian.org</literal>. It holds the official web pages, the face of Debian for most newbies.
ru: Основной веб-сервер расположен по адресу <literal>www-master.debian.org</literal>. Он содержит официальные веб-страницы, он представляет собой лицо Debian для большинства новичков.

source: If you find a problem with the Debian web server, you should generally submit a bug against the pseudo-package, <systemitem role="package">www.debian.org</systemitem>. Remember to check whether or not someone else has already reported the problem to the <ulink url="http://&bugs-host;/&www-debian-org;">Bug Tracking System</ulink>.
ru: Если вы обнаружите проблему с веб-сервером Debian, вам следует отправить сообщение об ошибке в псевдопакете <systemitem role="package">www.debian.org</systemitem>. Не забудьте проверить, сообщил ли кто-либо уже об этой проблеме в <ulink url="http://&bugs-host;/&www-debian-org;">систему отслеживания ошибок</ulink>.

source: The people web server
ru: Веб-сервер people

source: <literal>people.debian.org</literal> is the server used for developers' own web pages about anything related to Debian.
ru: <literal>people.debian.org</literal> представляет собой сервер, используемый для размещения собственных веб-страниц разработчиков обо всём, что связано с Debian.

source: If you have some Debian-specific information which you want to serve on the web, you can do this by putting material in the <filename>public_html</filename> directory under your home directory on <literal>people.debian.org</literal>. This will be accessible at the URL <literal>http://people.debian.org/~<replaceable>your-user-id</replaceable>/</literal>.
ru: Если у вас имеется какая-то касающаяся Debian информация, которую вы хотели бы разместить в веб, вы можете сделать это, поместив ваш материал в каталог <filename>public_html</filename> своего домашнего каталога на <literal>people.debian.org</literal>. Материал будет доступен по URL: <literal>http://people.debian.org/~<replaceable>ваш-идентификатор-пользователя</replaceable>/</literal>.

source: You should only use this particular location because it will be backed up, whereas on other hosts it won't.
ru: Вам следует использовать именно это место потому, что мы создаём его резервную копию, на других узлах резервные копии не создаются.

source: Usually the only reason to use a different host is when you need to publish materials subject to the U.S. export restrictions, in which case you can use one of the other servers located outside the United States.
ru: Обычно единственная причина использовать другой узел заключается в том, что вы хотите опубликовать какие-то материалы, которые подпадают под ограничения экспорта с территории США, в это случае вы можете использовать один из тех серверов, которые размещены за пределами США.

source: Send mail to &email-debian-devel; if you have any questions.
ru: Если у вас имеются какие-либо вопросы, отправьте сообщения по адресу &email-debian-devel;.

source: The VCS servers
ru: Серверы систем управления версиями

source: If you need to use a Version Control System for any of your Debian work, you can use one of the existing repositories hosted on Alioth or you can request a new project and ask for the VCS repository of your choice. Alioth supports CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arch (tla/baz, both on arch.debian.org), Bazaar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) and Git (git.debian.org). Checkout <ulink url="&url-alioth-pkg;" /> if you plan to maintain packages in a VCS repository. See <xref linkend="alioth"/> for information on the services provided by Alioth.
ru: Если вам нужно использовать систему управления версиями для какой-либо из ваших задач в Debian, вы можете использовать один из существующих репозиториев, размещённых на Alioth, либо вы можете запросить создать новый проект и попросить выделить для него репозиторий системы управления версиями по вашему выбору. Alioth поддерживает CVS (cvs.alioth.debian.org/cvs.debian.org), Subversion (svn.debian.org), Arch (tla/baz, both on arch.debian.org), Bazaar (bzr.debian.org), Darcs (darcs.debian.org), Mercurial (hg.debian.org) и Git (git.debian.org). Посмотрите <ulink url="&url-alioth-pkg;" />, если вы планируете сопровождать пакеты через репозиторий системы управления версиями. Информацию о предоставляемых Alioth сервисах см. в <xref linkend="alioth"/>.

source: chroots to different distributions
ru: chroot для различных выпусков

source: On some machines, there are chroots to different distributions available. You can use them like this:
ru: На некоторых машинах доступны chroot для различных выпусков. Вы можете использовать их следующим образом:

source: In all chroots, the normal user home directories are available. You can find out which chroots are available via <ulink url="&url-devel-machines;"></ulink>.
ru: Во всех chroot доступны обычные домашние каталоги пользователей. Вы можете узнать то, какие chroot доступны, через <ulink url="&url-devel-machines;"></ulink>.

source: The Developers Database
ru: База данных разработчиков

source: The Developers Database, at <ulink url="&url-debian-db;"></ulink>, is an LDAP directory for managing Debian developer attributes. You can use this resource to search the list of Debian developers. Part of this information is also available through the finger service on Debian servers, try <command>finger yourlogin@db.debian.org</command> to see what it reports.
ru: База данных разработчиков, расположенная на <ulink url="&url-debian-db;"></ulink>, представляет собой каталог LDAP для управления атрибутами разработчиков Debian. Вы можете использовать этот ресурс для поиска по списку разработчиков Debian. Часть этой информации также доступна через службу finger на серверах Debian, попробуйте выполнить <command>finger ваша-учётная-запись@db.debian.org</command> и посмотрите вывод этой команды.

source: Developers can <ulink url="&url-debian-db-login;">log into the database</ulink> to change various information about themselves, such as:
ru: Разработчики могут <ulink url="&url-debian-db-login;">входить в базу данных</ulink> для изменения различной информации о самих себе, как то:

source: forwarding address for your debian.org email
ru: адрес для пересылки вашей почты debian.org

source: subscription to debian-private
ru: подписка на debian-private

source: whether you are on vacation
ru: нахождение в отпуске

source: personal information such as your address, country, the latitude and longitude of the place where you live for use in <ulink url="&url-worldmap;">the world map of Debian developers</ulink>, phone and fax numbers, IRC nickname and web page
ru: персональная информация, например, адрес, страна, широта и долгота места, где вы проживаете, и которые будут использованы на <ulink url="&url-worldmap;">мировой карте разработчиков Debian</ulink>, номера телефонов и факсов, псевдоним в IRC и адрес веб-страницы

source: password and preferred shell on Debian Project machines
ru: пароль и предпочтительная оболочка на машинах Проекта Debian

source: Most of the information is not accessible to the public, naturally. For more information please read the online documentation that you can find at <ulink url="&url-debian-db-doc;"></ulink>.
ru: Естественно, большая часть информации не доступна публично. Для получения дополнительной информации, прочтите документацию, которая может быть найдена по адресу <ulink url="&url-debian-db-doc;"></ulink>.

source: Developers can also submit their SSH keys to be used for authorization on the official Debian machines, and even add new *.debian.net DNS entries. Those features are documented at <ulink url="&url-debian-db-mail-gw;"></ulink>.
ru: Разработчики могут добавлять свои SSH-ключи, которые будут использовать для авторизации на официальных машинах Debian, и даже добавлять новые записи DNS вида *.debian.net. Эти возможности описаны по адресу <ulink url="&url-debian-db-mail-gw;"></ulink>.

source: The Debian archive
ru: Архив Debian

source: The &debian-formal; distribution consists of a lot of packages (currently around &number-of-pkgs; source packages) and a few additional files (such as documentation and installation disk images).
ru: Дистрибутив &debian-formal; состоит из огромного числа пакетов (в настоящее время около &number-of-pkgs; пакетов с исходным кодом) и нескольких дополнительных файлов (таких как документация и образы установочных дисков).

source: Here is an example directory tree of a complete Debian archive:
ru: Ниже приведён пример дерева каталогов полного архива Debian:

source: As you can see, the top-level directory contains two directories, <filename>dists/</filename> and <filename>pool/</filename>. The latter is a “pool” in which the packages actually are, and which is handled by the archive maintenance database and the accompanying programs. The former contains the distributions, <literal>stable</literal>, <literal>testing</literal> and <literal>unstable</literal>. The <filename>Packages</filename> and <filename>Sources</filename> files in the distribution subdirectories can reference files in the <filename>pool/</filename> directory. The directory tree below each of the distributions is arranged in an identical manner. What we describe below for <literal>stable</literal> is equally applicable to the <literal>unstable</literal> and <literal>testing</literal> distributions.
ru: Как вы можете видеть, каталог верхнего уровня содержит два каталога, <filename>dists/</filename> и <filename>pool/</filename>. Последний представляет собой “пул”, в котором фактически находятся пакеты, и который обрабатывается базой данных для сопровождения архива и сопутствующими программами. Первый же содержит выпуски, <literal>стабильный</literal>, <literal>тестируемый</literal> и <literal>нестабильный</literal>. Файлы <filename>Packages</filename> и <filename>Sources</filename> в подкаталогах выпусков могут указывать на файлы в каталоге <filename>pool/</filename>. Деревья каталогов каждого выпуска организованы одинаковым образом. То, что мы описываем ниже для <literal>стабильного</literal> выпуска применимо и для <literal>нестабильного</literal>, и для <literal>тестируемого</literal> выпусков.

source: <filename>dists/stable</filename> contains three directories, namely <filename>main</filename>, <filename>contrib</filename>, and <filename>non-free</filename>.
ru: <filename>dists/stable</filename> содержит три каталога, а именно <filename>main</filename>, <filename>contrib</filename> и <filename>non-free</filename>.

source: In each of the areas, there is a directory for the source packages (<filename>source</filename>) and a directory for each supported architecture (<filename>binary-i386</filename>, <filename>binary-amd64</filename>, etc.).
ru: В каждом из них имеется каталог для пакетов с исходным кодом (<filename>source</filename>) и каталог для каждой поддерживаемой архитектуры (<filename>binary-i386</filename>, <filename>binary-amd64</filename> и т. д.).

source: The <filename>main</filename> area contains additional directories which hold the disk images and some essential pieces of documentation required for installing the Debian distribution on a specific architecture (<filename>disks-i386</filename>, <filename>disks-amd64</filename>, etc.).
ru: Каталог <filename>main</filename> содержит дополнительные каталоги, в которых хранятся образы дисков и некоторые важные части документации, требующиеся для установки дистрибутива Debian на конкретную архитектуру (<filename>disks-i386</filename>, <filename>disks-amd64</filename> и т. д.).

source: Sections
ru: Разделы

source: The <literal>main</literal> section of the Debian archive is what makes up the <emphasis role="strong">official &debian-formal; distribution</emphasis>. The <literal>main</literal> section is official because it fully complies with all our guidelines. The other two sections do not, to different degrees; as such, they are <emphasis role="strong">not</emphasis> officially part of &debian-formal;.
ru: Раздел <literal>main</literal> архива Debian &mdash; то, что является <emphasis role="strong">официальным дистрибутивом &debian-formal;</emphasis>. Раздел <literal>main</literal> является официальным потому, что он полностью соответствует всем нашим рекомендациям. Другие два раздела не соответствуют им в той или иной степени; как таковые они <emphasis role="strong">не</emphasis> являются официальной частью &debian-formal;.

source: Every package in the main section must fully comply with the <ulink url="&url-dfsg;">Debian Free Software Guidelines</ulink> (DFSG) and with all other policy requirements as described in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. The DFSG is our definition of “free software.” Check out the Debian Policy Manual for details.
ru: Каждый пакет из основного раздела должен полностью соответствовать <ulink url="&url-dfsg;">Критериям Debian по определению Свободного ПО</ulink> (DFSG), а также всем другим правилам, описываемым в <ulink url="&url-debian-policy;">Руководстве по политике Debian</ulink>. DFSG представляет собой наше определение понятия “свободное ПО.” Для получения дополнительной информации ознакомьтесь с Руководством по политике Debian.

source: Packages in the <literal>contrib</literal> section have to comply with the DFSG, but may fail other requirements. For instance, they may depend on non-free packages.
ru: Пакеты из раздела <literal>contrib</literal> должны соответствовать DFSG, но могут не отвечать другим требованиями. Например, они могут зависеть от несвободных пакетов.

source: Packages which do not conform to the DFSG are placed in the <literal>non-free</literal> section. These packages are not considered as part of the Debian distribution, though we enable their use, and we provide infrastructure (such as our bug-tracking system and mailing lists) for non-free software packages.
ru: Пакеты, которые не соответствуют DFSG, помещаются в раздел <literal>non-free</literal>. Эти пакеты не считаются частью дистрибутива Debian, хотя мы даём возможность их использовать, а также предоставляем нашу инфраструктуру (например, нашу систему отслеживания ошибок, а также списки рассылки) под пакеты с несвободным ПО.

source: The <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> contains a more exact definition of the three sections. The above discussion is just an introduction.
ru: <ulink url="&url-debian-policy;">Руководство по политике Debian</ulink> содержит более точное определение этих трёх разделов. Приведённое выше определение является лишь вводным.

source: The separation of the three sections at the top-level of the archive is important for all people who want to distribute Debian, either via FTP servers on the Internet or on CD-ROMs: by distributing only the <literal>main</literal> and <literal>contrib</literal> sections, one can avoid any legal risks. Some packages in the <literal>non-free</literal> section do not allow commercial distribution, for example.
ru: Разделение этих трёх разделов на верхнем уровне архива является важным для всех людей, которые хотят распространять Debian, через FTP серверы в Интернет или на CD-ROM: распространяя только разделы <literal>main</literal> и <literal>contrib</literal>, можно избежать правовых рисков. Например, некоторые пакеты в разделе <literal>non-free</literal> не разрешают их коммерческое распространение.

source: Note that the term section is also used to refer to categories which simplify the organization and browsing of available packages, e.g. <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> etc. Once upon a time, these sections (subsections, rather) existed in the form of subdirectories within the Debian archive. Nowadays, these exist only in the Section header fields of packages.
ru: Заметьте, понятие раздела также используется для указания категорий, которые упрощают организацию и просмотр доступных пакетов, напр. <literal>admin</literal>, <literal>net</literal>, <literal>utils</literal> и т. д. Когда-то давно эти разделы (скорее подразделы) существовали в виде подкаталогов внутри архива Debian. Сегодня же они существуют только в поле Section пакета.

source: Architectures
ru: Архитектуры

source: In the first days, the Linux kernel was only available for Intel i386 (or greater) platforms, and so was Debian. But as Linux became more and more popular, the kernel was ported to other architectures and Debian started to support them. And as if supporting so much hardware was not enough, Debian decided to build some ports based on other Unix kernels, like <literal>hurd</literal> and <literal>kfreebsd</literal>.
ru: В начале ядро Linux было доступно только для платформ Intel i386 (или выше), поэтому и Debian был доступен только для этой платформы. Но когда Linux стал всё более и более популярным, ядро было перенесено на другие архитектуры, и Debian начал их поддерживать. И если этой поддержки оборудования было недостаточно, Debian решал собрать некоторые переносы на основе ядер Unix, например <literal>hurd</literal> и <literal>kfreebsd</literal>.

source: &debian-formal; 1.3 was only available as <literal>i386</literal>. Debian 2.0 shipped for <literal>i386</literal> and <literal>m68k</literal> architectures. Debian 2.1 shipped for the <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal>, and <literal>sparc</literal> architectures. Since then Debian has grown hugely. Debian 6 supports a total of nine Linux architectures (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>) and two kFreeBSD architectures (<literal>kfreebsd-i386</literal> and <literal>kfreebsd-amd64</literal>).
ru: &debian-formal; 1.3 был доступен только для <literal>i386</literal>. Debian 2.0 поставлялся для архитектур <literal>i386</literal> и <literal>m68k</literal>. Debian 2.1 поставлялся для архитектур <literal>i386</literal>, <literal>m68k</literal>, <literal>alpha</literal> и <literal>sparc</literal>. Затем Debian очень сильно вырос. Debian 6 всего поддерживает девять архитектур Linux (<literal>amd64</literal>, <literal>armel</literal>, <literal>i386</literal>, <literal>ia64</literal>, <literal>mips</literal>, <literal>mipsel</literal>, <literal>powerpc</literal>, <literal>s390</literal>, <literal>sparc</literal>) и две архитектуры kFreeBSD (<literal>kfreebsd-i386</literal> и <literal>kfreebsd-amd64</literal>).

source: Information for developers and users about the specific ports are available at the <ulink url="&url-debian-ports;">Debian Ports web pages</ulink>.
ru: Информация для разработчиков и пользователей о конкретных переносах доступна на <ulink url="&url-debian-ports;">веб-страницах переносов Debian</ulink>.

source: Packages
ru: Пакеты

source: There are two types of Debian packages, namely <literal>source</literal> and <literal>binary</literal> packages.
ru: Имеется два типа пакетов Debian, а именно пакеты <literal>с исходным кодом</literal> и <literal>двоичные</literal> пакеты.

source: Depending on the format of the source package, it will consist of one or more files in addition to the mandatory <filename>.dsc</filename> file:
ru: В зависимости от формата пакета с исходным кодом, он состоит из одного или нескольких файлов в дополнение к обязательному файлу <filename>.dsc</filename>:

source: with format “1.0”, it has either a <filename>.tar.gz</filename> file or both an <filename>.orig.tar.gz</filename> and a <filename>.diff.gz</filename> file;
ru: формат “1.0” содержит либо файл <filename>.tar.gz</filename>, либо файл <filename>.orig.tar.gz</filename> и файл <filename>.diff.gz</filename>;

source: with format “3.0 (quilt)”, it has a mandatory <filename>.orig.tar.{gz,bz2,xz}</filename> upstream tarball, multiple optional <filename>.orig-<replaceable>component</replaceable>.tar.{gz,bz2,xz}</filename> additional upstream tarballs and a mandatory <filename>debian.tar.{gz,bz2,xz}</filename> debian tarball;
ru: формат “3.0 (quilt)” содержит обязательный tar-архив из основной ветки разработки <filename>.orig.tar.{gz,bz2,xz}</filename>, множество необязательных дополнительных tar-архивов из основной ветки разработки <filename>.orig-<replaceable>компонент</replaceable>.tar.{gz,bz2,xz}</filename> и обязательный tar-архив debian doc <filename>debian.tar.{gz,bz2,xz}</filename>;

source: with format “3.0 (native)”, it has only a single <filename>.tar.{gz,bz2,xz}</filename> tarball.
ru: формат “3.0 (native)” содержит только один tar-архив <filename>.tar.{gz,bz2,xz}</filename>.
