Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Note that removals can only be done for the <literal>unstable</literal>, <literal>experimental</literal> and <literal>stable</literal> distribution. Packages are not removed from <literal>testing</literal> directly. Rather, they will be removed automatically after the package has been removed from <literal>unstable</literal> and no package in <literal>testing</literal> depends on it. (Removals from <literal>testing</literal> are possible though by filing a removal bug report against the <systemitem role="package">&release-debian-org;</systemitem> pseudo-package. See the section <xref linkend="removals"/>.)
ru: Заметьте, что удаления могут быть выполнены только для <literal>нестабильного</literal>, <literal>экспериментального</literal> и <literal>стабильного</literal> выпусков. Пакеты из <literal>тестируемого</literal> выпуска напрямую не удаляются. Они будут удалены автоматически после удаления пакетов из <literal>нестабильного</literal> выпуска, и если в <literal>тестируемом</literal> выпуске от них не зависит ни один пакет. (Удаления из <literal>тестируемого</literal> выпуска возможны при отправке сообщения об ошибке в псевдопакете <systemitem role="package">&release-debian-org;</systemitem>. См. раздел <xref linkend="removals"/>.)

source: There is one exception when an explicit removal request is not necessary: If a (source or binary) package is no longer built from source, it will be removed semi-automatically. For a binary-package, this means if there is no longer any source package producing this binary package; if the binary package is just no longer produced on some architectures, a removal request is still necessary. For a source-package, this means that all binary packages it refers to have been taken over by another source package.
ru: Имеется одно исключение, при котором явный запрос об удалении не требуется: если двоичный пакет или пакет с исходным кодом более не может быть собран из исходного кода, в этом случае он будет удалён в полуавтоматическом режиме. Для двоичного пакета это означает, что у него более не имеется пакета с исходным кодом, который создаёт данный двоичный пакет; если двоичный пакет не создаётся на некоторых архитектурах, запрос об удалении этого пакета всё равно требуется. Для пакета с исходным кодом это означает, что все двоичные пакеты, на которые ссылается этот пакет, были приняты другим пакетом с исходным кодом.

source: In your removal request, you have to detail the reasons justifying the request. This is to avoid unwanted removals and to keep a trace of why a package has been removed. For example, you can provide the name of the package that supersedes the one to be removed.
ru: В вашем запросе об удалении вам следует подробно описать причины, обосновывающие ваше требование. Это позволит избежать нежелательных удалений и отследить то, почему пакет был удалён. Например, вы можете указать имя пакета, которые заменяет удаляемый пакет.

source: Usually you only ask for the removal of a package maintained by yourself. If you want to remove another package, you have to get the approval of its maintainer. Should the package be orphaned and thus have no maintainer, you should first discuss the removal request on &email-debian-qa;. If there is a consensus that the package should be removed, you should reassign and retitle the <literal>O:</literal> bug filed against the <literal>wnpp</literal> package instead of filing a new bug as removal request.
ru: Обычно просят удалить те пакеты, которые сопровождаются самим запрашивающим об удалении. Если вы хотите удалить другой пакет, вам следует получить на это разрешение от сопровождающего этого пакета. Если пакет должен быть признан осиротевшим, если он не имеет сопровождающего, то для начала вам следует обсудить запрос об удалении в &email-debian-qa;. В случае если было принято решение об удалении пакета, вам следует переназначить сообщение об ошибке в пакете <literal>wnpp</literal> и изменить его заголовок на <literal>O:</literal> вместо того, чтобы отправлять новое сообщение об ошибке с запросом об удалении.

source: Further information relating to these and other package removal related topics may be found at <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> and <ulink url="&url-debian-qa;howto-remove.html"></ulink>.
ru: Дополнительная информация, связанная с этими вопросами, а также по теме удаления других пакетов может быть найдена по адресу <ulink url="http://wiki.debian.org/ftpmaster_Removals"></ulink> и <ulink url="&url-debian-qa;howto-remove.html"></ulink>.

source: If in doubt concerning whether a package is disposable, email &email-debian-devel; asking for opinions. Also of interest is the <command>apt-cache</command> program from the <systemitem role="package">apt</systemitem> package. When invoked as <literal>apt-cache showpkg <replaceable>package</replaceable></literal>, the program will show details for <replaceable>package</replaceable>, including reverse depends. Other useful programs include <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (in the <systemitem role="package">devscripts</systemitem> package) and <command>grep-dctrl</command>. Removal of orphaned packages is discussed on &email-debian-qa;.
ru: Если вы сомневаетесь в том, может ли быть удалён какой-либо пакет, обратитесь по адресу &email-debian-devel; с этим вопросом. Кроме того, интерес представляет программа <command>apt-cache</command> из пакета <systemitem role="package">apt</systemitem>. При запуске <literal>apt-cache showpkg <replaceable>пакет</replaceable></literal>, эта программа отобразит подробную информацию о <replaceable>пакете</replaceable>, включая его обратные зависимости. Другими полезными программами являются <command>apt-cache rdepends</command>, <command>apt-rdepends</command>, <command>build-rdeps</command> (из пакета <systemitem role="package">devscripts</systemitem>) и <command>grep-dctrl</command>. Удаление осиротевших пакетов обсуждается в &email-debian-qa;.

source: Once the package has been removed, the package's bugs should be handled. They should either be reassigned to another package in the case where the actual code has evolved into another package (e.g. <literal>libfoo12</literal> was removed because <literal>libfoo13</literal> supersedes it) or closed if the software is simply no longer part of Debian. When closing the bugs, to avoid marking the bugs as fixed in versions of the packages in previous Debian releases, they should be marked as fixed in the version <literal>&lt;most-recent-version-ever-in-Debian&gt;+rm</literal>.
ru: После удаления пакета следует разобраться с его сообщениями об ошибках. Они должны быть либо переназначены другому пакету в случае, когда фактический код ПО развился в другой пакет (напр., <literal>libfoo12</literal> был удалён из-за того, что <literal>libfoo13</literal> его вытеснил), либо закрыты если это ПО более не является частью Debian. Закрывая сообщения об ошибках, не отмечайте их как исправленный в версиях пакета из предыдущих выпусков Debian, они должны быть отмечены как исправленные в <literal>&lt;наиболее -свежей-версии-в-Debian&gt;+rm</literal>.

source: Removing packages from <filename>Incoming</filename>
ru: Удаление пакетов из каталога <filename>Incoming</filename> (каталога входящих пакетов)

source: In the past, it was possible to remove packages from <filename>incoming</filename>. However, with the introduction of the new incoming system, this is no longer possible. Instead, you have to upload a new revision of your package with a higher version than the package you want to replace. Both versions will be installed in the archive but only the higher version will actually be available in <literal>unstable</literal> since the previous version will immediately be replaced by the higher. However, if you do proper testing of your packages, the need to replace a package should not occur too often anyway.
ru: Раньше можно было удалять пакеты из каталога <filename>incoming</filename>. Тем не менее, в введением новой системы входящих пакетов это более не возможно. Вместо этого вам следует загрузить новую версию вашего пакета с более высоким номером версии, чем имеет тот пакет, который вы хотите заменить. Обе версии будут установлены в архив, но лишь пакет с более высокой версией будет фактически доступен в <literal>нестабильном</literal> выпуске, поскольку предыдущая версия будет сразу же заменена более новой версией. Тем не менее, если вы хорошо тестируете ваши пакеты, нужды заменять пакет скорее всего не возникнет.

source: Replacing or renaming packages
ru: Замена или переименование пакетов

source: When the upstream maintainers for one of your packages chose to rename their software (or you made a mistake naming your package), you should follow a two-step process to rename it. In the first step, change the <filename>debian/control</filename> file to reflect the new name and to replace, provide and conflict with the obsolete package name (see the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for details). Please note that you should only add a <literal>Provides</literal> relation if all packages depending on the obsolete package name continue to work after the renaming. Once you've uploaded the package and the package has moved into the archive, file a bug against <systemitem role="package">&ftp-debian-org;</systemitem> asking to remove the package with the obsolete name (see <xref linkend="removing-pkgs"/>). Do not forget to properly reassign the package's bugs at the same time.
ru: Если сопровождающие основной ветки разработки решают изменить название своего ПО (либо если вы дали вашему пакету неверное имя), вам необходимо следовать процессу по переименованию пакета, который включает в себя два шага. На первом шаге измените файл <filename>debian/control</filename> так, чтобы в нём было отражено новое имя пакета, а также для того, чтобы устаревшее имя пакета было указано для замены, предоставления и в списке конфликтующих пакетов (см. <ulink url="&url-debian-policy;">Руководство по политике Debian</ulink>). Заметьте, что вам следует добавлять отношение <literal>Provides</literal> только тогда, когда все пакет, зависящие от устаревшего пакета, продолжают работать после переименования. Когда вы загрузите пакет, и он будет перемещён в архив, отправьте сообщение об ошибке в псевдопакете <systemitem role="package">&ftp-debian-org;</systemitem> с просьбой удалить пакет с устаревшим именем (см. <xref linkend="removing-pkgs"/>). Не забудьте правильно переназначить сообщения об ошибке, чтобы они отсылали к новому имени пакета.

source: At other times, you may make a mistake in constructing your package and wish to replace it. The only way to do this is to increase the version number and upload a new version. The old version will be expired in the usual manner. Note that this applies to each part of your package, including the sources: if you wish to replace the upstream source tarball of your package, you will need to upload it with a different version. An easy possibility is to replace <filename>foo_1.00.orig.tar.gz</filename> with <filename>foo_1.00+0.orig.tar.gz</filename> or <filename>foo_1.00.orig.tar.bz2</filename>. This restriction gives each file on the ftp site a unique name, which helps to ensure consistency across the mirror network.
ru: Вы можете допустить ошибку при создании вашего пакета, тогда вы захотите заменить свой пакет. Единственным способом сделать это является увеличение номера версии и загрузка новой версии пакет. Старая версия как обычно станет устаревшей. Заметьте, что это касается каждой части вашего пакета, включая и исходный код: если вы хотите заменить архив tarball с исходным кодом из основной ветки, вам придётся загрузить ваш пакет с другим номером версии. Проще всего заменить <filename>foo_1.00.orig.tar.gz</filename> на <filename>foo_1.00+0.orig.tar.gz</filename>, либо <filename>foo_1.00.orig.tar.bz2</filename>. Данное ограничение позволяет каждому файлу на ftp иметь уникальное имя, что помогает гарантировать согласованность в сети зеркал.

source: Orphaning a package
ru: Придание статуса осиротевшего пакета

source: If you can no longer maintain a package, you need to inform others, and see that the package is marked as orphaned. You should set the package maintainer to <literal>Debian QA Group &orphan-address;</literal> and submit a bug report against the pseudo package <systemitem role="package">wnpp</systemitem>. The bug report should be titled <literal>O: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal> indicating that the package is now orphaned. The severity of the bug should be set to <literal>normal</literal>; if the package has a priority of standard or higher, it should be set to important. If you feel it's necessary, send a copy to &email-debian-devel; by putting the address in the X-Debbugs-CC: header of the message (no, don't use CC:, because that way the message's subject won't indicate the bug number).
ru: Если вы не можете более сопровождать пакет, вам нужно сообщить об этом остальным, и убедиться, что ваш пакет отмечен как осиротевший. Вам следует установить сопровождающего пакета в значение <literal>Debian QA Group &orphan-address;</literal> и отправить сообщение об ошибке в псевдопакете <systemitem role="package">wnpp</systemitem>. Заголовок сообщения об ошибке должен иметь вид <literal>O: <replaceable>пакет</replaceable> -- <replaceable>краткое описание</replaceable></literal>, что показывает, что пакет осиротел. Важность сообщения об ошибке должна иметь значение <literal>normal</literal>; если пакет имеет стандартный приоритет или выше, важность сообщения об ошибке должна иметь значение important. Если вы считаете это необходимым, отправьте копию сообщения на адрес &email-debian-devel;, добавив этот адрес в заголовок X-Debbugs-CC: вашего сообщения (не используйте CC:, так как тогда тема сообщения не будет содержать номер сообщения об ошибке).

source: If you just intend to give the package away, but you can keep maintainership for the moment, then you should instead submit a bug against <systemitem role="package">wnpp</systemitem> and title it <literal>RFA: <replaceable>package</replaceable> -- <replaceable>short description</replaceable></literal>. <literal>RFA</literal> stands for <literal>Request For Adoption</literal>.
ru: Если вы хотите отдать пакет, но вы можете пока продолжать сопровождать его, то вам следует отправить сообщения об ошибке в псевдопакете <systemitem role="package">wnpp</systemitem>, сообщение должно иметь заголовок вида <literal>RFA: <replaceable>пакет</replaceable> -- <replaceable>краткое описание</replaceable></literal>. <literal>RFA</literal> означает <literal>Request For Adoption</literal> (запрос об усыновлении).

source: More information is on the <ulink url="&url-wnpp;">WNPP web pages</ulink>.
ru: Дополнительная информация доступна на <ulink url="&url-wnpp;">веб-страницах WNPP</ulink>.

source: Adopting a package
ru: Усыновление пакета

source: A list of packages in need of a new maintainer is available in the <ulink url="&url-wnpp;">Work-Needing and Prospective Packages list (WNPP)</ulink>. If you wish to take over maintenance of any of the packages listed in the WNPP, please take a look at the aforementioned page for information and procedures.
ru: Список пакетов, которым требуются новые сопровождающие, доступен на странице <ulink url="&url-wnpp;">Требующих доработки и будущих пакетов (WNPP)</ulink>. Если вы хотите заняться сопровождением какого-либо пакета из тех, что приведены в списке WNPP, обратитесь к вышеупомянутой странице для получения информации и сведений о процедуре.

source: It is not OK to simply take over a package that you feel is neglected — that would be package hijacking. You can, of course, contact the current maintainer and ask them if you may take over the package. If you have reason to believe a maintainer has gone AWOL (absent without leave), see <xref linkend="mia-qa"/>.
ru: Нельзя просто взять и заняться работой над пакетом, который кажется вам заброшенным — это было бы кражей пакета. Вы, конечно, можете связаться с текущим сопровождающим и спросить его об этом. Если у вас имеются основания полагать, что сопровождающий просто отсутствует без уведомления об этом (AWOL, absent without leave), см. <xref linkend="mia-qa"/>.

source: Generally, you may not take over the package without the assent of the current maintainer. Even if they ignore you, that is still not grounds to take over a package. Complaints about maintainers should be brought up on the developers' mailing list. If the discussion doesn't end with a positive conclusion, and the issue is of a technical nature, consider bringing it to the attention of the technical committee (see the <ulink url="&url-tech-ctte;">technical committee web page</ulink> for more information).
ru: Как правило, вы не можете заняться работой над пакетом без специального согласия на это от текущего сопровождающего. Даже если он вас игнорирует это всё равно не является основанием для начала работы над пакетом. Жалобы на сопровождающих должны высказываться в списке рассылки для разработчиков. Если дискуссия не заканчивается позитивным заключением, а проблема имеет техническую природу, подумайте над тем, чтобы привлечь к ней внимание технического комитета (дополнительную информацию см. на <ulink url="&url-tech-ctte;">странице технического комитета</ulink>).

source: If you take over an old package, you probably want to be listed as the package's official maintainer in the bug system. This will happen automatically once you upload a new version with an updated <literal>Maintainer</literal> field, although it can take a few hours after the upload is done. If you do not expect to upload a new version for a while, you can use <xref linkend="pkg-tracking-system"/> to get the bug reports. However, make sure that the old maintainer has no problem with the fact that they will continue to receive the bugs during that time.
ru: Если вы занялись работой над старым пакетом, вам вероятно захочется, чтобы в системе отслеживания ошибок в качестве официального сопровождающего этого пакета были указаны вы. Это будет сделано автоматически как только вы загрузите новую версию с обновлённым полем <literal>Maintainer</literal>, хотя на это может потребоваться несколько часов после выполнения загрузки. Если вы пока не собираетесь загружать новую версию, вы можете использовать <xref linkend="pkg-tracking-system"/> для получения сообщений об ошибках. Тем не менее, убедитесь, что старый сопровождающий не против того факта, что он будет получать сообщения об ошибках в течении какого-то времени.

source: Reintroducing packages
ru: Повторное добавление пакетов

source: Packages are often removed due to release-critical bugs, absent maintainers, too few users or poor quality in general. While the process of reintroduction is similar to the initial packaging process, you can avoid some pitfalls by doing some historical research first.
ru: Пакеты часто удаляются из-за наличия в них критичных для выпуска ошибок, отсутствия сопровождающих, слишком малого числа пользователей или низкого качества. Хотя процесс повторного добавления пакета схож с первоначальной работой над пакетом, вы можете избежать некоторых ловушек, выполнив для начала небольшое историческое исследование.

source: You should check why the package was removed in the first place. This information can be found in the removal item in the news section of the PTS page for the package or by browsing the log of <ulink url="http://&ftp-master-host;/#removed">removals</ulink>. The removal bug will tell you why the package was removed and will give some indication of what you will need to work on in order to reintroduce the package. It may indicate that the best way forward is to switch to some other piece of software instead of reintroducing the package.
ru: Для начала вам следует проверить, почему пакет был удалён. Эта информация может быть найдена в сообщении об удалении в разделе новостей на странице системы отслеживания пакетов данного пакета, либо при просмотре журнала <ulink url="http://&ftp-master-host;/#removed">удалений</ulink>. Сообщение об удалении в системе отслеживания ошибок содержит сведения о том, почему пакет был удалён, а также покажет вам то, над чем вам следует поработать для того, чтобы заново добавить пакет. В сообщении может содержаться сведения о том, что вместо повторного добавления пакета лучше всего переключиться на какое-то другое ПО.

source: It may be appropriate to contact the former maintainers to find out if they are working on reintroducing the package, interested in co-maintaining the package or interested in sponsoring the package if needed.
ru: Хорошо было бы связаться с предыдущими сопровождающими и выяснить, работают ли они над повторным добавление пакета, заинтересованы ли они в совместном сопровождении пакета, либо заинтересованы ли они в спонсировании пакета, если это необходимо.

source: You should do all the things required before introducing new packages (<xref linkend="newpackage"/>).
ru: Вам следует сделать всё, что требуется, до того как добавлять новые пакеты (<xref linkend="newpackage"/>).

source: You should base your work on the latest packaging available that is suitable. That might be the latest version from <literal>unstable</literal>, which will still be present in the <ulink url="&snap-debian-org;">snapshot archive</ulink>.
ru: В качестве основы для своей работы вам следует взять самый последний доступны и подходящий пакет. Это может быть самая последняя версия из <literal>нестабильного</literal> выпуска, которая всё ещё доступна в <ulink url="&snap-debian-org;">снимке архива</ulink>.

source: The version control system used by the previous maintainer might contain useful changes, so it might be a good idea to have a look there. Check if the <filename>control</filename> file of the previous package contained any headers linking to the version control system for the package and if it still exists.
ru: Система контроля версий, которая использовалась предыдущим сопровождающим, может содержать полезные изменения, поэтому проверка репозитория может оказаться хорошей идеей. Проверьте, содержит ли файл <filename>control</filename> в предыдущем пакете какие-либо заголовки со ссылками на систему контроля версий для данного пакета, и если да, то существует ли всё ещё этот репозиторий.

source: Package removals from <literal>unstable</literal> (not <literal>testing</literal>, <literal>stable</literal> or <literal>oldstable</literal>) trigger the closing of all bugs related to the package. You should look through all the closed bugs (including archived bugs) and unarchive and reopen any that were closed in a version ending in <literal>+rm</literal> and still apply. Any that no longer apply should be marked as fixed in the correct version if that is known.
ru: Удаление пакета из <literal>нестабильного</literal> выпуска (не из <literal>тестируемого</literal>, <literal>стабильного</literal> или <literal>предыдущего стабильного</literal> выпусков) приводит к закрытию всех сообщений об ошибках, которые связаны с удаляемым пакетом. Вам следует проверить все закрытые сообщения об ошибках (включая архивированные сообщения об ошибках), разархивировать и заново открыть любые закрытые сообщения об ошибках в версии, заканчивающейся на <literal>+rm</literal>, и которые всё ещё актуальны. Любые неактуальные сообщения об ошибках должны быть помечены как исправленные в той версии, в которой они были исправлены, если это, конечно, известно.

source: Porting and being ported
ru: Работа на переносом и перенос пакетов
