Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Best Packaging Practices
ru: Лучшие практики создания пакетов

source: Debian's quality is largely due to the <ulink url="&url-debian-policy;">Debian Policy</ulink>, which defines explicit baseline requirements which all Debian packages must fulfill. Yet there is also a shared history of experience which goes beyond the Debian Policy, an accumulation of years of experience in packaging. Many very talented people have created great tools, tools which help you, the Debian maintainer, create and maintain excellent packages.
ru: Качество Debian во многом определяется <ulink url="&url-debian-policy;">Политикой Debian</ulink>, определяющей точные базовые требования, которым должны соответствовать все пакеты Debian. Помимо этого существует и общая история, выходящая за пределы Политики Debian, которая была накоплена в течении многих лет работы по созданию пакетов. Многие очень талантливые люди создали превосходные инструменты, инструменты, которые помогут вам, сопровождающему Debian, создавать превосходные пакеты и сопровождать их.

source: This chapter provides some best practices for Debian developers. All recommendations are merely that, and are not requirements or policy. These are just some subjective hints, advice and pointers collected from Debian developers. Feel free to pick and choose whatever works best for you.
ru: Эта глава содержит описание некоторых лучших практик для разработчиков Debian. Все рекомендации являются только рекомендациями, а не требованиями или правилами. Они представляют собой лишь субъективные подсказки, советы и указания, позаимствованные у других разработчиков Debian. Выбирайте то, что лучше всего подходит именно вам.

source: Best practices for <filename>debian/rules</filename>
ru: Лучшие практики для <filename>debian/rules</filename>

source: The following recommendations apply to the <filename>debian/rules</filename> file. Since <filename>debian/rules</filename> controls the build process and selects the files which go into the package (directly or indirectly), it's usually the file maintainers spend the most time on.
ru: Следующие рекомендации применимы к файлу <filename>debian/rules</filename>. Поскольку файл <filename>debian/rules</filename> контролирует процесс сборки и выбирает файлы, которые войдут затем в пакет (напрямую или косвенно), он является тем файлом, на который обычно сопровождающие тратят больше всего времени.

source: Helper scripts
ru: Сценарии-помощники

source: The rationale for using helper scripts in <filename>debian/rules</filename> is that they let maintainers use and share common logic among many packages. Take for instance the question of installing menu entries: you need to put the file into <filename>/usr/share/menu</filename> (or <filename>/usr/lib/menu</filename> for executable binary menufiles, if this is needed), and add commands to the maintainer scripts to register and unregister the menu entries. Since this is a very common thing for packages to do, why should each maintainer rewrite all this on their own, sometimes with bugs? Also, supposing the menu directory changed, every package would have to be changed.
ru: Основная причина использования сценариев-помощников в файле <filename>debian/rules</filename> заключается в том, что последние позволяют сопровождающим распространять общую логику на множество пакетов и использовать её. Рассмотрим для примера вопрос установки пунктов меню: вам необходимо поместить файл в <filename>/usr/share/menu</filename> (или, если это требуется, <filename>/usr/lib/menu</filename> для выполняемых двоичных файлов меню), а также добавить команды сценариям сопровождающего для регистрации и отмены регистрации этих пунктов меню. Поскольку это довольно частая задача, зачем каждому сопровождающему переписывать всё это самостоятельно, а иногда и с ошибками? Кроме того, допустим, что каталог меню изменился, в этом случае пришлось бы изменить каждый пакет.

source: Helper scripts take care of these issues. Assuming you comply with the conventions expected by the helper script, the helper takes care of all the details. Changes in policy can be made in the helper script; then packages just need to be rebuilt with the new version of the helper and no other changes.
ru: Сценарии-помощники могут позаботиться об этих проблемах. Допустим, вы соблюдаете конвенции, ожидаемые сценарием-помощником, а последний заботится обо всех деталях. Если политика изменится, то это изменение может быть отражено в сценарии-помощнике; тогда пакеты нужно будет лишь собрать заново с новой версией помощника без каких-либо изменений вручную.

source: <xref linkend="tools"/> contains a couple of different helpers. The most common and best (in our opinion) helper system is <systemitem role="package">debhelper</systemitem>. Previous helper systems, such as <systemitem role="package">debmake</systemitem>, were monolithic: you couldn't pick and choose which part of the helper you found useful, but had to use the helper to do everything. <systemitem role="package">debhelper</systemitem>, however, is a number of separate little <command>dh_*</command> programs. For instance, <command>dh_installman</command> installs and compresses man pages, <command>dh_installmenu</command> installs menu files, and so on. Thus, it offers enough flexibility to be able to use the little helper scripts, where useful, in conjunction with hand-crafted commands in <filename>debian/rules</filename>.
ru: <xref linkend="tools"/> содержит описание различных помощников. Наиболее часто используемой и лучшей (по нашему мнению) системой-помощником является <systemitem role="package">debhelper</systemitem>. Предшествующие системы-помощники, такие как <systemitem role="package">debmake</systemitem>, были монолитны: вы не могли выбрать только ту часть помощника, которая кажется вам полезной, вам приходилось использовать этот помощник для всего сразу. Тем не менее, <systemitem role="package">debhelper</systemitem> представляет собой ряд отдельных небольших программ <command>dh_*</command>. Например, <command>dh_installman</command> устанавливает и сжимает страницы руководства, <command>dh_installmenu</command> устанавливает файлы меню и так далее. Таким образом, этот помощник предлагает достаточный уровень гибкости, позволяющий использовать небольшие сценарии-помощники там, где это подходит, а также команды, добавленные в файл <filename>debian/rules</filename> вручную.

source: You can get started with <systemitem role="package">debhelper</systemitem> by reading <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>, and looking at the examples that come with the package. <command>dh_make</command>, from the <systemitem role="package">dh-make</systemitem> package (see <xref linkend="dh-make"/>), can be used to convert a vanilla source package to a <systemitem role="package">debhelper</systemitem>ized package. This shortcut, though, should not convince you that you do not need to bother understanding the individual <command>dh_*</command> helpers. If you are going to use a helper, you do need to take the time to learn to use that helper, to learn its expectations and behavior.
ru: Вы можете начать своё знакомство с <systemitem role="package">debhelper</systemitem> с чтения <citerefentry> <refentrytitle>debhelper</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> и изучения примеров, которые поставляются вместе с содержащим этот помощник пакетом. <command>dh_make</command> из пакета <systemitem role="package">dh-make</systemitem> (смотрите <xref linkend="dh-make"/>), может использоваться для перевода ванильного пакета с исходным кодом в <systemitem role="package">debhelper</systemitem>ианизированый пакет. Этот короткий путь не должен, однако, создать у вас впечатление, что вам не нужно беспокоиться о понимании каждого отдельного помощника <command>dh_*</command>. Если вы собираетесь использовать помощник, вам следует потратить время на изучение того, как этот помощник используется, и изучить его ожидания и поведение.

source: Separating your patches into multiple files
ru: Отделение ваших заплат в несколько файлов

source: Big, complex packages may have many bugs that you need to deal with. If you correct a number of bugs directly in the source, and you're not careful, it can get hard to differentiate the various patches that you applied. It can get quite messy when you have to update the package to a new upstream version which integrates some of the fixes (but not all). You can't take the total set of diffs (e.g., from <filename>.diff.gz</filename>) and work out which patch sets to back out as a unit as bugs are fixed upstream.
ru: Большие, сложные пакеты могут содержать множество ошибок, с которыми вам предстоит иметь дело. Если вы исправляете несколько ошибок напрямую в исходном коде, и при этом вы недостаточно внимательны, дифференцировать различные заплаты, которые вы применили, может стать довольно трудной задачей. Пакет может превратиться в бардак, когда вам придётся обновить его для новой версии из основной ветки разработки, содержащей некоторые (но не все) применённые вами исправления. Вы не можете просто взять полный набор diff'ов (напр., из <filename>.diff.gz</filename>) и определить то, какой набор заплат представляет собой тот единый компонент кода, содержащий исправление ошибок для основной ветки разработки.

source: Fortunately, with the source format “3.0 (quilt)” it is now possible to keep patches separate without having to modify <filename>debian/rules</filename> to setup a patch system. Patches are stored in <filename>debian/patches/</filename> and when the source package is unpacked patches listed in <filename>debian/patches/series</filename> are automatically applied. As the name implies, patches can be managed with <command>quilt</command>.
ru: К счастью, с форматом исходного кода “3.0 (quilt)” теперь возможно хранить заплаты отдельно, не меняя файл <filename>debian/rules</filename> для настройки системы заплат. Заплаты хранятся в <filename>debian/patches/</filename>, и когда пакет с исходным кодом распаковывается, заплаты, указанные в <filename>debian/patches/series</filename>, применяются автоматически. Как предполагается из самого названия формата, заплаты могут обрабатываться командой <command>quilt</command>.

source: When using the older source “1.0”, it's also possible to separate patches but a dedicated patch system must be used: the patch files are shipped within the Debian patch file (<filename>.diff.gz</filename>), usually within the <filename>debian/</filename> directory. The only difference is that they aren't applied immediately by <command>dpkg-source</command>, but by the <literal>build</literal> rule of <filename>debian/rules</filename>, through a dependency on the <literal>patch</literal> rule. Conversely, they are reverted in the <literal>clean</literal> rule, through a dependency on the <literal>unpatch</literal> rule.
ru: При использовании более старого формата пакетов с исходным кодом “1.0” также можно выделить заплаты, но тогда необходимо использовать выделенную систему заплат: файлы заплат поставляются в файле заплат Debian (<filename>.diff.gz</filename>), который обычно располагается в каталоге <filename>debian/</filename>. Единственное отличие состоит в том, что в таком случае заплаты не применяются непосредственно командой <command>dpkg-source</command>, но правилом <literal>build</literal> файла <filename>debian/rules</filename>, через зависимость от правила <literal>patch</literal>. И наоборот, они отменяются в правиле <literal>clean</literal>, через зависимость от правила <literal>unpatch</literal>.

source: <command>quilt</command> is the recommended tool for this. It does all of the above, and also allows to manage patch series. See the <systemitem role="package">quilt</systemitem> package for more information.
ru: Рекомендованным инструментом для этого является команда <command>quilt</command>. Она делает всё вышеперечисленное, также она позволяет обрабатывать цепочки заплат. Дополнительную информацию смотрите в пакете <systemitem role="package">quilt</systemitem>.

source: There are other tools to manage patches, like <command>dpatch</command>, and the patch system integrated with <systemitem role="package">cdbs</systemitem>.
ru: Для обработки заплат существуют и другие инструменты, такие как <command>dpatch</command>, и система заплат, интегрированная в <systemitem role="package">cdbs</systemitem>.

source: Multiple binary packages
ru: Множественные двоичные пакеты

source: A single source package will often build several binary packages, either to provide several flavors of the same software (e.g., the <systemitem role="package">vim</systemitem> source package) or to make several small packages instead of a big one (e.g., so the user can install only the subset needed, and thus save some disk space).
ru: Один пакет с исходным кодом обычно используется для сборки нескольких двоичных пакетов, либо для предоставления нескольких разновидностей одного и того же ПО (напр., пакет с исходным кодом <systemitem role="package">vim</systemitem>), либо для создания нескольких небольших пакетов вместо одного большого (напр., так пользователь может установить только необходимое ему подмножество пакетов и таким образом сохранить место на диске).

source: The second case can be easily managed in <filename>debian/rules</filename>. You just need to move the appropriate files from the build directory into the package's temporary trees. You can do this using <command>install</command> or <command>dh_install</command> from <systemitem role="package">debhelper</systemitem>. Be sure to check the different permutations of the various packages, ensuring that you have the inter-package dependencies set right in <filename>debian/control</filename>.
ru: Со вторым случае можно легко управиться при помощи настроек в файле <filename>debian/rules</filename>. Вам нужно лишь переместить соответствующие файлы из каталога сборки во временные деревья пакета. Вы можете сделать это при помощи команд <command>install</command> или <command>dh_install</command> из пакета <systemitem role="package">debhelper</systemitem>. Не забудьте проверить разные изменения различных пакетов на предмет того, что вы правильно установили межпакетные зависимости в файле <filename>debian/control</filename>.

source: The first case is a bit more difficult since it involves multiple recompiles of the same software but with different configuration options. The <systemitem role="package">vim</systemitem> source package is an example of how to manage this using an hand-crafted <filename>debian/rules</filename> file.
ru: Первый случай немного сложнее, поскольку он предполагает множественные перекомпиляции одного и того же ПО, но с различными опциями настройки. Пакет с исходным кодом <systemitem role="package">vim</systemitem> представляет собой пример того, как можно справиться с этим, используя настроенный вручную файл <filename>debian/rules</filename>.

source: Best practices for <filename>debian/control</filename>
ru: Лучшие практики для <filename>debian/control</filename>

source: The following practices are relevant to the <filename>debian/control</filename> file. They supplement the <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Policy on package descriptions</ulink>.
ru: Следующие практики относятся к файлу <filename>debian/control</filename>. Они дополняют <ulink url="&url-debian-policy;ch-binary.html#s-descriptions">Политику описаний пакетов</ulink>.

source: The description of the package, as defined by the corresponding field in the <filename>control</filename> file, contains both the package synopsis and the long description for the package. <xref linkend="bpp-desc-basics"/> describes common guidelines for both parts of the package description. Following that, <xref linkend="bpp-pkg-synopsis"/> provides guidelines specific to the synopsis, and <xref linkend="bpp-pkg-desc"/> contains guidelines specific to the description.
ru: Описание пакета, как оно определено в соответствующем поле файла <filename>control</filename>, содержит резюме пакета и длинное описание этого пакета. <xref linkend="bpp-desc-basics"/> описывает общие принципы обеих этих частей описания пакета. Далее, <xref linkend="bpp-pkg-synopsis"/> содержит принципы, относящиеся к резюме, а <xref linkend="bpp-pkg-desc"/> представляет собой принципы, относящиеся к описанию.

source: General guidelines for package descriptions
ru: Общие принципы описания пакетов

source: The package description should be written for the average likely user, the average person who will use and benefit from the package. For instance, development packages are for developers, and can be technical in their language. More general-purpose applications, such as editors, should be written for a less technical user.
ru: Описание пакета должно быть написано для среднего пользователя, среднего человека, который будет использовать и извлекать пользу из данного пакета. Например, пакеты для разработки предназначены для разработчиков, и могут быть описаны техническим языком. Описания приложений общего назначения, таких как текстовые редакторы, должны быть написаны для менее подкованного в техническом плане пользователя.

source: Our review of package descriptions lead us to conclude that most package descriptions are technical, that is, are not written to make sense for non-technical users. Unless your package really is only for technical users, this is a problem.
ru: Наш обзор описаний пакетов привёл нас к заключению, что большая часть описаний пакетов являются техническими, то есть они не написаны так, чтобы быть понятными технически не подкованным пользователям. Если ваш пакет предназначен не только для технических пользователей, это является проблемой.

source: How do you write for non-technical users? Avoid jargon. Avoid referring to other applications or frameworks that the user might not be familiar with — GNOME or KDE is fine, since users are probably familiar with these terms, but GTK+ is probably not. Try not to assume any knowledge at all. If you must use technical terms, introduce them.
ru: Как следует писать описания для технически не подкованных пользователей? Избегайте жаргона. Избегайте указания на другие приложения или наборы приложений, которые могут быть незнакомы пользователю &mdash; GNOME или KDE это нормально, так как пользователи вероятно знакомы с этими терминами, но термин GTK+ скорее всего им не знаком. Попытайтесь вообще не допускать какого-либо знания. Если вам нужно использовать технические термины, определите их.

source: Be objective. Package descriptions are not the place for advocating your package, no matter how much you love it. Remember that the reader may not care about the same things you care about.
ru: Будьте объективны. Описания пакетов &mdash; это не то место, где следует пропагандировать свой пакет, не важно, насколько вы его любите. Помните, что читатель может и не заботиться о тех же вещах, что и вы.

source: References to the names of any other software packages, protocol names, standards, or specifications should use their canonical forms, if one exists. For example, use X Window System, X11, or X; not X Windows, X-Windows, or X Window. Use GTK+, not GTK or gtk. Use GNOME, not Gnome. Use PostScript, not Postscript or postscript.
ru: Указания на названия любых других пакетов ПО, названия протоколов, стандартов или спецификаций должны иметь каноническую форму, если таковая существует. Например, используйте X Window System, X11 или X; но не X Windows, X-Windows или X Window. Используйте GTK+, а не GTK или gtk. Используйте GNOME, а не Gnome. Используйте PostScript, а не Postscript или postscript.

source: If you are having problems writing your description, you may wish to send it along to &email-debian-l10n-english; and request feedback.
ru: Если у вас возникли проблемы с написанием описания, вы можете отправить его по адресу &email-debian-l10n-english; с запросом помощи.

source: The package synopsis, or short description
ru: Резюме пакета или короткое описание

source: Policy says the synopsis line (the short description) must be concise, not repeating the package name, but also informative.
ru: Политика говорит, что строка резюме (короткое описание) должна быть точной, не должна повторять имя пакета, но также должна быть информативной.

source: The synopsis functions as a phrase describing the package, not a complete sentence, so sentential punctuation is inappropriate: it does not need extra capital letters or a final period (full stop). It should also omit any initial indefinite or definite article — "a", "an", or "the". Thus for instance:
ru: Резюме представляет собой фразу, описывающую пакет, а не полное предложение, поэтому пунктуация, характерная для предложений, тут неуместна: дополнительные заглавные буквы или точка в конце (как знак полной остановки) не нужны. Также следует пропустить любой начальный неопределённый или определённый артикль &mdash; "a", "an" или "the". Таким образом, например:

source: Technically this is a noun phrase minus articles, as opposed to a verb phrase. A good heuristic is that it should be possible to substitute the package <replaceable>name</replaceable> and <replaceable>synopsis</replaceable> into this formula:
ru: Технически это именная фраза без артиклей в противоположность глагольной фразе. Хорошая эвристика состоит в том, что должно быть возможно подставить <replaceable>имя</replaceable> пакета вместо его <replaceable>резюме</replaceable> в следующую формулу:

source: The package <replaceable>name</replaceable> provides {a,an,the,some} <replaceable>synopsis</replaceable>.
ru: Пакет <replaceable>имя пакета</replaceable> предоставляет {a,an,the,some} <replaceable>резюме пакета</replaceable>.

source: Sets of related packages may use an alternative scheme that divides the synopsis into two parts, the first a description of the whole suite and the second a summary of the package's role within it:
ru: Наборы связанных пакетов могут использовать альтернативную схему, которая разделяет резюме на две части, на, во-первых, описание всего набора и, во-вторых, резюме роли конкретного пакета в этом наборе:

source: These synopses follow a modified formula. Where a package "<replaceable>name</replaceable>" has a synopsis "<replaceable>suite</replaceable> (<replaceable>role</replaceable>)" or "<replaceable>suite</replaceable> - <replaceable>role</replaceable>", the elements should be phrased so that they fit into the formula:
ru: Эти резюме следуют изменённой формуле. В ней пакет "<replaceable>имя пакета</replaceable>" имеет резюме "<replaceable>набор пакетов</replaceable> (<replaceable>роль</replaceable>)" или "<replaceable>набор пакетов</replaceable> - <replaceable>роль</replaceable>", элементы резюме должны быть сформулированы так, чтобы они подходили под следующую формулу:

source: The package <replaceable>name</replaceable> provides {a,an,the} <replaceable>role</replaceable> for the <replaceable>suite</replaceable>.
ru: Пакет <replaceable>имя пакета</replaceable> предоставляет {a,an,the} <replaceable>роль</replaceable> для <replaceable>набора пакетов</replaceable>.

source: The long description
ru: Длинное описание

source: The long description is the primary information available to the user about a package before they install it. It should provide all the information needed to let the user decide whether to install the package. Assume that the user has already read the package synopsis.
ru: Длинное описание является первичной информацией, доступной пользователю о пакете до того, как он его установит. Оно должно предоставлять всю информацию, которая необходима для того, чтобы пользователь мог решить устанавливать ему этот пакет или нет. Допускайте, что пользователь уже прочитал резюме пакета.
