Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: If the bug is real but it's caused by another package, just reassign the bug to the right package. If you don't know which package it should be reassigned to, you should ask for help on <link linkend="irc-channels">IRC</link> or on &email-debian-devel;. Please inform the maintainer(s) of the package you reassign the bug to, for example by Cc:ing the message that does the reassign to <email><replaceable>packagename</replaceable>@packages.debian.org</email> and explaining your reasons in that mail. Please note that a simple reassignment is <emphasis>not</emphasis> e-mailed to the maintainers of the package being reassigned to, so they won't know about it until they look at a bug overview for their packages.
ru: Если ошибка действительно имеет место, но она вызвана другим пакетом, просто переназначьте сообщение об ошибке тому пакету. Если вы не знаете, какому пакету следует переназначить сообщение об ошибке, вам следует попросить помощи в <link linkend="irc-channels">IRC</link> или в &email-debian-devel;. Пожалуйста, проинформируйте сопровождающего того пакета, которому вы переназначаете сообщение об ошибке, например, отправив копию сообщения для системы отслеживания ошибок, содержащего команды для переназначения, по адресу <email><replaceable>имя-пакета</replaceable>@packages.debian.org</email>, объясните ему причины в своём сообщении. Заметьте, что простое переназначение <emphasis>не</emphasis> пересылаетсясопровождающим пакета, которому вы переназначаете сообщение об ошибке, поэтому они не будет знать об этом до тех пор, пока они не посмотрят сводную информацию об ошибках в своих пакетах.

source: Sometimes you also have to adjust the severity of the bug so that it matches our definition of the severity. That's because people tend to inflate the severity of bugs to make sure their bugs are fixed quickly. Some bugs may even be dropped to wishlist severity when the requested change is just cosmetic.
ru: Иногда вам также необходимо изменить важность ошибки так, чтобы она соответствовала вашему определению её важности. Люди обычно склонны преувеличивать важность ошибок для того, чтобы их ошибки были быстрее исправлены. Важность некоторых ошибок может понижена до wishlist, если запрашиваемое изменение является скорее косметическим.

source: If the bug is real but the same problem has already been reported by someone else, then the two relevant bug reports should be merged into one using the merge command of the BTS. In this way, when the bug is fixed, all of the submitters will be informed of this. (Note, however, that emails sent to one bug report's submitter won't automatically be sent to the other report's submitter.) For more details on the technicalities of the merge command and its relative, the unmerge command, see the BTS control server documentation.
ru: Если ошибка действительно имеет место, но об этой же проблеме было сообщено кем-то ещё, то два релевантных сообщения должны быть объединены в одно с помощью команды merge. В этом случае если ошибка будет исправлена, все те, кто сообщил о ней, будут уведомлены об этом. (Тем не менее, заметьте, что сообщения, отправленные одному из тех, кто сообщил об ошибке, не будут автоматически перенаправлены остальным пользователям, которые тоже сообщили об ошибке.) Подробности о технической стороне команды merge и родственной ей команды unmerge, см. в документации по управляющему серверу системы отслеживания ошибок.

source: The bug submitter may have forgotten to provide some information, in which case you have to ask them for the required information. You may use the <literal>moreinfo</literal> tag to mark the bug as such. Moreover if you can't reproduce the bug, you tag it <literal>unreproducible</literal>. Anyone who can reproduce the bug is then invited to provide more information on how to reproduce it. After a few months, if this information has not been sent by someone, the bug may be closed.
ru: Пользователь, отправивший сообщение об ошибке, мог забыть предоставить какую-то информацию, в этом случае вам следует попросить их предоставить необходимую информацию. Вы можете использовать тег <literal>moreinfo</literal>, чтобы отметить сообщение об ошибке как требующее предоставления дополнительной информации. Более того, если вы не можете воспроизвести ошибку, вы можете пометить сообщение об ошибке тегом <literal>unreproducible</literal>. Это будет означать, что если кто-то может воспроизвести ошибку, то вы просите его предоставить вам дополнительную информацию о том, как воспроизвести эту ошибку. Через несколько месяцев, если эта дополнительная информация не была никем отправлена, сообщение об ошибке может быть закрыто.

source: If the bug is related to the packaging, you just fix it. If you are not able to fix it yourself, then tag the bug as <literal>help</literal>. You can also ask for help on &email-debian-devel; or &email-debian-qa;. If it's an upstream problem, you have to forward it to the upstream author. Forwarding a bug is not enough, you have to check at each release if the bug has been fixed or not. If it has, you just close it, otherwise you have to remind the author about it. If you have the required skills you can prepare a patch that fixes the bug and send it to the author at the same time. Make sure to send the patch to the BTS and to tag the bug as <literal>patch</literal>.
ru: Если ошибка касается создания пакета, вам следует её исправить. Если вы не можете сами исправить её, то отметьте сообщение об ошибке тегом <literal>help</literal>. Кроме того, вы можете попросить о помощи в &email-debian-devel; или &email-debian-qa;. Если это проблема основной ветки разработки, вам следует переслать сообщение об ошибке автору основной ветки. Простой пересылки сообщения об ошибке не достаточно, вам следует проверять каждый выпуск основной ветки на предмет исправления этой ошибки. Если ошибка была исправлена, вам нужно просто закрыть сообщение об ошибке, в противном случае вам следует напомнить автору об ошибке. Если у вас имеются требуемые навыки, вы можете подготовить заплату, исправляющую ошибку и отправить её автору основной ветки. Убедитесь, что вы отправили заплату в систему отслеживания ошибок и пометили сообщение об ошибке тегом <literal>patch</literal>.

source: If you have fixed a bug in your local copy, or if a fix has been committed to the VCS repository, you may tag the bug as <literal>pending</literal> to let people know that the bug is corrected and that it will be closed with the next upload (add the <literal>closes:</literal> in the <filename>changelog</filename>). This is particularly useful if you are several developers working on the same package.
ru: Если вы исправили ошибку в своей локальной копии пакета, либо если исправление было загружено в репозиторий системы управления версиями, вы можете отметить сообщение об ошибке тегом <literal>pending</literal>, что будет означать, что ошибка исправлена, и что сообщение об ошибке будет закрыто при следующей загрузке (добавьте пункт <literal>closes:</literal> в ваш файл <filename>changelog</filename>). Это особенно полезно, когда над одним и тем же пакетом работает несколько разработчиков.

source: Once a corrected package is available in the archive, the bug should be closed indicating the version in which it was fixed. This can be done automatically, read <xref linkend="upload-bugfix"/>.
ru: Как только исправленный пакет будет доступен в архиве, сообщение об ошибке должно быть закрыто с указанием версии, в которой ошибка была исправлена. Это может быть сделано автоматически, см. <xref linkend="upload-bugfix"/>.

source: When bugs are closed by new uploads
ru: Когда ошибки исправляются путём новых загрузок

source: As bugs and problems are fixed in your packages, it is your responsibility as the package maintainer to close these bugs. However, you should not close a bug until the package which fixes the bug has been accepted into the Debian archive. Therefore, once you get notification that your updated package has been installed into the archive, you can and should close the bug in the BTS. Also, the bug should be closed with the correct version.
ru: Когда ошибки и проблемы в ваших пакетах будут исправлены, вам как сопровождающему следует закрыть сообщения об этих ошибках. Тем не менее, вам не следует закрывать сообщение об ошибке до того момента, как пакет, содержащий исправление ошибки, будет принят в архив Debian. Следовательно, как только вы получите уведомление о том, что загруженный вами пакет был установлен в архив, вы можете и должны закрыть сообщение об ошибке в системе отслеживания ошибок. Кроме того, сообщение об ошибке должно быть закрыто с указанием правильно версии, содержащей исправление ошибки.

source: However, it's possible to avoid having to manually close bugs after the upload — just list the fixed bugs in your <filename>debian/changelog</filename> file, following a certain syntax, and the archive maintenance software will close the bugs for you. For example:
ru: Тем не менее, можно избежать необходимости ручного закрытия сообщений об ошибках после загрузки — просто перечислите ошибки в вашем файле <filename>debian/changelog</filename>, следуя определённым синтаксическим правилам, и ПО по сопровождению архива закроет соответствующие ошибки. Например:

source: Technically speaking, the following Perl regular expression describes how bug closing changelogs are identified:
ru: Технически говоря, следующее регулярное выражение Perl описывает то, как определяются журналы с закрытиями ошибок:

source: We prefer the <literal>closes: #<replaceable>XXX</replaceable></literal> syntax, as it is the most concise entry and the easiest to integrate with the text of the <filename>changelog</filename>. Unless specified different by the <literal>-v</literal>-switch to <command>dpkg-buildpackage</command>, only the bugs closed in the most recent changelog entry are closed (basically, exactly the bugs mentioned in the changelog-part in the <filename>.changes</filename> file are closed).
ru: Мы предпочитаем синтаксис <literal>closes: #<replaceable>XXX</replaceable></literal>, поскольку он является наиболее точным, также он проще в плане интеграции с текстом файла <filename>changelog</filename>. Если не указано обратное с помощью параметра <literal>-v</literal> для <command>dpkg-buildpackage</command>, будут закрыты только те сообщения об ошибках, которые указаны как закрытые в самой последней записи журнала изменений (по сути, будут закрыты именно те сообщения об ошибках, которые указаны в файле в разделе об изменениях в файле <filename>.changes</filename>).

source: Historically, uploads identified as <link linkend="nmu">non-maintainer upload (NMU)</link> were tagged <literal>fixed</literal> instead of being closed, but that practice was ceased with the advent of version-tracking. The same applied to the tag <literal>fixed-in-experimental</literal>.
ru: Исторически загрузки определяются как <link linkend="nmu">загрузки теми, кто не является сопровождающим (NMU)</link> отмечались тегом <literal>fixed</literal>, но не закрывались, но эта практика была прекращена с приходом отслеживания версий. То же самое справедливо и по отношению к тегу <literal>fixed-in-experimental</literal>.

source: If you happen to mistype a bug number or forget a bug in the changelog entries, don't hesitate to undo any damage the error caused. To reopen wrongly closed bugs, send a <literal>reopen <replaceable>XXX</replaceable></literal> command to the bug tracking system's control address, &email-bts-control;. To close any remaining bugs that were fixed by your upload, email the <filename>.changes</filename> file to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, where <replaceable>XXX</replaceable> is the bug number, and put Version: <replaceable>YYY</replaceable> and an empty line as the first two lines of the body of the email, where <replaceable>YYY</replaceable> is the first version where the bug has been fixed.
ru: Если вы неправильно введёте номер сообщения об ошибке или забудете указать этот номер в записи журнала изменений, не стесняйтесь исправить эту ошибку и её последствия. Чтобы заново открыть ошибочно закрытое сообщение об ошибке, отправьте команду <literal>reopen <replaceable>XXX</replaceable></literal> на адрес системы управления системы отслеживания ошибок, &email-bts-control;. Чтобы закрыть любое сообщение об ошибках, указанная в котором ошибка была исправлена в вашей загрузке, перешлите файл <filename>.changes</filename> на адрес <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>, вместо <replaceable>XXX</replaceable> укажите номер ошибки, также добавьте Version: <replaceable>YYY</replaceable> и пустую строку в качестве первых двух строк тела вашего сообщения, замените <replaceable>YYY</replaceable> на номер версии, в которой ошибка была исправлена.

source: Bear in mind that it is not obligatory to close bugs using the changelog as described above. If you simply want to close bugs that don't have anything to do with an upload you made, do it by emailing an explanation to <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. Do <emphasis role="strong">not</emphasis> close bugs in the changelog entry of a version if the changes in that version of the package don't have any bearing on the bug.
ru: Помните, что закрывать ошибки с помощью журнала изменений, как это описано выше, не является чем-то обязательным. Если вы просто хотите закрыть сообщения об ошибках, которые никак не касаются сделанной вами загрузки, закройте ошибку путём отправки вашего объяснения на адрес <email><replaceable>XXX</replaceable>-done@&bugs-host;</email>. <emphasis role="strong">Не</emphasis> закрывайте ошибки в записи журнала изменений какой-либо версии пакета, если изменения в этой версии пакета не имеют ничего общего с исправление этой ошибки.

source: For general information on how to write your changelog entries, see <xref linkend="bpp-debian-changelog"/>.
ru: Общую информацию о том, как писать журнал изменений, см. в разделе <xref linkend="bpp-debian-changelog"/>.

source: Handling security-related bugs
ru: Работа с ошибками, связанными с безопасностью

source: Due to their sensitive nature, security-related bugs must be handled carefully. The Debian Security Team exists to coordinate this activity, keeping track of outstanding security problems, helping maintainers with security problems or fixing them themselves, sending security advisories, and maintaining <literal>security.debian.org</literal>.
ru: Из-за того, что ошибки, связанные с безопасностью, обладают скорее некоторой чувствительной природой, с ними следует работать очень внимательно. Команда безопасности Debian существует для того, чтобы координировать эту работу, следить за серьёзными проблемами безопасности, помогать сопровождающим в их работе с проблемами безопасности или исправлять эти проблемы, отправлять рекомендации по безопасности и сопровождать <literal>security.debian.org</literal>.

source: Whether or not the bug is already public.
ru: Известно ли об этой ошибке широкой публике.

source: Which versions of the package are known to be affected by the bug. Check each version that is present in a supported Debian release, as well as <literal>testing</literal> and <literal>unstable</literal>.
ru: Какие версии пакета подвержены данной ошибке. Проверьте каждую версию, которая в настоящее время поддерживается выпуском Debian, а также <literal>тестируемый</literal> и <literal>нестабильный</literal> выпуски.

source: The nature of the fix, if any is available (patches are especially helpful)
ru: Суть исправления, если оно доступно (заплаты особенно полезны)

source: Any fixed packages that you have prepared yourself (send only the <filename>.diff.gz</filename> and <filename>.dsc</filename> files and read <xref linkend="bug-security-building"/> first)
ru: Любые исправленные пакеты, которые вы подготовили самостоятельно (отправьте только файлы <filename>.diff.gz</filename> и <filename>.dsc</filename> и сначала прочтите раздел <xref linkend="bug-security-building"/>)

source: Any assistance you can provide to help with testing (exploits, regression testing, etc.)
ru: Любая помощь, которую вы можете предоставить в плане тестирования (уязвимость, тестирование регрессий и т. д.)

source: Any information needed for the advisory (see <xref linkend="bug-security-advisories"/>)
ru: Любая информация, необходимая для рекомендации по безопасности (см. <xref linkend="bug-security-advisories"/>)

source: As the maintainer of the package, you have the responsibility to maintain it, even in the stable release. You are in the best position to evaluate patches and test updated packages, so please see the sections below on how to prepare packages for the Security Team to handle.
ru: Как сопровождающий пакетов вы ответственны за сопровождение своих пакетов даже в стабильном выпуске. Вы имеете лучшие возможности для оценки заплат и тестирования обновлённых пакетов, поэтому, пожалуйста, внимательно изучите приводимую ниже информацию о том, как подготовить пакеты для работы команды безопасности.

source: The Security Tracker
ru: Система отслеживания безопасности

source: The security team maintains a central database, the <ulink url="http://security-tracker.debian.org/">Debian Security Tracker</ulink>. This contains all public information that is known about security issues: which packages and versions are affected or fixed, and thus whether stable, testing and/or unstable are vulnerable. Information that is still confidential is not added to the tracker.
ru: Команда безопасности сопровождает центральную базу данных, <ulink url="http://security-tracker.debian.org/">систему отслеживания безопасности Debian</ulink>. Она содержит всю публично доступную информацию о том, что известно о проблемах безопасности: какие пакеты и версии подвержены проблемами, либо были исправлены, а также какие выпуски, стабильный, тестируемый и/или нестабильный, уязвимы. Конфиденциальная информация не добавляется в эту систему.

source: You can search it for a specific issue, but also on package name. Look for your package to see which issues are still open. If you can, please provide more information about those issues, or help to address them in your package. Instructions are on the tracker web pages.
ru: Вы можете производить поиск по конкретной проблеме или имени пакета. Посмотрите ваш пакет, чтобы узнать, какие проблемы всё ещё открыты. Если вы можете, предоставьте дополнительную информацию об этих проблемах, либо помогите решить их в вашем пакете. Все инструкции доступны на страницах системы отслеживания проблем.

source: Confidentiality
ru: Конфиденциальность

source: Unlike most other activities within Debian, information about security issues must sometimes be kept private for a time. This allows software distributors to coordinate their disclosure in order to minimize their users' exposure. Whether this is the case depends on the nature of the problem and corresponding fix, and whether it is already a matter of public knowledge.
ru: В отличии от большей части другой деятельности, которая происходит в Debian, информация о проблемах безопасности иногда держится в секрете в течении некоторого времени. Это позволяет поставщикам ПО координировать раскрытие этой информации, чтобы минимизировать опасность для своих пользователей. Временное закрытие информации об уязвимости зависит от природы проблемы и соответствующего исправления, а также от того, находится ли уже информация об уязвимости в открытом доступе.

source: There are several ways developers can learn of a security problem:
ru: Разработчики могут узнать о проблемах безопасности из следующих источников:

source: they notice it on a public forum (mailing list, web site, etc.)
ru: они могут найти упоминание проблемы на публичном форуме (списке рассылки, веб-сайте и т. д.)

source: someone files a bug report
ru: кто-то отправляет отчёт об ошибке

source: someone informs them via private email
ru: кто-то информирует через частную почту

source: In the first two cases, the information is public and it is important to have a fix as soon as possible. In the last case, however, it might not be public information. In that case there are a few possible options for dealing with the problem:
ru: В первых двух случаях информация публична, важно подготовить исправление ошибки как можно раньше. Тем не менее, в последнем случае информация об ошибке может не быть публичной. Тогда при работе с проблемой возможны несколько вариантов действий:

source: If the security exposure is minor, there is sometimes no need to keep the problem a secret and a fix should be made and released.
ru: Если проблема безопасности не значительна, иногда нет необходимости скрывать информацию об этой проблеме, следует подготовить исправление и выпустить его.

source: If the problem is severe, it is preferable to share the information with other vendors and coordinate a release. The security team keeps in contact with the various organizations and individuals and can take care of that.
ru: Если проблема относится к серьёзным проблемам, желательно сообщить о ней другим поставщикам и скоординировать выпуск. Команда безопасности постоянно находится на связи с различными организациями и индивидами, и заботится о распространении информации и координации.

source: In all cases if the person who reports the problem asks that it not be disclosed, such requests should be honored, with the obvious exception of informing the security team in order that a fix may be produced for a stable release of Debian. When sending confidential information to the security team, be sure to mention this fact.
ru: Если тот, кто сообщает о проблеме, просит не раскрывать её, то в любом случае такой запрос следует уважать, конечно, это не касается информирования команды безопасности с целью подготовки исправления для стабильного выпуска Debian. При отправка конфиденциальной информации команде безопасности, обязательно упомяните о полученной просьбе.

source: Please note that if secrecy is needed you may not upload a fix to <literal>unstable</literal> (or anywhere else, such as a public VCS repository). It is not sufficient to obfuscate the details of the change, as the code itself is public, and can (and will) be examined by the general public.
ru: Заметьте, что если требуется сохранить тайну, то вы не можете загрузить исправление в <literal>нестабильный</literal> выпуск (или куда-либо ещё, например, в публичный репозиторий системы управления версиями). Запутывания информации о подробностях изменения не достаточно, поскольку сам код доступен общественности и может быть (и будет) просмотрен остальными людьми.

source: There are two reasons for releasing information even though secrecy is requested: the problem has been known for a while, or the problem or exploit has become public.
ru: Однако имеются две причины выпускать информацию даже в том случае, если было запрошено этого не делать: проблема уже была известна в течении некоторого времени, либо проблема или эксплоит доступны публично.

source: The Security Team has a PGP-key to enable encrypted communication about sensitive issues. See the <ulink url="http://www.debian.org/security/faq#contact">Security Team FAQ</ulink> for details.
ru: Команда безопасности для общения по поводу чувствительных вопросов использует закодированную при помощи ключа PGP переписку. Подробности см. в <ulink url="http://www.debian.org/security/faq#contact">ЧаВО команды безопасности</ulink>.

source: Security Advisories
ru: Рекомендации по безопасности
