Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Maintainer scripts include the files <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> and <filename>debian/postrm</filename>. These scripts take care of any package installation or deinstallation setup which isn't handled merely by the creation or removal of files and directories. The following instructions supplement the <ulink url="&url-debian-policy;">Debian Policy</ulink>.
ru: Сценарии сопровождающих включают в себя файлы <filename>debian/postinst</filename>, <filename>debian/preinst</filename>, <filename>debian/prerm</filename> и <filename>debian/postrm</filename>. Эти сценарии занимаются настройкой установки или удаления любого пакета, которые не обрабатываются простым созданием или удалением файлов и каталогов. Следующие инструкции дополняют <ulink url="&url-debian-policy;">Политику Debian</ulink>.

source: Maintainer scripts must be idempotent. That means that you need to make sure nothing bad will happen if the script is called twice where it would usually be called once.
ru: Сценарии сопровождающего должны быть идемпотентны. Это означает, что вам следует убедиться, что не произойдёт ничего плохого в том случае, когда сценарий будет вызван дважды, хотя обычно он вызывается только один раз.

source: Standard input and output may be redirected (e.g. into pipes) for logging purposes, so don't rely on them being a tty.
ru: Стандартные ввод и вывод могут быть перенаправлены (напр., конвейерами) с целью записи журнала для отладки, поэтому вам не следует считать, что они представляют собой лишь tty.

source: All prompting or interactive configuration should be kept to a minimum. When it is necessary, you should use the <systemitem role="package">debconf</systemitem> package for the interface. Remember that prompting in any case can only be in the <literal>configure</literal> stage of the <filename>postinst</filename> script.
ru: Все подсказки и интерактивные настройки должны быть сведены к минимуму. Когда это необходимо, для предоставления интерфейса следует использовать пакет <systemitem role="package">debconf</systemitem>. Помните, что подсказки в любом случае могут быть выведены лишь на этапе <literal>настройки</literal> сценария <filename>postinst</filename>.

source: Keep the maintainer scripts as simple as possible. We suggest you use pure POSIX shell scripts. Remember, if you do need any bash features, the maintainer script must have a bash shebang line. POSIX shell or Bash are preferred to Perl, since they enable <systemitem role="package">debhelper</systemitem> to easily add bits to the scripts.
ru: Делайте сценарии сопровождающего насколько простыми, насколько это возможно. Мы предлагаем использовать чистые сценарии оболочки POSIX. Помните, если вам нужны какие-либо возможности bash, сценарий сопровождающего должен содержать строку, объявляющую использование bash. Оболочка POSIX или Bash предпочтительны по отношению к Perl, поскольку они позволяют <systemitem role="package">debhelper</systemitem> легко добавлять что-то новое в эти сценарии.

source: If you change your maintainer scripts, be sure to test package removal, double installation, and purging. Be sure that a purged package is completely gone, that is, it must remove any files created, directly or indirectly, in any maintainer script.
ru: Если вы изменяете ваши сценарии сопровождающего, проверьте удаление пакета, двойную установку и очистку. Убедитесь, что очищенный пакет убран полностью, то есть, очистка должна удалить любые напрямую или косвенно созданные любым сценарием сопровождающего файлы.

source: If you need to check for the existence of a command, you should use something like
ru: Если вам необходимо проверить существование команды, используйте что-то вроде этого:

source: If you don't wish to hard-code the path of a command in your maintainer script, the following POSIX-compliant shell function may help:
ru: Если вы не хотите указывать точный путь команды в вашем сценарии сопровождающего, вам может быть полезна следующая POSIX-совместимая функция:

source: You can use this function to search <varname>$PATH</varname> for a command name, passed as an argument. It returns true (zero) if the command was found, and false if not. This is really the most portable way, since <literal>command -v</literal>, <command>type</command>, and <command>which</command> are not POSIX.
ru: Вы можете использовать эту функцию для поиска <varname>$PATH</varname> для имения команды, переданной в качестве аргумента. Она возвращает истинное значение (ноль), если команда была найдена, и ложь, если нет. В действительности, это наиболее переносимый способ, поскольку <literal>command -v</literal>, <command>type</command> и <command>which</command> не совместимы с POSIX.

source: While <command>which</command> is an acceptable alternative, since it is from the required <systemitem role="package">debianutils</systemitem> package, it's not on the root partition. That is, it's in <filename>/usr/bin</filename> rather than <filename>/bin</filename>, so one can't use it in scripts which are run before the <filename>/usr</filename> partition is mounted. Most scripts won't have this problem, though.
ru: Хотя <command>which</command> является допустимой альтернативой, так как она поставляется в требуемом пакете <systemitem role="package">debianutils</systemitem>, она находится не на корневом разделе. То есть, она располагается в <filename>/usr/bin</filename>, а не в <filename>/bin</filename>, поэтому её нельзя использовать в сценариях, которые запускаются до монтирования раздела <filename>/usr</filename>. Хотя, большинство сценариев не имеют такой проблемы.

source: Configuration management with <systemitem role="package">debconf</systemitem>
ru: Управление настройкой с помощью <systemitem role="package">debconf</systemitem>

source: <systemitem role="package">Debconf</systemitem> is a configuration management system which can be used by all the various packaging scripts (<filename>postinst</filename> mainly) to request feedback from the user concerning how to configure the package. Direct user interactions must now be avoided in favor of <systemitem role="package">debconf</systemitem> interaction. This will enable non-interactive installations in the future.
ru: <systemitem role="package">Debconf</systemitem> представляет собой систему управления настройкой, которая может использоваться всеми различными сценариями пакета (в основном <filename>postinst</filename>) для запроса ответной реакции пользователя касательно того, как настроить пакет. Следует избегать прямых взаимодействий с пользователем в пользу взаимодействия через <systemitem role="package">debconf</systemitem>. В будущем это позволит осуществлять неинтерактивные установки.

source: Debconf is a great tool but it is often poorly used. Many common mistakes are listed in the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> man page. It is something that you must read if you decide to use debconf. Also, we document some best practices here.
ru: Debconf является превосходным инструментом, но часто он плохо используется. Многие общие ошибки приведены на странице руководства <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>. Вам следует прочитать это руководство, если вы решили использовать debconf. Кроме этого, здесь мы приводим ниже лучшие практики использования этого инструмента.

source: These guidelines include some writing style and typography recommendations, general considerations about debconf usage as well as more specific recommendations for some parts of the distribution (the installation system for instance).
ru: Эти принципы включают некоторые рекомендации по типографии и стилю письма, общие соображения об использовании debconf, а также более конкретные рекомендации для некоторых частей дистрибутива (например, системы установки).

source: Do not abuse debconf
ru: Не злоупотребляйте debconf

source: Since debconf appeared in Debian, it has been widely abused and several criticisms received by the Debian distribution come from debconf abuse with the need of answering a wide bunch of questions before getting any little thing installed.
ru: Поскольку debconf возник в Debian, им часто злоупотребляют, и дистрибутив Debian получил изрядную долю критики за злоупотребление debconf необходимостью отвечать на большое количество вопросов для установки даже очень небольшого пакета.

source: Keep usage notes to what they belong: the <filename>NEWS.Debian</filename>, or <filename>README.Debian</filename> file. Only use notes for important notes which may directly affect the package usability. Remember that notes will always block the install until confirmed or bother the user by email.
ru: Оставьте сообщения об использовании там, где они должны быть: в файлах <filename>NEWS.Debian</filename> или <filename>README.Debian</filename>. Используйте сообщения только для важных сообщений, которые могут напрямую оказать влияние на использование и работу пакета. Помните, что сообщения всегда блокируют установку до явного подтверждения пользователя, либо надоедают пользователю по электронной почте.

source: Carefully choose the questions priorities in maintainer scripts. See <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> for details about priorities. Most questions should use medium and low priorities.
ru: Аккуратно выбирайте приоритет вопросов в сценариях сопровождающего. Подробную информацию о приоритетах см. в <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>. Большинство вопросов должны использовать средний и низкий приоритеты.

source: General recommendations for authors and translators
ru: Общие рекомендации для авторов и переводчиков

source: Write correct English
ru: Пишите на правильном английском

source: Most Debian package maintainers are not native English speakers. So, writing properly phrased templates may not be easy for them.
ru: Большинство сопровождающих Debian не являются носителями английского языка. Поэтому написание правильно сформулированных шаблонов может быть для них нелегким делом.

source: Please use (and abuse) &email-debian-l10n-english; mailing list. Have your templates proofread.
ru: Используйте список рассылки &email-debian-l10n-english; (и злоупотребляйте им). Пусть ваши шаблоны будут вычитаны.

source: Badly written templates give a poor image of your package, of your work... or even of Debian itself.
ru: Плохо написанные шаблоны создают плохое представление о вашем пакете, вашей работе... и даже самом Debian.

source: Avoid technical jargon as much as possible. If some terms sound common to you, they may be impossible to understand for others. If you cannot avoid them, try to explain them (use the extended description). When doing so, try to balance between verbosity and simplicity.
ru: Избегайте технического жаргона насколько это возможно. Если некоторые термины звучат знакомо для вам, они всё равно могут быть непонятны остальным. Если вы не можете избежать этих терминов, попытайтесь объяснить их (используйте подробное описание). Если вы пишете описание, пытайтесь балансировать на грани подробности и простоты.

source: Be kind to translators
ru: Будьте добры к переводчикам

source: Debconf templates may be translated. Debconf, along with its sister package <command>po-debconf</command> offers a simple framework for getting templates translated by translation teams or even individuals.
ru: Шаблоны debconf могут быть переведены. Debconf, а также его родственный пакет <command>po-debconf</command>, предлагают простую инфраструктуру для перевода шаблонов командами переводчиков или даже отдельными людьми.

source: Please use gettext-based templates. Install <systemitem role="package">po-debconf</systemitem> on your development system and read its documentation (<command>man po-debconf</command> is a good start).
ru: Используйте шаблоны на основе gettext. Установите <systemitem role="package">po-debconf</systemitem> в вашу систему, используемую для разработки, и прочтите документацию этого пакета (<command>man po-debconf</command> является хорошим началом).

source: Avoid changing templates too often. Changing templates text induces more work to translators which will get their translation fuzzied. A fuzzy translation is a string for which the original changed since it was translated, therefore requiring some update by a translator to be usable. When changes are small enough, the original translation is kept in PO files but marked as <literal>fuzzy</literal>.
ru: Избегайте частого изменения шаблонов. Изменение текста шаблона приводит к дополнительной работе для переводчиков, поскольку их перевод будет отмечен как неясный. Неясный перевод представляет собой строку, оригинальная строка которой была изменена с момента перевода, следовательно, от переводчика требуется обновление этой строки, чтобы она снова могла использоваться. Когда изменения достаточно малы, оригинальный перевод сохраняется в файлах PO, но отмечается как <literal>неясный</literal>.

source: If you plan to do changes to your original templates, please use the notification system provided with the <systemitem role="package">po-debconf</systemitem> package, namely the <command>podebconf-report-po</command>, to contact translators. Most active translators are very responsive and getting their work included along with your modified templates will save you additional uploads. If you use gettext-based templates, the translator's name and e-mail addresses are mentioned in the PO files headers and will be used by <command>podebconf-report-po</command>.
ru: Если вы планируете изменить ваши оригинальные шаблоны, для связи с переводчиками используйте систему оповещения, предоставляемую пакетом <systemitem role="package">po-debconf</systemitem>, а именно <command>podebconf-report-po</command>. Наиболее активные переводчики очень отзывчивы, и включение их работы вместе с вашими изменёнными шаблонами позволит избежать вам дополнительных загрузок. Если вы используете шаблоны на основе gettext, имя переводчика и его адрес электронной почты указаны в заголовках PO-файлов и будут использоваться командой <command>podebconf-report-po</command>.

source: A recommended use of that utility is:
ru: Рекомендованное использование этой утилиты:

source: This command will first synchronize the PO and POT files in <filename>debian/po</filename> with the templates files listed in <filename>debian/po/POTFILES.in</filename>. Then, it will send a call for new translations, in the &email-debian-i18n; mailing list. Finally, it will also send a call for translation updates to the language team (mentioned in the <literal>Language-Team</literal> field of each PO file) as well as the last translator (mentioned in <literal>Last-translator</literal>).
ru: Эта команда, во-первых, синхронизирует PO-файлы и файлы POT в <filename>debian/po</filename> с файлами шаблонов, указанными в <filename>debian/po/POTFILES.in</filename>. Далее, она вышлет сообщение с призывом подготовить новые переводы в список рассылки &email-debian-i18n;. Наконец, она также вышлет сообщение с призывом обновить переводы команде переводчиков (указана в поле <literal>Language-Team</literal> в каждом PO-файле), а также последнему переводчику (указан в поле <literal>Last-translator</literal>).

source: Giving a deadline to translators is always appreciated, so that they can organize their work. Please remember that some translation teams have a formalized translate/review process and a delay lower than 10 days is considered as unreasonable. A shorter delay puts too much pressure on translation teams and should be kept for very minor changes.
ru: Всегда ценится точный срок, отведённый для работы над переводом, чтобы переводчики могли организовать свою работу. Помните, что некоторые команды переводчиков используют формализованный процесс перевода/проверки, и задержка менее 10 дней считается чрезвычайно короткой. Более короткая задержка слишком сильно давит на команды переводчиков и должна устанавливаться только для очень небольших изменений.

source: If in doubt, you may also contact the translation team for a given language (debian-l10n-xxxxx@&lists-host;), or the &email-debian-i18n; mailing list.
ru: Если у вас возникли сомнения, вы также можете связаться с командой перевода данного языка (debian-l10n-xxxxx@&lists-host;) или списком рассылки &email-debian-i18n;.

source: Unfuzzy complete translations when correcting typos and spelling
ru: Отменяйте статус неясных строк когда исправляете опечатки или орфографию

source: When the text of a debconf template is corrected and you are <emphasis role="strong">sure</emphasis> that the change does <emphasis role="strong">not</emphasis> affect translations, please be kind to translators and <emphasis>unfuzzy</emphasis> their translations.
ru: Когда текст шаблона debconf был изменён, и вы <emphasis role="strong">уверены</emphasis>, что это изменение <emphasis role="strong">не</emphasis> влияет на переводы, будьте добры по отношению к переводчикам и <emphasis>отмените статус неясных строк</emphasis> для их переводов.

source: If you don't do so, the whole template will not be translated as long as a translator will send you an update.
ru: Если вы не сделаете этого, весь шаблон не будет переведён пока переводчик не вышлет вам обновление.

source: To <emphasis>unfuzzy</emphasis> translations, you can use <command>msguntypot</command> (part of the <systemitem role="package">po4a</systemitem> package).
ru: Чтобы <emphasis>отменить статус неясных строк</emphasis> для переводов, вы можете использовать <command>msguntypot</command> (часть пакета <systemitem role="package">po4a</systemitem>).

source: Regenerate the POT and PO files.
ru: Создание файлов POT и PO заново.

source: Make a copy of the POT file.
ru: Создание копии POT-файла.

source: Make a copy of all the PO files.
ru: Создание копии всех PO-файлов.

source: Change the debconf template files to fix the typos.
ru: Изменение файлов шаблона debconf для исправления ошибок.

source: Regenerate the POT and PO files (again).
ru: Создание файлов POT и PO заново (опять).

source: At this point, the typo fix fuzzied all the translations, and this unfortunate change is the only one between the PO files of your main directory and the one from the fridge. Here is how to solve this.
ru: Сейчас исправление опечатки привело к тому, что все переводы были отмечены как неясные, и это несчастное изменение является единственным различием между файлами PO вашего основного каталога и сохранёнными во временном каталоге файлами. Вот как решить эту проблема.

source: Discard fuzzy translation, restore the ones from the fridge.
ru: Отбросьте неясный перевод, восстановите перевод из сохранённых во временном каталоге файлов.

source: Manually merge the PO files with the new POT file, but taking the useless fuzzy into account.
ru: Вручную слейте файлы PO с новым POT-файлов, но учтите бесполезные неясности.

source: Clean up.
ru: Очистите.

source: Do not make assumptions about interfaces
ru: Не допускайте ничего по поводу интерфейсов

source: Templates text should not make reference to widgets belonging to some debconf interfaces. Sentences like <emphasis>If you answer Yes...</emphasis> have no meaning for users of graphical interfaces which use checkboxes for boolean questions.
ru: Текст шаблона не должен отсылать к виджетам, относящимся к каким-либо интерфейсам debconf. Предложения вида <emphasis>If you answer Yes...</emphasis> не имеют смысла для пользователей графических интерфейсов, которые используют флажки для вопросов с двумя вариантами ответа.

source: String templates should also avoid mentioning the default values in their description. First, because this is redundant with the values seen by the users. Also, because these default values may be different from the maintainer choices (for instance, when the debconf database was preseeded).
ru: Строки шаблонов должны также избегать в своём описании упоминания значений по умолчанию. Во-первых, это излишне, так как значения видны пользователям. Также это излишне потому, что значения по умолчанию могут различаться в зависимости от выбора сопровождающего (например, когда база данных debconf была автоматизирована).

source: More generally speaking, try to avoid referring to user actions. Just give facts.
ru: Вообще говоря, попытайтесь избежать указания на действия пользователя. Просто представляйте факты.

source: Do not use first person
ru: Не используйте первое лицо

source: You should avoid the use of first person (<emphasis>I will do this...</emphasis> or <emphasis>We recommend...</emphasis>). The computer is not a person and the Debconf templates do not speak for the Debian developers. You should use neutral construction. Those of you who already wrote scientific publications, just write your templates like you would write a scientific paper. However, try using active voice if still possible, like <emphasis>Enable this if ...</emphasis> instead of <emphasis>This can be enabled if...</emphasis>.
ru: Вам следует избегать использования первого лица (<emphasis>I will do this...</emphasis> или <emphasis>We recommend...</emphasis>). Компьютер не является личностью, шаблоны debconf не говорят за разработчиков Debian. Вам следует использовать нейтральные конструкции. Те их вас, кто уже писал ранее научные работы, просто пишите ваши шаблоны также, как вы писали бы научную статью. Тем не менее, попытайтесь использовать активный залог, если это возможно, например <emphasis>Enable this if ...</emphasis> вместо <emphasis>This can be enabled if...</emphasis>.

source: Be gender neutral
ru: Будьте нейтральны в гендерном отношении

source: The world is made of men and women. Please use gender-neutral constructions in your writing.
ru: Мир состоит из мужчин и женщин. Используйте при написании нейтральные в отношении гендера конструкции.

source: Templates fields definition
ru: Определение полей шаблонов

source: This part gives some information which is mostly taken from the <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry> manual page.
ru: Эта часть содержит информацию, которая по большей части заимствована из страницы руководства <citerefentry> <refentrytitle>debconf-devel</refentrytitle> <manvolnum>7</manvolnum> </citerefentry>.

source: Type
ru: Тип

source: Results in a free-form input field that the user can type any string into.
ru: Создаёт поле свободного ввода, в которое пользователь может ввести любую строку.

source: Prompts the user for a password. Use this with caution; be aware that the password the user enters will be written to debconf's database. You should probably clean that value out of the database as soon as is possible.
ru: Запрашивает у пользователя пароль. Используйте с осторожностью; помните, что пароль, вводимый пользователем, будет записан в базу данных debconf. Вероятно, вам следует как можно скорее очистить это значение в базе данных.

source: A true/false choice. Remember: true/false, <emphasis role="strong">not yes/no</emphasis>...
ru: Выбор истинно/ложно. Помните: истинно/ложно, <emphasis role="strong">а не да/нет</emphasis>...

source: A choice between one of a number of values. The choices must be specified in a field named 'Choices'. Separate the possible values with commas and spaces, like this: <literal>Choices: yes, no, maybe</literal>.
ru: Выбор одного значения из нескольких предложенных. Выбор должен быть определён в поле с именем 'Choices'. Разделите возможные значения запятыми и пробелами, например так: <literal>Choices: yes, no, maybe</literal>.
