Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: The long description should consist of full and complete sentences.
ru: Длинное описание должно состоять из полных и законченных предложений.

source: The first paragraph of the long description should answer the following questions: what does the package do? what task does it help the user accomplish? It is important to describe this in a non-technical way, unless of course the audience for the package is necessarily technical.
ru: Первый абзац длинного описания должен содержать ответ на следующие вопросы: кто делает этот пакет? какие задачи он помогает решить пользователю? Важно описать это без использования технических терминов, если, конечно, аудиторией данного пакета не являются с необходимостью технически подкованные пользователи.

source: The following paragraphs should answer the following questions: Why do I as a user need this package? What other features does the package have? What outstanding features and deficiencies are there compared to other packages (e.g., if you need X, use Y instead)? Is this package related to other packages in some way that is not handled by the package manager (e.g., this is the client for the foo server)?
ru: Следующие абзацы должны давать ответы на следующие вопросы: Почему я как пользователь нуждаюсь в этом пакете? Какими другими возможностями обладает данный пакет? Каковы его выдающиеся особенности и недостатки по сравнению с другими пакетами (напр., если вам нужен X, используйте вместо него Y)? Связан ли этот пакет с другими пакетами так, что эта связь не обрабатывается менеджером пакетов (напр., это клиент для сервера foo)?

source: Be careful to avoid spelling and grammar mistakes. Ensure that you spell-check it. Both <command>ispell</command> and <command>aspell</command> have special modes for checking <filename>debian/control</filename> files:
ru: Будьте внимательны, избегайте орфографических и грамматических ошибок. Проверьте описание на ошибки. И <command>ispell</command>, и <command>aspell</command> имеют специальные режимы для проверки файлов <filename>debian/control</filename>:

source: Users usually expect these questions to be answered in the package description:
ru: Обычно пользователи ожидают найти в описании пакета ответы на следующие вопросы:

source: What does the package do? If it is an add-on to another package, then the short description of the package we are an add-on to should be put in here.
ru: Что этот пакет делает? Если он является дополнением для другого пакета, то в описании следует поместить краткое описание того пакета, дополнением которого является данный пакет.

source: Why should I want this package? This is related to the above, but not the same (this is a mail user agent; this is cool, fast, interfaces with PGP and LDAP and IMAP, has features X, Y, and Z).
ru: Почему я хочу получить этот пакет? Ответ на этот вопрос связан с ответом на предыдущий вопрос, но это разные вопросы (это клиент электронной почты; он классный, быстрый, работает с PGP и LDAP, а также с IMAP, он имеет X, Y и Z).

source: If this package should not be installed directly, but is pulled in by another package, this should be mentioned.
ru: Если этот пакет не должен быть установлен напрямую, но тянется за другим пакетом, это обстоятельство должно быть явно указано.

source: If the package is <literal>experimental</literal>, or there are other reasons it should not be used, if there are other packages that should be used instead, it should be here as well.
ru: Если пакет является <literal>экспериментальным</literal>, либо имеются другие причины, по которым этот пакет не следуем использовать, если имеются другие пакеты, которые следует использовать вместо данного, это также должно быть отдельно указано.

source: How is this package different from the competition? Is it a better implementation? more features? different features? Why should I choose this package.
ru: Чем этот пакет отличается от других таких же пакетов? Является он этот пакет лучшей реализацией? имеет больше возможностей? имеет другие возможности? Почему я должен выбрать этот пакет.

source: Upstream home page
ru: Домашняя страница основной ветки разработки

source: We recommend that you add the URL for the package's home page in the <literal>Homepage</literal> field of the <literal>Source</literal> section in <filename>debian/control</filename>. Adding this information in the package description itself is considered deprecated.
ru: Мы рекомендуем вам добавить ссылку на домашнюю страницу пакета в поле <literal>Homepage</literal> раздела <literal>Source</literal> в файле <filename>debian/control</filename>. Добавление этой информации в само описание пакета считается устаревшей нормой.

source: Version Control System location
ru: Размещение системы контроля версий

source: There are additional fields for the location of the Version Control System in <filename>debian/control</filename>.
ru: В файле <filename>debian/control</filename> имеются дополнительные поля для указания размещения системы контроля версий.

source: Value of this field should be a <literal>http://</literal> URL pointing to a web-browsable copy of the Version Control System repository used to maintain the given package, if available.
ru: Значением этого поля должна быть ссылка вида <literal>http://</literal>, указывающая на копию репозитория системы управления версиями, используемой для сопровождения данного пакета, которую можно просмотреть в веб-браузере, если таковая имеется.

source: The information is meant to be useful for the final user, willing to browse the latest work done on the package (e.g. when looking for the patch fixing a bug tagged as <literal>pending</literal> in the bug tracking system).
ru: Подразумевается, что данная информация будет полезна для конечного пользователя, который захочет ознакомиться с последней работой, связанной с этим пакетом (напр., захочет найти заплату для исправления ошибки, обозначенной с системе отслеживания ошибок тегом <literal>pending</literal>).

source: Value of this field should be a string identifying unequivocally the location of the Version Control System repository used to maintain the given package, if available. <literal>*</literal> identify the Version Control System; currently the following systems are supported by the package tracking system: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). It is allowed to specify different VCS fields for the same package: they will all be shown in the PTS web interface.
ru: Значением этого поля должна быть строка, однозначно определяющая размещение репозитория системы контроля версий, используемого для сопровождения данного пакета, если таковая имеется. <literal>*</literal> определяет систему управления версиями; в настоящее время системой отслеживания пакетов поддерживаются следующие системы: <literal>arch</literal>, <literal>bzr</literal> (Bazaar), <literal>cvs</literal>, <literal>darcs</literal>, <literal>git</literal>, <literal>hg</literal> (Mercurial), <literal>mtn</literal> (Monotone), <literal>svn</literal> (Subversion). Разрешается добавлять разные поля систем управления версиями для одного и того же пакета: они будут показаны в веб-интерфейсе системы отслеживания пакетов.

source: The information is meant to be useful for a user knowledgeable in the given Version Control System and willing to build the current version of a package from the VCS sources. Other uses of this information might include automatic building of the latest VCS version of the given package. To this end the location pointed to by the field should better be version agnostic and point to the main branch (for VCSs supporting such a concept). Also, the location pointed to should be accessible to the final user; fulfilling this requirement might imply pointing to an anonymous access of the repository instead of pointing to an SSH-accessible version of the same.
ru: Подразумевается, что эта информация будет полезна пользователю, которых осведомлён о принципах работы данной системы управления версиями и желает собрать текущую версию пакета из исходного кода, размещённого там. Другие способы использования этой информации могут включать автоматическую сборку последней версии данного пакета из системы управления версиями. Для этого размещение, указанное в данном поле, не должно иметь привязку к версии и должно указывать на основную ветку (это касается систем управления версиями, поддерживающих эту возможность). Кроме того, указываемое размещение должно быть доступно конечному пользователю; для выполнения этого требования может потребоваться указание на анонимный доступ к репозиторию вместо указания версии, доступной через SSH.

source: In the following example, an instance of the field for a Subversion repository of the <systemitem role="package">vim</systemitem> package is shown. Note how the URL is in the <literal>svn://</literal> scheme (instead of <literal>svn+ssh://</literal>) and how it points to the <filename>trunk/</filename> branch. The use of the <literal>Vcs-Browser</literal> and <literal>Homepage</literal> fields described above is also shown.
ru: В следующем примере демонстрируется пакет <systemitem role="package">vim</systemitem> в соответствующем поле которого указан репозиторий Subversion. Заметьте, что URL приведён по схеме <literal>svn://</literal> (а не по схеме <literal>svn+ssh://</literal>), а также то, что указана ветвь <filename>trunk/</filename>. Также демонстрируется использование полей <literal>Vcs-Browser</literal> и <literal>Homepage</literal>, описанных выше.

source: Best practices for <filename>debian/changelog</filename>
ru: Лучшие практики для <filename>debian/changelog</filename>

source: The following practices supplement the <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Policy on changelog files</ulink>.
ru: Следующие практики дополняют <ulink url="&url-debian-policy;ch-docs.html#s-changelogs">Политику о файлах изменений</ulink>.

source: Writing useful changelog entries
ru: Написание полезных пунктов файла изменений

source: The changelog entry for a package revision documents changes in that revision, and only them. Concentrate on describing significant and user-visible changes that were made since the last version.
ru: Записи в файле изменений ревизии пакета описывают изменения данной ревизии и только их. Сосредоточьтесь на описании существенных и заметных для пользователя изменений, которые были произведены с момента выпуска последней версии.

source: Focus on <emphasis>what</emphasis> was changed — who, how and when are usually less important. Having said that, remember to politely attribute people who have provided notable help in making the package (e.g., those who have sent in patches).
ru: Обратите внимание на то, <emphasis>что</emphasis> было изменено &mdash; кто, как и когда обычно менее важно. Указав это, не забудьте вежливо указать людей, которые оказали заметную помощь в создании пакета (напр., тех, что выслал заплаты).

source: There's no need to elaborate the trivial and obvious changes. You can also aggregate several changes in one entry. On the other hand, don't be overly terse if you have undertaken a major change. Be especially clear if there are changes that affect the behaviour of the program. For further explanations, use the <filename>README.Debian</filename> file.
ru: Нет необходимости указывать тривиальные и очевидные изменения. Также вы можете объединять несколько изменений в одну запись. С другой стороны, не будьте чересчур кратки, если внесли крупное изменение. Будьте особенно ясны, если были произведены изменения, которые оказывают влияние на поведение программы. Для указания дальнейших объяснений используйте файл <filename>README.Debian</filename>.

source: Use common English so that the majority of readers can comprehend it. Avoid abbreviations, tech-speak and jargon when explaining changes that close bugs, especially for bugs filed by users that did not strike you as particularly technically savvy. Be polite, don't swear.
ru: Используйте общепринятый вариант английского языка, чтобы большинство читателей смогли вас понять. Избегайте аббревиатур, технического языка и жаргона, когда вы описываете изменения, закрывающие ошибки, особенно это касается ошибок, о которых сообщили пользователи, и которые не кажутся вам в каком-то особом смысле технически сложными. Будьте вежливы, не ругайтесь.

source: It is sometimes desirable to prefix changelog entries with the names of the files that were changed. However, there's no need to explicitly list each and every last one of the changed files, especially if the change was small or repetitive. You may use wildcards.
ru: Иногда желательно указать в начале записи об изменениях имена файлов, которые были изменены. Тем не менее, нет необходимости явно указывать каждый изменённый файл, особенно если изменения были небольшими или повторяющимися. Используйте шаблоны с метасимволами.

source: When referring to bugs, don't assume anything. Say what the problem was, how it was fixed, and append the closes: #nnnnn string. See <xref linkend="upload-bugfix"/> for more information.
ru: Если вы ссылаетесь на ошибки, не предполагайте у пользователей какого-либо знания. Сообщите, в чём заключалась проблема, как она была исправлена, и добавьте строку closes: #nnnnn. Дополнительную информацию см. в <xref linkend="upload-bugfix"/>.

source: Common misconceptions about changelog entries
ru: Распространённые неправильные представления о записях об изменениях

source: The changelog entries should <emphasis role="strong">not</emphasis> document generic packaging issues (Hey, if you're looking for foo.conf, it's in /etc/blah/.), since administrators and users are supposed to be at least remotely acquainted with how such things are generally arranged on Debian systems. Do, however, mention if you change the location of a configuration file.
ru: Записи об изменениях <emphasis role="strong">не</emphasis> должны описывать общие проблемы при создании пакета (Эй, если вы ищете foo.conf, он находится в /etc/бла-бла-бла/.), поскольку предполагается, что администраторы и пользователи по меньшей мере отдалённо знакомы с тем, как такие вещи обычно улаживаются в системах Debian. Сообщите, тем не менее, о том, что вы изменили расположение файла настройки, если вы произвели такое изменение.

source: The only bugs closed with a changelog entry should be those that are actually fixed in the same package revision. Closing unrelated bugs in the changelog is bad practice. See <xref linkend="upload-bugfix"/>.
ru: Единственными закрываемыми с помощью записей об изменениях ошибками должны быть те, которые фактически исправляются именно в этой ревизии пакета. Закрытие несвязанных ошибок в журнале изменений является плохой практикой. См. <xref linkend="upload-bugfix"/>.

source: The changelog entries should <emphasis role="strong">not</emphasis> be used for random discussion with bug reporters (I don't see segfaults when starting foo with option bar; send in more info), general statements on life, the universe and everything (sorry this upload took me so long, but I caught the flu), or pleas for help (the bug list on this package is huge, please lend me a hand). Such things usually won't be noticed by their target audience, but may annoy people who wish to read information about actual changes in the package. See <xref linkend="bug-answering"/> for more information on how to use the bug tracking system.
ru: Записи об изменениях <emphasis role="strong">не</emphasis> должны использоваться для случайных дискуссий с теми, кто сообщил об ошибках (Я не наблюдаю ошибки сегментирования, когда запускаю foo с опцией bar; вышлите дополнительную информацию), общих утверждений о жизни, Вселенной и вообще (извините, загрузка этой версии заняла так много времени, но у меня была простуда), или просьб о помощи (список ошибок этого пакета очень велик, пожалуйста, помогите мне с этим). Скорее всего всё это не будет замечено целевой аудиторией, но может надоедать тем людям, которые хотят читать информацию о фактических изменениях в пакете. Подробную информацию о том, как использовать систему отслеживания ошибок см. в <xref linkend="bug-answering"/>.

source: It is an old tradition to acknowledge bugs fixed in non-maintainer uploads in the first changelog entry of the proper maintainer upload. As we have version tracking now, it is enough to keep the NMUed changelog entries and just mention this fact in your own changelog entry.
ru: Традиционно ошибки, исправленные в загрузках, которые произведены не сопровождающими, упоминаются в первой записи об изменениях той загрузки, которая произведена собственно сопровождающим. Поскольку сейчас у нас имеется система отслеживания версий, достаточно сохранить записи об изменениях, сделанных несопровождающими, и просто упомянуть этот факт в вашей записи об изменениях.

source: Common errors in changelog entries
ru: Общие ошибки в записях об изменениях

source: The following examples demonstrate some common errors or examples of bad style in changelog entries.
ru: Следующие примеры демонстрируют некоторых общие ошибки или примеры плохого стиля в записях об изменениях.

source: This doesn't tell readers anything too useful, obviously.
ru: Очевидно, эта запись не сообщает читателям ничего полезного.

source: What was the patch about?
ru: Что это была за заплата?

source: Overhaul which accomplished what? Is the mention of late night supposed to remind us that we shouldn't trust that code?
ru: Что это была за переделка? Упоминание поздней ночи предполагается как сообщение о том, что этому коду не следует доверять?

source: Too many acronyms, and it's not overly clear what the, uh, fsckup (oops, a curse word!) was actually about, or how it was fixed.
ru: Слишком много акронимов, и мне совсем не ясно, что, ёбтвмть (ой, мат!), это вообще такое и что было исправлено.

source: First of all, there's absolutely no need to upload the package to convey this information; instead, use the bug tracking system. Secondly, there's no explanation as to why the report is not a bug.
ru: Во-первых, вовсе не нужно загружать пакет, чтобы сообщить эту информацию; вместо этого используйте систему отслеживания ошибок. Во-вторых, отсутствует объяснение того, почему данный отчет об ошибке ошибкой не является.

source: If for some reason you didn't mention the bug number in a previous changelog entry, there's no problem, just close the bug normally in the BTS. There's no need to touch the changelog file, presuming the description of the fix is already in (this applies to the fixes by the upstream authors/maintainers as well, you don't have to track bugs that they fixed ages ago in your changelog).
ru: Если по какой-то причине вы не указали ранее в записи об изменениях номер ошибки, это не проблема, просто закройте ошибку обычным способом в системе отслеживания ошибок. Не нужно трогать файл журнала, если описание исправления уже внесено в него (это относится также к исправлениям, внесённым разработчиками основной ветки разработки и сопровождающими, вам не нужно указывать в журнале ошибки, которые были исправлены ими давным давно).

source: Where's the description? If you can't think of a descriptive message, start by inserting the title of each different bug.
ru: Где описание? Если вы не можете придумать описание, начните со вставки заголовка каждой отдельной ошибки.

source: Supplementing changelogs with <filename>NEWS.Debian</filename> files
ru: Дополнение журналов файлами <filename>NEWS.Debian</filename>

source: Important news about changes in a package can also be put in <filename>NEWS.Debian</filename> files. The news will be displayed by tools like <systemitem role="package">apt-listchanges</systemitem>, before all the rest of the changelogs. This is the preferred means to let the user know about significant changes in a package. It is better than using <systemitem role="package">debconf</systemitem> notes since it is less annoying and the user can go back and refer to the <filename>NEWS.Debian</filename> file after the install. And it's better than listing major changes in <filename>README.Debian</filename>, since the user can easily miss such notes.
ru: Важные новости об изменениях в пакете можно также поместить в файл <filename>NEWS.Debian</filename>. Новости будут отображены такими инструментами как <systemitem role="package">apt-listchanges</systemitem> до всех остальных журналов изменений. Это является предпочтительным способом сообщения пользователям о существенных изменениях в пакете. Это лучше, чем использование примечаний <systemitem role="package">debconf</systemitem>, поскольку этот способ менее надоедлив и пользователь может вернуться и просмотреть файл <filename>NEWS.Debian</filename> после установки. И это лучше, чем указание крупных изменений в файле <filename>README.Debian</filename>, поскольку пользователь легко может не заметить вашего сообщения.

source: The file format is the same as a debian changelog file, but leave off the asterisks and describe each news item with a full paragraph when necessary rather than the more concise summaries that would go in a changelog. It's a good idea to run your file through <literal>dpkg-parsechangelog</literal> to check its formatting as it will not be automatically checked during build as the changelog is. Here is an example of a real <filename>NEWS.Debian</filename> file:
ru: Формат этот файла такой же как и формат файла журнала изменений, но забудьте о звёздочках и описывайте каждую новость в отдельном полном параграфе, если это необходимо, вместо того, чтобы давать более краткие резюме, которые подходят для журнала изменений. Хорошо бы пропустить ваш файл через <literal>dpkg-parsechangelog</literal> для проверки форматирования, поскольку в отличии от журнала изменений он не будет проверен автоматически во время сборки. Ниже приведён пример настоящего файла <filename>NEWS.Debian</filename>:

source: The <filename>NEWS.Debian</filename> file is installed as <filename>/usr/share/doc/<replaceable>package</replaceable>/NEWS.Debian.gz</filename>. It is compressed, and always has that name even in Debian native packages. If you use <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> will install <filename>debian/NEWS</filename> files for you.
ru: Файл <filename>NEWS.Debian</filename> устанавливается как <filename>/usr/share/doc/<replaceable>пакет</replaceable>/NEWS.Debian.gz</filename>. Он сжимается, и он всегда имеет данное имя даже в родных пакетах Debian. Если вы используете <literal>debhelper</literal>, <literal>dh_installchangelogs</literal> установит файлы <filename>debian/NEWS</filename> за вас.

source: Unlike changelog files, you need not update <filename>NEWS.Debian</filename> files with every release. Only update them if you have something particularly newsworthy that user should know about. If you have no news at all, there's no need to ship a <filename>NEWS.Debian</filename> file in your package. No news is good news!
ru: В отличии от файлов журналов вам не нужно обновлять файлы <filename>NEWS.Debian</filename> в каждом выпуске. Обновляйте их только если имеется что-то действительно заслуживающее упоминания, что должно быть известно пользователю. Если у вас нет никаких новостей, не нужно добавлять файл <filename>NEWS.Debian</filename> в ваш пакет. Отсутствие новостей &mdash; уже хорошие новости!

source: Best practices for maintainer scripts
ru: Лучшие практики для сценариев сопровождающих
