Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: You may wish to use BTS usertags when submitting bugs across a number of packages. Usertags are similar to normal tags such as 'patch' and 'wishlist' but differ in that they are user-defined and occupy a namespace that is unique to a particular user. This allows multiple sets of developers to 'usertag' the same bug in different ways without conflicting.
ru: Возможно вам захочется использовать пользовательские метки системы отслеживания ошибок при отправке сообщений об ошибках в нескольких пакетах. Пользовательские метки (usertags) схожи с обычные метками, такими как 'patch' и 'wishlist', но отличаются от них в том, что они определяются пользователями и занимают пространство имён, уникальное для каждого отдельного пользователя. Это позволяет нескольким подмножествам разработчиков отмечать пользовательскими метками одну и ту же ошибку разными способами без возникновения конфликтов.

source: To add usertags when filing bugs, specify the <literal>User</literal> and <literal>Usertags</literal> pseudo-headers:
ru: Чтобы добавить пользовательские метки при заполнении отчётов об ошибках, укажите псевдозаголовки <literal>User</literal> и <literal>Usertags</literal>:

source: To: submit@bugs.debian.org Subject: <replaceable>title-of-bug</replaceable> Package: <replaceable>pkgname</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>email-addr</replaceable> Usertags: <replaceable>tag-name [ tag-name ... ]</replaceable> <replaceable>description-of-bug ...</replaceable>
ru: To: submit@bugs.debian.org Subject: <replaceable>заголовок-ошибки</replaceable> Package: <replaceable>имяпакета</replaceable> <replaceable>[ ... ]</replaceable> User: <replaceable>адрес-email</replaceable> Usertags: <replaceable>имя-метки [ имя-метки ... ]</replaceable> <replaceable>описание-ошибки ...</replaceable>

source: Note that tags are seperated by spaces and cannot contain underscores. If you are filing bugs for a particular group or team it is recommended that you set the <literal>User</literal> to an appropriate mailing list after describing your intention there.
ru: Заметьте, что метки отделяются пробелами и не могут содержать подчёркиваний. Если вы заполняете отчёты об ошибках для конкретной группы или команды, рекомендуется установить псеводзаголовок <literal>User</literal> в значение соответствующего списка рассылки после сообщения о вашем намерении в этом списке рассылки.

source: To view bugs tagged with a specific usertag, visit <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>email-addr</replaceable>&amp;tag=<replaceable>tag-name</replaceable></literal>.
ru: Чтобы просмотреть сообщения об ошибках, помеченные конкретной пользовательской меткой, посетите страницу <literal>http://&bugs-host;/cgi-bin/pkgreport.cgi?users=<replaceable>email-addr</replaceable>&amp;tag=<replaceable>имя-метки</replaceable></literal>.

source: Quality Assurance effort
ru: Работа по контролю качества

source: Daily work
ru: Ежедневная работа

source: Even though there is a dedicated group of people for Quality Assurance, QA duties are not reserved solely for them. You can participate in this effort by keeping your packages as bug-free as possible, and as lintian-clean (see <xref linkend="lintian"/>) as possible. If you do not find that possible, then you should consider orphaning some of your packages (see <xref linkend="orphaning"/>). Alternatively, you may ask the help of other people in order to catch up with the backlog of bugs that you have (you can ask for help on &email-debian-qa; or &email-debian-devel;). At the same time, you can look for co-maintainers (see <xref linkend="collaborative-maint"/>).
ru: Даже несмотря на то, что у нас имеется выделенная группа людей, которые занимаются контролем качества (Quality Assurance), обязанности по контролю качества не резервируются исключительно за ними. Вы можете принять участие в этой работе, стараясь сделать так, чтобы в ваших пакетах было как можно меньше ошибок, и чтобы ваши пакеты проходили как можно большее количество проверок lintian (см. <xref linkend="lintian"/>). Если считаете, что это невозможно, вам, вероятно, следует отказаться (осиротить) некоторые из ваших пакетов (см. <xref linkend="orphaning"/>). С другой стороны, вы можете попросить о помощи других людей, чтобы наверстать отставание по количеству исправленных ошибок (вы можете попросить о помощи в списках рассылки &email-debian-qa; или &email-debian-devel;). В то же время вы можете искать помощников сопровождающего (см. <xref linkend="collaborative-maint"/>).

source: Bug squashing parties
ru: Вечеринки по исправлению ошибок

source: From time to time the QA group organizes bug squashing parties to get rid of as many problems as possible. They are announced on &email-debian-devel-announce; and the announcement explains which area will be the focus of the party: usually they focus on release critical bugs but it may happen that they decide to help finish a major upgrade (like a new <command>perl</command> version which requires recompilation of all the binary modules).
ru: Время от времени группа QA организует вечерники по исправлению ошибок для того, чтобы избавиться от как можно большего количества проблем. Они анонсируются в списке рассылки &email-debian-devel-announce;, анонс содержит информацию о том, на каких областях будет сфокусирована вечеринка: обычно они концентрируются на критичных для выпуска ошибках, но может случиться и так, что они решать помочь завершить крупное обновление (например, до новой версии <command>perl</command>, что потребует перекомпиляции всех двоичных модулей).

source: The rules for non-maintainer uploads differ during the parties because the announcement of the party is considered prior notice for NMU. If you have packages that may be affected by the party (because they have release critical bugs for example), you should send an update to each of the corresponding bug to explain their current status and what you expect from the party. If you don't want an NMU, or if you're only interested in a patch, or if you will deal yourself with the bug, please explain that in the BTS.
ru: Во время таких вечеринок действуют другие правила для загрузок от несопровождающих (NMU), поскольку анонс вечеринки делается в первую очередь для NMU. Если у вас имеются пакеты, которые могут быть затронуты во время вечеринки (поскольку в них имеются, например, критичные для выпуска ошибки), вам следует выслать обновление к каждой соответствующей ошибке с объяснением текущего статуса и того, что вы ждёте от данной вечеринки. Если вы не хотите иметь дело с NMU, или если вы заинтересованы только в заплате, либо если вы сами разберётесь с данной ошибкой, сообщите об этом в систему отслеживания ошибок.

source: People participating in the party have special rules for NMU, they can NMU without prior notice if they upload their NMU to DELAYED/3-day at least. All other NMU rules apply as usually; they should send the patch of the NMU to the BTS (to one of the open bugs fixed by the NMU, or to a new bug, tagged fixed). They should also respect any particular wishes of the maintainer.
ru: Люди, принимающие участие в такой вечеринке, имеют специальные правила для NMU, они могут осуществлять NMU без предварительного объявления об этом, если они загружают свою NMU по меньшей мере в DELAYED/3-day. Все другие правила NMU применяются как обычно; они должны выслать заплату NMU в систему отслеживания ошибок (в один из открытых отчётов об ошибке, исправленных NMU, либо в новый отчёт об ошибке, пометив его как исправленный). Также они должны уважать любых конкретные пожелания сопровождающего.

source: If you don't feel confident about doing an NMU, just send a patch to the BTS. It's far better than a broken NMU.
ru: Если вы не чувствуете уверенности по поводу NMU, просто вышлите заплату в систему отслеживания ошибок. Это намного лучше, чем сломанная NMU.

source: Contacting other maintainers
ru: Связь с другими сопровождающими

source: During your lifetime within Debian, you will have to contact other maintainers for various reasons. You may want to discuss a new way of cooperating between a set of related packages, or you may simply remind someone that a new upstream version is available and that you need it.
ru: Во время срока вашей деятельности в Debian вам придётся связываться с другими сопровождающими по совершенно разным причинам. Возможно, вы захотите обсудить новый способ взаимодействия между наборами связных пакетов, или просто напомнить кому-то о том, что теперь доступна новая версия основной ветки разработки, и она вам нужна.

source: Looking up the email address of the maintainer for the package can be distracting. Fortunately, there is a simple email alias, <literal><replaceable>package</replaceable>@&packages-host;</literal>, which provides a way to email the maintainer, whatever their individual email address (or addresses) may be. Replace <replaceable>package</replaceable> with the name of a source or a binary package.
ru: Поиск адреса электронной почты сопровождающего пакета может отвлекать. К счастью, существуют простые псевдонимы для электронной почты, <literal><replaceable>пакет</replaceable>@&packages-host;</literal>, которые предоставляют способ отправки сообщения сопровождающему, каким бы ни был его индивидуальный адрес электронной почты (или адреса). Замените <replaceable>пакет</replaceable> на имя пакета с исходным кодом или имя двоичного пакета.

source: You may also be interested in contacting the persons who are subscribed to a given source package via <xref linkend="pkg-tracking-system"/>. You can do so by using the <literal><replaceable>package</replaceable>@&pts-host;</literal> email address.
ru: Возможно, вы захотите связаться с теми, кто подписан на данный пакет с исходным кодом через <xref linkend="pkg-tracking-system"/>. Вы можете сделать это, используя адрес электронной почты <literal><replaceable>пакет</replaceable>@&pts-host;</literal>.

source: Dealing with inactive and/or unreachable maintainers
ru: Работа с неактивными и/или недоступными сопровождающими

source: If you notice that a package is lacking maintenance, you should make sure that the maintainer is active and will continue to work on their packages. It is possible that they are not active any more, but haven't registered out of the system, so to speak. On the other hand, it is also possible that they just need a reminder.
ru: Если вы заметили, что пакет плохо сопровождается, вам следует убедиться, что сопровождающий активен и будет продолжать работу над своими пакетами. Возможно, что сопровождающий более не активен, но, так сказать, ещё не отменил своей регистрации в системе. С другой стороны, также возможно, что этому сопровождающему просто нужно напомнить о его обязанностях.

source: There is a simple system (the MIA database) in which information about maintainers who are deemed Missing In Action is recorded. When a member of the QA group contacts an inactive maintainer or finds more information about one, this is recorded in the MIA database. This system is available in <filename>/org/qa.debian.org/mia</filename> on the host <literal>qa.debian.org</literal>, and can be queried with the <command>mia-query</command> tool. Use <command>mia-query --help</command> to see how to query the database. If you find that no information has been recorded about an inactive maintainer yet, or that you can add more information, you should generally proceed as follows.
ru: Существует простая система (база данных MIA), в которую записывается информация о сопровождающих, которые считаются пропавшими без вести (Missing In Action). Когда член группы QA связывается с неактивным сопровождающим или находит дополнительную информацию о нём, это записывается в базу данных MIA. Эта система доступна в <filename>/org/qa.debian.org/mia</filename> на узле <literal>qa.debian.org</literal> и может быть запрошена с помощью инструмента <command>mia-query</command>. Используйте <command>mia-query --help</command>, чтобы узнать, как запрашивать базу данных. Если вы обнаружите, что о конкретном неактивном сопровождающем нет никакой информации, что вы можете добавить дополнительную информацию, вам следует действовать следующим образом.

source: The first step is to politely contact the maintainer, and wait a reasonable time for a response. It is quite hard to define reasonable time, but it is important to take into account that real life is sometimes very hectic. One way to handle this would be to send a reminder after two weeks.
ru: В качестве первого шага вежливо свяжитесь с сопровождающим, ждите его ответ разумное количество времени. Определить, какое количество времени является разумным, очень сложно, но важно принимать в расчёт то, что фактическая жизнь иногда может быть очень беспокойной. Например, можно отправить ещё одно напоминание через две недели.

source: If the maintainer doesn't reply within four weeks (a month), one can assume that a response will probably not happen. If that happens, you should investigate further, and try to gather as much useful information about the maintainer in question as possible. This includes:
ru: Если сопровождающий не отвечает в течении четырёх недель (месяца), можно предположить, что он вероятнее всего более не ответит. Если это произошло, вам нужно расследовать дальше и попытаться собрать как можно больше полезной информации о данном сопровождающем. Это предполагает следующее:

source: The <literal>echelon</literal> information available through the <ulink url="&url-debian-db;">developers' LDAP database</ulink>, which indicates when the developer last posted to a Debian mailing list. (This includes mails about uploads distributed via the &email-debian-devel-changes; list.) Also, remember to check whether the maintainer is marked as on vacation in the database.
ru: <literal>Эшелон</literal> информации доступен через <ulink url="&url-debian-db;">базу данных LDAP разработчиков</ulink>, в которой указывается, когда последний раз данный разработчик писал в список рассылки Debian. (База данных содержит информацию о почте по поводу загрузок, распространяемой через список рассылки &email-debian-devel-changes;.) Кроме того, проверьте, отмечен ли данный сопровождающий в этой базе данных как находящийся в отпуске.

source: The number of packages this maintainer is responsible for, and the condition of those packages. In particular, are there any RC bugs that have been open for ages? Furthermore, how many bugs are there in general? Another important piece of information is whether the packages have been NMUed, and if so, by whom.
ru: Число пакетов, за которые ответственен этот сопровождающий, и состояние этих пакетов. В частности, имеются ли какие-либо критичные для выпуска ошибки, которые остаются открытыми долгое время? Более того, как много вообще ошибок? Другой важной информацией является то, были ли эти пакеты загружены несопровождающим, и если да, то кем.

source: Is there any activity of the maintainer outside of Debian? For example, they might have posted something recently to non-Debian mailing lists or news groups.
ru: Имеется ли какая-либо активность этого сопровождающего за пределами Debian? Например, он может написать что-то в список рассылки, не связанный с Debian, или в какую-нибудь новостную группу.

source: A bit of a problem are packages which were sponsored — the maintainer is not an official Debian developer. The <literal>echelon</literal> information is not available for sponsored people, for example, so you need to find and contact the Debian developer who has actually uploaded the package. Given that they signed the package, they're responsible for the upload anyhow, and are likely to know what happened to the person they sponsored.
ru: Некоторой проблемой являются пакеты, которые были спонсированы — их сопровождающий не является официальным разработчиком Debian. <literal>Эшелон</literal> информации не доступен для спонсируемых людей, поэтому вам следует найти и связаться с разработчиком Debian, который фактически загрузил этот пакет. Учитывая, что они подписали пакет, они всё равно ответственны за загрузку и должны знать, что случилось с тем, кого они спонсировали.

source: It is also allowed to post a query to &email-debian-devel;, asking if anyone is aware of the whereabouts of the missing maintainer. Please Cc: the person in question.
ru: Также разрешается писать запрос в &email-debian-devel;, спрашивая о том, знает ли кто-нибудь о том, где находится пропавший сопровождающий. Пожалуйста, вышлите копию письма этому человеку.

source: Once you have gathered all of this, you can contact &email-mia;. People on this alias will use the information you provide in order to decide how to proceed. For example, they might orphan one or all of the packages of the maintainer. If a package has been NMUed, they might prefer to contact the NMUer before orphaning the package — perhaps the person who has done the NMU is interested in the package.
ru: Когда вы собрали всю эту информацию, вы можете связаться с &email-mia;. Люди, получающие почту с этого псевдонима, будут использовать предоставленную вами информацию для того, чтобы решить, как действовать дальше. Например, они могут осиротить один или все пакеты данного сопровождающего. Если пакет был загружен несопровождающим, они могут связаться с тем, что осуществил эту загрузку, до того, как осиротят пакет — возможно, человек, который осуществил эту загрузку, заинтересован в этом пакете.

source: One last word: please remember to be polite. We are all volunteers and cannot dedicate all of our time to Debian. Also, you are not aware of the circumstances of the person who is involved. Perhaps they might be seriously ill or might even have died — you do not know who may be on the receiving side. Imagine how a relative will feel if they read the e-mail of the deceased and find a very impolite, angry and accusing message!
ru: Одно последнее слово: пожалуйста, будьте вежливы. Все мы являемся добровольцами, и мы не можем выделать всё наше время Debian. Кроме того, вам не известны обстоятельства, в которых находится этот человек. Возможно, он серьезно болен или даже мог умереть — вы не знаете, кто получает его почту. Представьте, как будут чувствовать себя родные, если они прочтут сообщение, адресованное умершему, и это сообщение будет невежливым, злым или будет содержать обвинения!

source: On the other hand, although we are volunteers, we do have a responsibility. So you can stress the importance of the greater good — if a maintainer does not have the time or interest anymore, they should let go and give the package to someone with more time.
ru: С другой стороны, хотя мы и являемся добровольцами, мы несём ответственность. Поэтому вы можете подчеркнуть важность большей пользы — если у сопровождающего нет времени, или он более не заинтересован в работе над своими пакетами, он должен передать свои пакеты тому, у кого времени больше.

source: If you are interested in working in the MIA team, please have a look at the <filename>README</filename> file in <filename>/org/qa.debian.org/mia</filename> on <literal>qa.debian.org</literal> where the technical details and the MIA procedures are documented and contact &email-mia;.
ru: Если вы заинтересованы в работе в команде MIA, посмотрите файл <filename>README</filename> в <filename>/org/qa.debian.org/mia</filename> на <literal>qa.debian.org</literal>, где описаны технические детали и процедуры MIA, а также свяжитесь с &email-mia;.

source: Interacting with prospective Debian developers
ru: Взаимодействие с будущими разработчиками Debian

source: Debian's success depends on its ability to attract and retain new and talented volunteers. If you are an experienced developer, we recommend that you get involved with the process of bringing in new developers. This section describes how to help new prospective developers.
ru: Успех Debian зависит от его способности привлекать и сохранять новых и талантливых добровольцев. Если вы являетесь опытным разработчиком, мы рекомендуем вам принять участие в процессе привлечения новых разработчиков. Данный раздел описывает то, как помогать новым будущим разработчиками.

source: Sponsoring packages
ru: Спонсирование пакетов

source: Sponsoring a package means uploading a package for a maintainer who is not able to do it on their own. It's not a trivial matter, the sponsor must verify the packaging and ensure that it is of the high level of quality that Debian strives to have.
ru: Спонсирование пакета предполагает загрузку пакета для сопровождающего, который сам этого сделать не может. Это нетривиальная задача, спонсор должен проверить то, как создан пакет, и гарантировать его высокое качество, качество, к которому стремится Debian.

source: Debian Developers can sponsor packages. Debian Maintainers can't.
ru: Разработчики Debian могут спонсировать пакеты. Сопровождающие Debian не могут.

source: The maintainer prepares a source package (<filename>.dsc</filename>) and puts it online somewhere (like on <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) or even better, provides a link to a public VCS repository (see <xref linkend="servers-vcs"/>) where the package is maintained.
ru: Сопровождающий готовит пакет с исходным кодом (<filename>.dsc</filename>) и помещает его куда-нибудь в сеть (например, на <ulink url="http://mentors.debian.net/cgi-bin/welcome">mentors.debian.net</ulink>) или, что даже лучше, предоставляет ссылку на публичный репозиторий системы управления версиями (см. <xref linkend="servers-vcs"/>), в рамках которого осуществляется сопровождение пакета.

source: The sponsor downloads (or checkouts) the source package.
ru: Спонсор скачивает (или извлекает) пакет с исходным кодом.

source: The sponsor reviews the source package. If they find issues, they inform the maintainer and ask them to provide a fixed version (the process starts over at step 1).
ru: Спонсор проверяет пакет с исходным кодом. Если будут найдены какие-либо проблемы, он информируем об этом сопровождающего и просит его предоставить исправленную версию (процесс начинается снова с шага 1).

source: The sponsor could not find any remaining problem. They build the package, sign it, and upload it to Debian.
ru: Спонсор не нашёл каких-либо оставшихся проблем. Он собирает пакет, подписывает его и загружает пакет в Debian.

source: The process of sponsoring a package is: <placeholder type="orderedlist" id="0"/>
ru: Процесс спонсирования пакета таков: <placeholder type="orderedlist" id="0"/>

source: Before delving in the details of how to sponsor a package, you should ask yourself whether adding the proposed package is beneficial to Debian.
ru: До того как вникнуть в детали того, как осуществлять спонсирование пакета, вам следует спросить себя, является ли добавление предложенного пакета полезным для Debian.

source: There's no simple rule to answer this question, it can depend on many factors: is the upstream codebase mature and not full of security holes? Are there pre-existing packages that can do the same task and how do they compare to this new package? Has the new package been requested by users and how large is the user base? How active are the upstream developers?
ru: Нет никакого простого правила для ответа на этот вопрос, это может зависеть от множества факторов: является ли кодовая база основной ветки разработки достаточно зрела и в ней не так много дыр в безопасности? Имеется ли уже существующий пакет, которые может выполнять ту же задачу, и каково различие между существующими пакетами и этим новым пакетом? Был ли новый пакет запрошен пользователями, какова его пользовательская база? Насколько активны разработчики основной ветки?
