Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: <emphasis role="strong">should</emphasis> be documented in the resulting source package. Detailed information on how the repackaged source was obtained, and on how this can be reproduced should be provided in <filename>debian/copyright</filename>. It is also a good idea to provide a <literal>get-orig-source</literal> target in your <filename>debian/rules</filename> file that repeats the process, as described in the Policy Manual, <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Main building script: <filename>debian/rules</filename></ulink>.
ru: <emphasis role="strong">должен</emphasis> быть документирован в получившемся пакете с исходным кодом. Подробная информация о том, как был получен запакованный заново исходный код, а также о том, как этот процесс может быть воспроизведён, должна быть предоставлена в <filename>debian/copyright</filename>. Также рекомендуется предоставлять цель <literal>get-orig-source</literal> в вашем файле <filename>debian/rules</filename>, которая повторяет этот процесс, это описано в Руководстве по политике, <ulink url="&url-debian-policy;ch-source.html#s-debianrules">Основной сборочный сценарий: <filename>debian/rules</filename></ulink>.

source: As a special exception, if the omission of non-free files would lead to the source failing to build without assistance from the Debian diff, it might be appropriate to instead edit the files, omitting only the non-free parts of them, and/or explain the situation in a <filename>README.source</filename> file in the root of the source tree. But in that case please also urge the upstream author to make the non-free components easier separable from the rest of the source.
ru: Как специальное исключение если удаление несвободных файлов приведёт к тому, что исходный код перестанет собираться без помощи Debian diff, возможно отредактировать файлы, исключая из них лишь несвободные части, и/или объяснить ситуацию в файле <filename>README.source</filename> в корневом каталоге дерева исходного кода. Однако в этом случае, пожалуйста, также постарайтесь убедить автора основной ветки разработки облегчить отделение несвободных компонентов от остального исходного кода.

source: <emphasis role="strong">should not</emphasis> contain any file that does not come from the upstream author(s), or whose contents has been changed by you.<placeholder type="footnote" id="0"/>
ru: <emphasis role="strong">не должен</emphasis> содержать какие-либо файлы, которые получены не от авторов основной ветки разработки, или содержание которых было изменено вами.<placeholder type="footnote" id="0"/>

source: <emphasis role="strong">should</emphasis>, except where impossible for legal reasons, preserve the entire building and portablility infrastructure provided by the upstream author. For example, it is not a sufficient reason for omitting a file that it is used only when building on MS-DOS. Similarly, a <filename>Makefile</filename> provided by upstream should not be omitted even if the first thing your <filename>debian/rules</filename> does is to overwrite it by running a configure script.
ru: <emphasis role="strong">должен</emphasis>, за исключением случаев, когда это невозможно по юридическим причинам, сохранять всю целиком сборочную инфраструктуру и инфраструктуру для переноса, предоставляемую автором основной ветки разработки. Например, то, что какой-то файл используется только для сборки под MS-DOS, не является достаточным основанием для его удаления. Сходным образом, <filename>Makefile</filename>, предоставляемый основной веткой разработки не должен быть удалён, даже если ваш файл <filename>debian/rules</filename> перезаписывает его, запуская сценарий настройки.

source: (<emphasis>Rationale:</emphasis> It is common for Debian users who need to build software for non-Debian platforms to fetch the source from a Debian mirror rather than trying to locate a canonical upstream distribution point).
ru: (<emphasis>Обоснование:</emphasis> Обычно пользователи Debian, желающие собрать ПО для отличных от Debian платформ, загружают исходный код с зеркала Debian, а не пытаются найти каноничный выпуск основной ветки разработки).

source: <emphasis role="strong">should</emphasis> use <filename><replaceable>packagename</replaceable>-<replaceable>upstream-version</replaceable>.orig</filename> as the name of the top-level directory in its tarball. This makes it possible to distinguish pristine tarballs from repackaged ones.
ru: <emphasis role="strong">должен</emphasis> использовать <filename><replaceable>имяпакета</replaceable>-<replaceable>версия-основной-ветки</replaceable>.orig</filename> в качестве имени каталога верхнего уровня в своём tar-архиве. Это позволяет отличить чистые tar-архивы от запакованных заново.

source: <emphasis role="strong">should</emphasis> be gzipped or bzipped with maximal compression.
ru: <emphasis role="strong">должен</emphasis> быть сжат с помощью gzip или bzip с максимальным сжатием.

source: Changing binary files
ru: Изменение двоичных файлов

source: Sometimes it is necessary to change binary files contained in the original tarball, or to add binary files that are not in it. This is fully supported when using source packages in “3.0 (quilt)” format, see the <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry> manual page for details. When using the older format “1.0”, binary files can't be stored in the <filename>.diff.gz</filename> so you must store an <command>uuencode</command>d (or similar) version of the file(s) and decode it at build time in <filename>debian/rules</filename> (and move it in its official location).
ru: Иногда необходимо изменить двоичные файлы, содержащиеся в оригинальных tar-архивах, либо добавить двоичные файлы, которые не включены в оригинальный архив. Это полностью поддерживается, если используется формат пакетов с исходным кодом “3.0 (quilt)”, подробности см. на странице руководства <citerefentry><refentrytitle>dpkg-source</refentrytitle><manvolnum>1</manvolnum></citerefentry>. Если используется более старый формат “1.0”, двоичные файлы не могут быть сохранены в <filename>.diff.gz</filename>, поэтому вам придётся сохранять их в текстовой форме, в виде <command>uuencode</command> (или подобных) версий файлов и декодировать их во время сборки в <filename>debian/rules</filename> (и перемещать их в официальный каталог).

source: Best practices for debug packages
ru: Лучшие практики для отладочных пакетов

source: A debug package is a package with a name ending in -dbg, that contains additional information that <command>gdb</command> can use. Since Debian binaries are stripped by default, debugging information, including function names and line numbers, is otherwise not available when running <command>gdb</command> on Debian binaries. Debug packages allow users who need this additional debugging information to install it, without bloating a regular system with the information.
ru: Отладочный пакет - пакет, имя которого заканчивается на -dbg, содержащий дополнительную информацию, которую может использовать <command>gdb</command>. Поскольку двоичные файлы в Debian по умолчанию поставляются в сокращённом варианте, отладочная информация, включающая имена функций и номера строк, не доступна при запуске <command>gdb</command> для двоичных файлов Debian. Отладочные пакеты позволяют пользователю, которым требуется эта дополнительная информация, установить её, не засоряя обычную систему этой информацией.

source: It is up to a package's maintainer whether to create a debug package or not. Maintainers are encouraged to create debug packages for library packages, since this can aid in debugging many programs linked to a library. In general, debug packages do not need to be added for all programs; doing so would bloat the archive. But if a maintainer finds that users often need a debugging version of a program, it can be worthwhile to make a debug package for it. Programs that are core infrastructure, such as apache and the X server are also good candidates for debug packages.
ru: От сопровождающего пакета зависит то, будет создан отладочный пакет или нет. Мы призываем сопровождающих создавать отладочные пакеты для пакетов с библиотеками, поскольку это может помочь в отладке многих программ, слинкованых с библиотекой. Вообще, отладочные пакеты не нужно добавлять для всех программ; это засорит архив. Однако если сопровождающий считает, что пользователям часто требуется отладочная версия программы, стоит создать для неё отладочный пакет. Программы, относящиеся к центральной инфраструктуре, такие как apache и сервер X, также являются хорошими кандидатами на создание отладочных пакетов.

source: Some debug packages may contain an entire special debugging build of a library or other binary, but most of them can save space and build time by instead containing separated debugging symbols that <command>gdb</command> can find and load on the fly when debugging a program or library. The convention in Debian is to keep these symbols in <filename>/usr/lib/debug/<replaceable>path</replaceable></filename>, where <replaceable>path</replaceable> is the path to the executable or library. For example, debugging symbols for <filename>/usr/bin/foo</filename> go in <filename>/usr/lib/debug/usr/bin/foo</filename>, and debugging symbols for <filename>/usr/lib/libfoo.so.1</filename> go in <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.
ru: Некоторые отладочные пакеты могут содержать всю целиком специальную отладочную сборку библиотеки или других двоичных файлов, но большая часть этих пакетов может сохранить место на диске и время, требуемое для сборки, если они включают в себя отдельные отладочные символы, которые могут быть найдены и загружен на лету <command>gdb</command> при отладке программы или библиотеки. По договорённости, в Debian эти символы сохраняются в <filename>/usr/lib/debug/<replaceable>путь</replaceable></filename>, где <replaceable>путь</replaceable> является путём к исполняемому файлу или библиотеке. Например, отладочные символы для <filename>/usr/bin/foo</filename> помещаются в <filename>/usr/lib/debug/usr/bin/foo</filename>, а отладочные символы для <filename>/usr/lib/libfoo.so.1</filename> помещаются в <filename>/usr/lib/debug/usr/lib/libfoo.so.1</filename>.

source: The debugging symbols can be extracted from an object file using <command>objcopy --only-keep-debug</command>. Then the object file can be stripped, and <command>objcopy --add-gnu-debuglink</command> used to specify the path to the debugging symbol file. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> explains in detail how this works.
ru: Отладочные символы могут быть извлечены их объектного файла при помощи команды <command>objcopy --only-keep-debug</command>. Далее, объектный файл может быть очищен, а команда <command>objcopy --add-gnu-debuglink</command> используется для определения пути к файлу с отладочными символами. <citerefentry> <refentrytitle>objcopy</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> подробно объясняет то, как это работает.

source: The <command>dh_strip</command> command in <systemitem role="package">debhelper</systemitem> supports creating debug packages, and can take care of using <command>objcopy</command> to separate out the debugging symbols for you. If your package uses <systemitem role="package">debhelper</systemitem>, all you need to do is call <command>dh_strip --dbg-package=libfoo-dbg</command>, and add an entry to <filename>debian/control</filename> for the debug package.
ru: Команда <command>dh_strip</command> в <systemitem role="package">debhelper</systemitem> поддерживает создание отладочных пакетов, она может позаботиться об использовании <command>objcopy</command> для выделения для вас отладочных символов. Если ваш пакет использует <systemitem role="package">debhelper</systemitem>, всё, что вам нужно сделать, - вызвать <command>dh_strip --dbg-package=libfoo-dbg</command> и добавить пункт в <filename>debian/control</filename> для отладочного пакета.

source: Note that the debug package should depend on the package that it provides debugging symbols for, and this dependency should be versioned. For example:
ru: Заметьте, отладочный пакет должен зависеть от пакета, для которого он предоставляет отладочные символы, и эта зависимость должна быть зависимостью от конкретной версии. Например:

source: Best practices for meta-packages
ru: Лучшие практики для метапакетов

source: A meta-package is a mostly empty package that makes it easy to install a coherent set of packages that can evolve over time. It achieves this by depending on all the packages of the set. Thanks to the power of APT, the meta-package maintainer can adjust the dependencies and the user's system will automatically get the supplementary packages. The dropped packages that were automatically installed will be also be marked as removal candidates (and are even automatically removed by <command>aptitude</command>). <systemitem role="package">gnome</systemitem> and <systemitem role="package">linux-image-amd64</systemitem> are two examples of meta-packages (built by the source packages <systemitem role="package">meta-gnome2</systemitem> and <systemitem role="package">linux-latest</systemitem>).
ru: Метапакет обычно является пустым пакетом, который облегчает установку связанного набора пакетов, которые со временем могут развиваться. Это достигается благодаря тому, что метапакет зависит от всех пакетов данного набора. Благодаря мощи APT, сопровождающий метапакета может изменять зависимости, и пользовательская система будет автоматически получать дополнительные пакеты. Кроме того, отброшенные пакеты, которые были установлены автоматически, будут помечены как кандидаты на удаление (и даже будут автоматически удалены с помощью <command>aptitude</command>). <systemitem role="package">gnome</systemitem> и <systemitem role="package">linux-image-amd64</systemitem> являются примерами метапакетов (собранных из пакетов с исходным кодом <systemitem role="package">meta-gnome2</systemitem> и <systemitem role="package">linux-latest</systemitem>).

source: The long description of the meta-package must clearly document its purpose so that the user knows what they will lose if they remove the package. Being explicit about the consequences is recommended. This is particularly important for meta-packages which are installed during initial installation and that have not been explicitly installed by the user. Those tend to be important to ensure smooth system upgrades and the user should be discouraged from uninstalling them to avoid potential breakages.
ru: Длинное описание метапакета должно явным образом содержать информацию о его цели, чтобы пользователи знали, что они потеряют, если удалят данный пакет. Рекомендуется ясно прописывать последствия. Особенно это важно для сопровождающих метапакетов, которые устанавливаются во время начальной установки и которые не были явным образом установлены пользователем. Эти пакеты важны для обеспечения гладкого обновления системы, следует отговаривать пользователей от удаления этих пакетов, чтобы избежать потенциальных поломок.

source: Beyond Packaging
ru: Помимо создания пакетов

source: Debian is about a lot more than just packaging software and maintaining those packages. This chapter contains information about ways, often really critical ways, to contribute to Debian beyond simply creating and maintaining packages.
ru: Debian предполагает гораздо больше, чем простое создание пакетов ПО и сопровождение этих пакетов. Данная глава содержит информацию о способах, часто действительно критичных способах, участия в Debian помимо создания и сопровождения пакетов.

source: As a volunteer organization, Debian relies on the discretion of its members in choosing what they want to work on and in choosing the most critical thing to spend their time on.
ru: Будучи добровольной организацией, Debian полагается на благоразумие своих членов в их выборе того, над чем они хотят работать, а также в выборе наиболее критических задач, исходя из своего собственного времени.

source: Bug reporting
ru: Отправка отчётов об ошибках

source: We encourage you to file bugs as you find them in Debian packages. In fact, Debian developers are often the first line testers. Finding and reporting bugs in other developers' packages improves the quality of Debian.
ru: Мы призываем вас сообщать об ошибках в пакетах Debian как только вы найдёте их. Фактически, разработчики Debian зачастую являются тестировщиками первой волны. Обнаружение ошибки и сообщение о ней другим разработчикам пакетов повышает качество Debian.

source: Read the <ulink url="&url-bts-report;">instructions for reporting bugs</ulink> in the Debian <ulink url="&url-bts;">bug tracking system</ulink>.
ru: Прочтите <ulink url="&url-bts-report;">инструкции по отправке отчётов об ошибках</ulink> в <ulink url="&url-bts;">систему отслеживания ошибок</ulink> Debian.

source: Try to submit the bug from a normal user account at which you are likely to receive mail, so that people can reach you if they need further information about the bug. Do not submit bugs as root.
ru: Попытайтесь отправить сообщение об ошибке от учётной записи обычного пользователя, на которую вы получаете почту, чтобы люди могли с вами связаться, если им потребуется дополнительная информация об ошибке. Не отправляйте отчёты от учётной записи суперпользователя.

source: You can use a tool like <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> to submit bugs. It can automate and generally ease the process.
ru: Вы можете использовать инструмент на подобие <citerefentry> <refentrytitle>reportbug</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> для отправки сообщений об ошибках. Это может автоматизировать и в целом упростить процесс.

source: Make sure the bug is not already filed against a package. Each package has a bug list easily reachable at <literal>http://&bugs-host;/<replaceable>packagename</replaceable></literal>. Utilities like <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> can also provide you with this information (and <command>reportbug</command> will usually invoke <command>querybts</command> before sending, too).
ru: Убедитесь, что о данной ошибке в данном пакете ещё не сообщали. Всякий пакет имеет свой список ошибок, доступ к которому можно легко получить, по адресу <literal>http://&bugs-host;/<replaceable>packagename</replaceable></literal>. Такие утилиты как <citerefentry> <refentrytitle>querybts</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> также могут предоставить вам информацию (<command>reportbug</command> обычно вызывает команду <command>querybts</command> до отправки отчёта).

source: Try to direct your bugs to the proper location. When for example your bug is about a package which overwrites files from another package, check the bug lists for <emphasis>both</emphasis> of those packages in order to avoid filing duplicate bug reports.
ru: Попытайтесь направить ваше сообщение об ошибках туда, где они нужны. Когда, например, ваша ошибка касается пакета, который перезаписывает файлы из другого пакета, проверьте список ошибок, <emphasis>оба</emphasis> этих пакета нужны для того, чтобы избежать заполнения дублирующих отчётов об ошибках.

source: For extra credit, you can go through other packages, merging bugs which are reported more than once, or tagging bugs `fixed' when they have already been fixed. Note that when you are neither the bug submitter nor the package maintainer, you should not actually close the bug (unless you secure permission from the maintainer).
ru: Для получения дополнительного кредита доверия вы можете просмотреть другие пакеты, сливая сообщения об ошибках, о которых было сообщено несколько раз, либо помечая ошибки как исправленные (`fixed'), если они уже исправлены. Заметьте, что если вы не являетесь ни автором сообщения об ошибке, ни сопровождающим пакета, вам не следует фактически закрывать ошибку (если только вы не получили на это разрешение от сопровождающего).

source: From time to time you may want to check what has been going on with the bug reports that you submitted. Take this opportunity to close those that you can't reproduce anymore. To find out all the bugs you submitted, you just have to visit <literal>http://&bugs-host;/from:<replaceable>your-email-addr</replaceable></literal>.
ru: Время от времени вам может захотеться проверить, что происходит с отчётами об ошибках, которые вы отправили. Используйте эту возможность, чтобы закрыть те ошибки, которые вы более не можете воспроизвести. Чтобы найти все ошибки, о которых вы отправляли отчёты, вам следует перейти на страницу <literal>http://&bugs-host;/from:<replaceable>ваш-адре-электронной-почты</replaceable></literal>.

source: Reporting lots of bugs at once (mass bug filing)
ru: Отправка множества отчётов об ошибках за один раз (массовое заполнение отчётов об ошибках)

source: Reporting a great number of bugs for the same problem on a great number of different packages — i.e., more than 10 — is a deprecated practice. Take all possible steps to avoid submitting bulk bugs at all. For instance, if checking for the problem can be automated, add a new check to <systemitem role="package">lintian</systemitem> so that an error or warning is emitted.
ru: Сообщение о большом количестве ошибок, связанных с одной и той же проблемой в большом количестве различных пакетов — напр., более 10 — является плохой практикой. Предпримите все возможные шаги, чтобы не допустить отправки массы сообщений об ошибках. Например, если проверка данной проблемы может быть автоматизирована, добавьте новую проверку в <systemitem role="package">lintian</systemitem>, так чтобы выводилось сообщение об ошибке или предупреждение.

source: If you report more than 10 bugs on the same topic at once, it is recommended that you send a message to &email-debian-devel; describing your intention before submitting the report, and mentioning the fact in the subject of your mail. This will allow other developers to verify that the bug is a real problem. In addition, it will help prevent a situation in which several maintainers start filing the same bug report simultaneously.
ru: Если вы сообщаете о более чем 10 ошибках на одну и ту же тему за раз, рекомендуется выслать сообщение на адрес &email-debian-devel; с описанием вашего намерения до того, как вы вышлете свой отчёт, укажите этот факт в теме сообщения. Это позволит другим разработчикам проверить, что ошибка действительно является проблемой. Кроме того, это позволит избежать ситуации, при которой несколько сопровождающих одновременно начинают заполнять один и тот же отчёт об ошибке.

source: Please use the programs <command>dd-list</command> and if appropriate <command>whodepends</command> (from the package <systemitem role="package">devscripts</systemitem>) to generate a list of all affected packages, and include the output in your mail to &email-debian-devel;.
ru: Пожалуйста, используйте программы <command>dd-list</command> и, если это подходит, <command>whodepends</command> (из пакета <systemitem role="package">devscripts</systemitem>) для создания списка всех подверженных данной ошибке пакетов и добавьте вывод этих программ в ваше сообщение по адресу &email-debian-devel;.

source: Usertags
ru: Пользовательские метки
