Repository: yurayko/developers-reference-ru
Catalog: *.po
Languages: ru

source: Debian supports an ever-increasing number of architectures. Even if you are not a porter, and you don't use any architecture but one, it is part of your duty as a maintainer to be aware of issues of portability. Therefore, even if you are not a porter, you should read most of this chapter.
ru: Debian поддерживает всё увеличивающееся число архитектур. Даже если вы не занимаетесь переносом и используете только одну архитектуру, вы как сопровождающий обязаны знать о проблемах, связанных с переносимостью. Следовательно, даже если вы не занимаетесь переносом, вам следует прочесть большую часть данной главы.

source: Porting is the act of building Debian packages for architectures that are different from the original architecture of the package maintainer's binary package. It is a unique and essential activity. In fact, porters do most of the actual compiling of Debian packages. For instance, when a maintainer uploads a (portable) source packages with binaries for the <literal>i386</literal> architecture, it will be built for each of the other architectures, amounting to &number-of-arches; more builds.
ru: Перенос представляет собой сборку пакетов Debian для архитектур, которые отличаются от архитектуры для которой сопровождающим был изначально собран двоичный пакет. Это уникальная и важная работа. В действительности, те, кто занимаются переносом, выполняют большую часть фактической компиляции пакетов Debian. Например, когда сопровождающий загружает (переносимые) пакеты с исходным кодом с двоичными пакетами для архитектуры <literal>i386</literal>, двоичные пакеты будут собраны для каждой из оставшихся архитектур, что равно &number-of-arches; сборкам.

source: Being kind to porters
ru: Будьте добры к тем, кто занимается переносом

source: Porters have a difficult and unique task, since they are required to deal with a large volume of packages. Ideally, every source package should build right out of the box. Unfortunately, this is often not the case. This section contains a checklist of ``gotchas'' often committed by Debian maintainers — common problems which often stymie porters, and make their jobs unnecessarily difficult.
ru: У тех, кто занимается переносом, трудная и необычная задача, поскольку им необходимо работать с большим объёмом пакетов. В идеале каждый пакет с исходным кодом должен собираться прямо из коробки. К сожалению, зачастую это не так. Данный раздел содержит список ``ошибочек'', которые часть совершают сопровождающие Debian — общих проблем, которые ставят в тупик тех, кто занимается переносом, и делают их работу неоправданно сложной.

source: The first and most important thing is to respond quickly to bug or issues raised by porters. Please treat porters with courtesy, as if they were in fact co-maintainers of your package (which, in a way, they are). Please be tolerant of succinct or even unclear bug reports; do your best to hunt down whatever the problem is.
ru: В первую очередь (и это самое важное) следует быстро отвечать на сообщения об ошибках или проблемах, которые были присланы теми, кто занимается переносом. Пожалуйста, обращайтесь с этими людьми вежливо, как будто они являются вашими помощниками в работе по сопровождению вашего пакета (а они фактически ими и являются). Будьте терпимы к кратким или даже неясным сообщениям об ошибках; приложите все усилия для того, чтобы выяснить, в чем состоит проблема.

source: By far, most of the problems encountered by porters are caused by <emphasis>packaging bugs</emphasis> in the source packages. Here is a checklist of things you should check or be aware of.
ru: По большей части, почти все проблемы, на которые обращают внимание те, кто занимает переносом, вызваны <emphasis>ошибками, допущенными при создании пакетов</emphasis>, в пакетах с исходным кодом. Ниже приведён список того, что вам следует проверить или о чём нужно всегда помнить.

source: Make sure that your <literal>Build-Depends</literal> and <literal>Build-Depends-Indep</literal> settings in <filename>debian/control</filename> are set properly. The best way to validate this is to use the <systemitem role="package">debootstrap</systemitem> package to create an <literal>unstable</literal> chroot environment (see <xref linkend="debootstrap"/>). Within that chrooted environment, install the <systemitem role="package">build-essential</systemitem> package and any package dependencies mentioned in <literal>Build-Depends</literal> and/or <literal>Build-Depends-Indep</literal>. Finally, try building your package within that chrooted environment. These steps can be automated by the use of the <command>pbuilder</command> program which is provided by the package of the same name (see <xref linkend="pbuilder"/>).
ru: Убедитесь, что ваши настройки <literal>Build-Depends</literal> и <literal>Build-Depends-Indep</literal> в <filename>debian/control</filename> выставлены правильно. Лучшим способом проверить это является использование пакета <systemitem role="package">debootstrap</systemitem> для создания на базе <literal>нестабильного</literal> выпуска окружения chroot (см. <xref linkend="debootstrap"/>). Внутри окружения chroot установите пакет <systemitem role="package">build-essential</systemitem> и указанные в <literal>Build-Depends</literal> и/или <literal>Build-Depends-Indep</literal> зависимости вашего пакета. Наконец, попытайтесь собрать ваш пакет в полученном окружении chroot. Эти шаги могут быть автоматизированы, если вы будете использовать программу <command>pbuilder</command>, которая входит в пакет с тем же именем (см. <xref linkend="pbuilder"/>).

source: If you can't set up a proper chroot, <command>dpkg-depcheck</command> may be of assistance (see <xref linkend="dpkg-depcheck"/>).
ru: Если вы не можете правильно настроить chroot, вам может помочь <command>dpkg-depcheck</command> (см. <xref linkend="dpkg-depcheck"/>).

source: See the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink> for instructions on setting build dependencies.
ru: Инструкции по настройке сборочных зависимостей см. в <ulink url="&url-debian-policy;">Руководстве по политике Debian</ulink>.

source: Don't set architecture to a value other than <literal>all</literal> or <literal>any</literal> unless you really mean it. In too many cases, maintainers don't follow the instructions in the <ulink url="&url-debian-policy;">Debian Policy Manual</ulink>. Setting your architecture to only one architecture (such as <literal>i386</literal> or <literal>amd64</literal>) is usually incorrect.
ru: Не указывайте в качестве архитектуры отличное от <literal>all</literal> ли <literal>any</literal> значение, если только вы действительно не имеете это в виду. В большинстве случаев сопровождающие не следуют инструкциям <ulink url="&url-debian-policy;">Руководства по политике Debian</ulink>. Установка архитектуры в значение только какой-то одной архитектуры (такой как <literal>i386</literal> или <literal>amd64</literal>) обычно оказывается неправильным.

source: Make sure your source package is correct. Do <literal>dpkg-source -x <replaceable>package</replaceable>.dsc</literal> to make sure your source package unpacks properly. Then, in there, try building your package from scratch with <command>dpkg-buildpackage</command>.
ru: Убедитесь, что ваш пакет с исходным кодом корректен. Выполните <literal>dpkg-source -x <replaceable>пакет</replaceable>.dsc</literal> для того, чтобы убедиться, что ваш пакет с исходным кодом распаковывается правильно. Далее, попытайтесь собрать ваш пакет с нуля с помощью <command>dpkg-buildpackage</command>.

source: Make sure you don't ship your source package with the <filename>debian/files</filename> or <filename>debian/substvars</filename> files. They should be removed by the <literal>clean</literal> target of <filename>debian/rules</filename>.
ru: Убедитесь, что в вашем пакете с исходным кодом нет файлов <filename>debian/files</filename> или <filename>debian/substvars</filename>. Они должны быть удалены при помощи цели <literal>clean</literal> из <filename>debian/rules</filename>.

source: Make sure you don't rely on locally installed or hacked configurations or programs. For instance, you should never be calling programs in <filename>/usr/local/bin</filename> or the like. Try not to rely on programs being setup in a special way. Try building your package on another machine, even if it's the same architecture.
ru: Убедитесь, что вам не требуются локально установленные или исправленные настройки или программы. Например, вам никогда не следует вызывать программы из <filename>/usr/local/bin</filename> и других подобных место. Попытайтесь не использовать программы, которые были настроены каким-то специальным способом. Попытайтесь собрать ваш пакет на другой машине, даже если она принадлежит к той же архитектуре.

source: Don't depend on the package you're building being installed already (a sub-case of the above issue). There are, of course, exceptions to this rule, but be aware that any case like this needs manual bootstrapping and cannot be done by automated package builders.
ru: Не используйте при сборке пакета какие-либо уже установленные пакеты (это более конкретный вариант приведённого выше случая). Конечно, бывают и исключения для этого правила, но помните, что любой подобный случай требует ручного вмешательства и не может быть выполнен автоматическими сборщиками пакетов.

source: Don't rely on the compiler being a certain version, if possible. If not, then make sure your build dependencies reflect the restrictions, although you are probably asking for trouble, since different architectures sometimes standardize on different compilers.
ru: Если это возможно, не используйте компилятор какой-то конкретной версии. Если это невозможно, то убедитесь, что ваши сборочные зависимости отражают это ограничение, хотя вы, вероятно, просите о чём-то проблематичном, поскольку разные архитектуры иногда основываются на разных компиляторах.

source: Make sure your <filename>debian/rules</filename> contains separate <literal>binary-arch</literal> and <literal>binary-indep</literal> targets, as the Debian Policy Manual requires. Make sure that both targets work independently, that is, that you can call the target without having called the other before. To test this, try to run <command>dpkg-buildpackage -B</command>.
ru: Убедитесь, что ваш файл <filename>debian/rules</filename> содержит отдельные цели <literal>binary-arch</literal> и <literal>binary-indep</literal>, как то требуется в Руководстве по политике Debian. Убедитесь, что обе цели работают независимо друг от друга, то есть, что вы можете вызвать одну цель, не вызывая до этого другой. Для проверки этого, попытайтесь запустить <command>dpkg-buildpackage -B</command>.

source: Guidelines for porter uploads
ru: Руководство для загрузок теми, кто занимается переносом

source: If the package builds out of the box for the architecture to be ported to, you are in luck and your job is easy. This section applies to that case; it describes how to build and upload your binary package so that it is properly installed into the archive. If you do have to patch the package in order to get it to compile for the other architecture, you are actually doing a source NMU, so consult <xref linkend="nmu-guidelines"/> instead.
ru: Если пакет собирается из коробки для той архитектуры, на которую он должен быть перенесён, то вам повезло и ваша работа довольно проста. Данный раздел касается этого случая; в разделе описывается то, как собирать и загружать ваш двоичный пакет так, чтобы он был правильно установлен в архив. Если вам требуется внести изменения в пакет для того, чтобы он мог быть скомпилирован для других архитектур, вам будет нужно выполнить NMU пакета с исходным кодом, поэтому обратитесь к разделу <xref linkend="nmu-guidelines"/>.

source: For a porter upload, no changes are being made to the source. You do not need to touch any of the files in the source package. This includes <filename>debian/changelog</filename>.
ru: При загрузке тем, кто занимается переносом, изменения исходного кода не вносятся. Вам не нужно трогать какие-либо файлы в пакете с исходным кодом. Это предполагает и файл <filename>debian/changelog</filename>.

source: The way to invoke <command>dpkg-buildpackage</command> is as <literal>dpkg-buildpackage -B -m<replaceable>porter-email</replaceable></literal>. Of course, set <replaceable>porter-email</replaceable> to your email address. This will do a binary-only build of only the architecture-dependent portions of the package, using the <literal>binary-arch</literal> target in <filename>debian/rules</filename>.
ru: Можно вызвать <command>dpkg-buildpackage</command> как <literal>dpkg-buildpackage -B -m<replaceable>porter-email</replaceable></literal>. Конечно, установите ваш адрес электронной почты в качестве значения поля <replaceable>porter-email</replaceable>. При использовании цели <literal>binary-arch</literal> в <filename>debian/rules</filename> будет выполнена сборка двоичных пакетов только для зависящих от архитектуры частей пакета.

source: If you are working on a Debian machine for your porting efforts and you need to sign your upload locally for its acceptance in the archive, you can run <command>debsign</command> on your <filename>.changes</filename> file to have it signed conveniently, or use the remote signing mode of <command>dpkg-sig</command>.
ru: Если вы работаете на машине Debian для того, чтобы заниматься переносом, и вам локально требуется подписать вашу загрузку для того, чтобы она была принята в архив, вы можете запустить <command>debsign</command>, указав ваш файл <filename>.changes</filename> в целях удобства, файл будет подписан, либо вы можете использовать удалённый режим подписывания командой <command>dpkg-sig</command>.

source: Recompilation or binary-only NMU
ru: Повторная компиляция или только двоичные NMU

source: Sometimes the initial porter upload is problematic because the environment in which the package was built was not good enough (outdated or obsolete library, bad compiler, etc.). Then you may just need to recompile it in an updated environment. However, you have to bump the version number in this case, so that the old bad package can be replaced in the Debian archive (<command>dak</command> refuses to install new packages if they don't have a version number greater than the currently available one).
ru: Иногда первоначальная загрузка, связанная с переносом, проблематична из-за того, что окружение, в котором был собран пакет, не было достаточно хорошо (устаревшая или не используемая более библиотека, плохой компилятор и т. д.). Тогда вам может потребоваться заново скомпилировать пакет в обновлённом окружении. Тем не менее, в этом случае вам придётся увеличить номер версии пакета, чтобы старый плохой пакет был заменён на новый в архиве Debian (<command>dak</command> отказывается устанавливать новые пакеты, если номер их версии не больше уже доступных пакетов).

source: You have to make sure that your binary-only NMU doesn't render the package uninstallable. This could happen when a source package generates arch-dependent and arch-independent packages that have inter-dependencies generated using dpkg's substitution variable <literal>$(Source-Version)</literal>.
ru: Вам следует убедиться, что ваша двоичная NMU не приведёт к тому, что пакет перестанет устанавливаться. Это может произойти в случае, если пакет с исходным кодом порождает зависящие инезависящие от архитектуры пакеты, взаимные зависимости которые созданы подстановкой переменной dpkg <literal>$(Source-Version)</literal>.

source: Despite the required modification of the changelog, these are called binary-only NMUs — there is no need in this case to trigger all other architectures to consider themselves out of date or requiring recompilation.
ru: Несмотря на необходимое изменение журнала изменений, это называется двоичной NMU — в этом случае нет необходимости делать пакеты других архитектур устаревшими и заново их компилировать.

source: Such recompilations require special ``magic'' version numbering, so that the archive maintenance tools recognize that, even though there is a new Debian version, there is no corresponding source update. If you get this wrong, the archive maintainers will reject your upload (due to lack of corresponding source code).
ru: Для такой повторной компиляции требуется специальное ``магическое'' назначение версий, так чтобы инструменты для сопровождения архива распознали, что хотя даже и имеется новая Debian-версия, соответствующего обновления исходного кода не было. Если вы сделаете это неправильно, сопровождающие архива отклонят вашу загрузку (из-за отсутствия соответствующего исходного кода).

source: In the past, such NMUs used the third-level number on the Debian part of the revision to denote their recompilation-only status; however, this syntax was ambiguous with native packages and did not allow proper ordering of recompile-only NMUs, source NMUs, and security NMUs on the same package, and has therefore been abandoned in favor of this new syntax.
ru: В прошло подобные NMU использовали номер третьего уровня в части Debian редакции для обозначения статуса повторной компиляции; тем не менее, этот синтаксис был двусмыслен в случае родных пакетов и не позволяя правильно определять порядок заново скомпилированных NMU, NMU исходного кода и NMU безопасности одного и того же пакета, потому он был отброшен и заменён новым синтаксисом.

source: The ``magic'' for a recompilation-only NMU is triggered by using a suffix appended to the package version number, following the form <literal>b<replaceable>number</replaceable></literal>. For instance, if the latest version you are recompiling against was version <literal>2.9-3</literal>, your binary-only NMU should carry a version of <literal>2.9-3+b1</literal>. If the latest version was <literal>3.4+b1</literal> (i.e, a native package with a previous recompilation NMU), your binary-only NMU should have a version number of <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>
ru: ``Магия'' для NMU повторной компиляции включается путём использования суффикса в номере версии пакет, имеющего следующий вид: <literal>b<replaceable>номер</replaceable></literal>. Например, если последняя версия пакета, которую вы заново компилируете, была версией <literal>2.9-3</literal>, ваша двоичная NMU должна иметь версию <literal>2.9-3+b1</literal>. Если последней версией была <literal>3.4+b1</literal> (т. е., родной пакет, для которого в предыдущий раз уже была выполнена NMU с повторной компиляцией), ваша двоичная NMU должна иметь номер версии <literal>3.4+b2</literal>.<placeholder type="footnote" id="0"/>

source: Similar to initial porter uploads, the correct way of invoking <command>dpkg-buildpackage</command> is <literal>dpkg-buildpackage -B</literal> to only build the architecture-dependent parts of the package.
ru: Подобно первоначальной загрузке, связанной с переносом, правильный вызов <command>dpkg-buildpackage</command> имеет вид <literal>dpkg-buildpackage -B</literal>, что означает, что будут собраны только зависящие от архитектуры части пакета.

source: When to do a source NMU if you are a porter
ru: Когда следует делать NMU, если вы занимаетесь переносом

source: Porters doing a source NMU generally follow the guidelines found in <xref linkend="nmu"/>, just like non-porters. However, it is expected that the wait cycle for a porter's source NMU is smaller than for a non-porter, since porters have to cope with a large quantity of packages. Again, the situation varies depending on the distribution they are uploading to. It also varies whether the architecture is a candidate for inclusion into the next stable release; the release managers decide and announce which architectures are candidates.
ru: Те, кто занимаются переносом и выполняют NMU исходного кода, следуют советам из <xref linkend="nmu"/>, как и те, кто переносом не занимается. Тем не менее, ожидается, что цикл ожидания для NMU исходного кода, выполненной тем, кто занимается переносом, меньше, чем для того, кто переносом не занимается, поскольку те, кто занимается переносом, должны охватить большое количество пакетов. Опять же, ситуация зависит от того, в какой выпуск они хотят осуществить загрузку. Также важно то, является ли данная архитектура кандидатом на включение в следующий стабильный выпуск; управляющие выпуском решают и сообщают о том, какие архитектуры являются такими кандидатами.

source: If you are a porter doing an NMU for <literal>unstable</literal>, the above guidelines for porting should be followed, with two variations. Firstly, the acceptable waiting period — the time between when the bug is submitted to the BTS and when it is OK to do an NMU — is seven days for porters working on the <literal>unstable</literal> distribution. This period can be shortened if the problem is critical and imposes hardship on the porting effort, at the discretion of the porter group. (Remember, none of this is Policy, just mutually agreed upon guidelines.) For uploads to <literal>stable</literal> or <literal>testing</literal>, please coordinate with the appropriate release team first.
ru: Если вы не занимаетесь переносом и выполняете NMU для <literal>нестабильного</literal> выпуска, вам следует придерживаться приведённых выше советов по переносу, но с двумя изменениями. Во-первых, период ожидания принятия — время между тем, когда было сообщено об ошибке в систему отслеживания ошибок, и тем, когда для NMU наступает подходящее время — равен семи дням для тех, кто занимается переносом, и работает над <literal>нестабильным</literal> выпуском. Этот период может быть уменьшен по усмотрению тех, кто занимается переносом, в случае, если проблема является критической и представляет собой серьёзную трудность для процесса переноса пакета. (Помните, это не является Политикой, это лишь негласно принято в сообществе.) Для выполнения загрузки в <literal>стабильный</literal> или <literal>тестируемый</literal> выпуски свяжитесь с соответствующей выпускающей командой.

source: Secondly, porters doing source NMUs should make sure that the bug they submit to the BTS should be of severity <literal>serious</literal> or greater. This ensures that a single source package can be used to compile every supported Debian architecture by release time. It is very important that we have one version of the binary and source package for all architectures in order to comply with many licenses.
ru: Во-вторых, те, кто занимается переносом и выполняют NMU исходного кода, должны убедиться, что сообщение об ошибке, отправленное в систему отслеживания ошибок, имеет важность <literal>serious</literal> или выше. Это гарантирует, что отдельный пакет с исходным кодом может использоваться для компиляции пакета для каждой поддерживаемой Debian на момент выпуска архитектуры. Важно, что у нас имеется одна версия двоичного пакета и пакета с исходным кодом для всех архитектур для того, чтобы соответствовать множеству лицензий.

source: Porters should try to avoid patches which simply kludge around bugs in the current version of the compile environment, kernel, or libc. Sometimes such kludges can't be helped. If you have to kludge around compiler bugs and the like, make sure you <literal>#ifdef</literal> your work properly; also, document your kludge so that people know to remove it once the external problems have been fixed.
ru: Те, кто занимаются переносом, должны попытаться избежать заплат, которые просто обходят ошибки в текущей версии окружения компиляции, ядра или libc. Иногда такие клиджи не могут помочь. Если вам нужно обойти ошибки компилятора или чего-то подобного, убедитесь, что вы выполнили корректно <literal>#ifdef</literal> для своей работы; также, документируйте ваши клиджи, чтобы люди знали, как удалить их когда внешние проблемы будут исправлены.
